{
    "place_id": "ChIJz1jvncTfhVQRMe0I5OVEnGY",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvd0w2RHlBRRAB",
            "reviewer_name": "Martin Ridgway",
            "rating": 5,
            "review_text": "Excellent as always. Far enough from the airport to be quiet and yet still have walkable and short drive distances to dinner meals. Excellent corporate style breakfast buffet. Eggs, couple of meats, couple of non-meats all hot. Rotates through a few choices during the week. Good pool and hot tub indoors. Parking included.",
            "published_at": "3 days ago",
            "published_at_date": "2023-11-19 02:49:40.185703",
            "response_from_owner_text": "Martin Ridgway We greatly appreciate you taking the time to share your positive experience with us! It brings us immense joy to hear that you found your stay excellent and enjoyed the various amenities we offer. Were delighted to know that our location provided the perfect balance quiet enough to ensure a peaceful stay, yet conveniently close to walkable and short drive distances for dining options. Your feedback on our corporate-style breakfast buffet is especially gratifying; were thrilled to hear that the selection of eggs, meats, non-meats, and the rotating choices throughout the week met your expectations. Its wonderful to learn that you had a relaxing time at our indoor pool and hot tub. We strive to create an environment where our guests can unwind and make the most of their stay. Were also pleased that our complimentary parking added to the convenience of your visit. Providing hassle-free services is a priority for us, and were delighted to have exceeded your expectations. Thank you again for choosing [Hotel Name], and we look forward to welcoming you back for another exceptional stay. If you have any specific preferences for your next visit or if theres anything else we can assist you with, please dont hesitate to let us know. Safe travels, and we cant wait to host you again!",
            "response_from_owner_ago": "a day ago",
            "response_from_owner_date": "2023-11-21 02:49:40.185703",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 54,
            "total_number_of_photos_by_reviewer": 188,
            "reviewer_url": "https://www.google.com/maps/contrib/105959502757701847225/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGejdLY05BEAE",
            "reviewer_name": "Anne Marcelo",
            "rating": 5,
            "review_text": "We always go back to this place. Close to the ice hockey arena, swimming, cinema, bowling lane and dining. They serve free breakfast at this location. Dining is always a pleasure. Well run kitchen.  Kitchen crew amazing! Very friendly and attentive to the clients needs especially Elbora and Josefina!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 02:49:40.188588",
            "response_from_owner_text": "Anne Marcelo Thank you so much for taking the time to share your positive experiences with us! Were thrilled to hear that you always choose to return to our establishment and that our location near the ice hockey arena, swimming facilities, cinema, and bowling lane adds to the convenience of your visits. Its wonderful to know that you find dining at our location to be a pleasure. We take great pride in our well-run kitchen and are delighted that youve highlighted the amazing efforts of our kitchen crew. Elnora and Josefina will be especially pleased to hear that their dedication to providing excellent service has been recognized. Well make sure to pass along your compliments to them. We appreciate your kind words about our free breakfast service and are pleased to hear that our team is attentive to your needs. Creating a positive and memorable experience for our clients is our top priority, and feedback like yours motivates us to continue delivering exceptional service. We look forward to welcoming you back on your next visit, and please dont hesitate to reach out if theres anything specific youd like us to enhance or if you have any special requests. Thank you again for your continued patronage and for choosing to stay with us!",
            "response_from_owner_ago": "5 days ago",
            "response_from_owner_date": "2023-11-17 02:49:40.188588",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112909751688424361423/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacElhUmJBEAE",
            "reviewer_name": "Tanya Smith",
            "rating": 5,
            "review_text": "Very nice hotel with great amenities. Staff were very friendly and helpful. Good buffet breakfast. Only issue we had was with the shuttle service. We had rented a vehicle at the airport when we arrived and for the next day. When we returned the rental, the hotel wouldn t send a shuttle to pick us up. We ve done this before at other hotels so this was a bit of an inconvenience but we just took a Lyft back.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 02:49:40.191195",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106074611959311152774/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNmFUQkFnEAE",
            "reviewer_name": "Gordon Gamlin",
            "rating": 5,
            "review_text": "Amazing staff and luxuriously large rooms. Popular with air travellers. Consider pairing with a night at the movies and dinner nearby for a date night out. It may just be the perfect escape, right at your doorstep.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 02:49:40.193013",
            "response_from_owner_text": "Gordon Were delighted to hear that you had such a wonderful experience at our establishment! Thank you for taking the time to share your thoughts with us. We take great pride in our dedicated staff members who consistently go above and beyond to ensure our guests have a memorable stay. Its heartwarming to know that their efforts were appreciated during your visit. Our spacious rooms are designed with your comfort in mind, and were pleased that you found them luxurious. We understand that air travelers often seek a peaceful oasis, and we aim to provide just that. Your suggestion of pairing your stay with a night at the movies and dinner nearby for a date night out is fantastic! Our convenient location makes it easy to access various entertainment and dining options, creating a well-rounded experience for our guests. Were thrilled to be considered the perfect escape right at your doorstep. Its our goal to offer a haven of relaxation and enjoyment for all our guests, and were glad to have achieved that for you. Thank you for choosing us for your stay, and we look forward to welcoming you back for another memorable experience in the future!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 02:49:40.193013",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/101081476898517129908/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOFpfaVRREAE",
            "reviewer_name": "Don Davidson",
            "rating": 5,
            "review_text": "It may not be the best HIE Ive stayed at, but its close. Wonderful staff. Indoor pool, hot tub, ice machine--all works as it should. Free breakfast is terrific, with lots of options, many of them hot. Fitness center could use a set of free weights, but is otherwise quite nice. Plenty of free parking. Close to a mall with movie theaters, restaurants nearby.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:49:40.195710",
            "response_from_owner_text": "Hi Don Thank you for taking the time to provide your feedback on your recent stay at our Holiday Inn Express. We appreciate your kind words and your observations. Were glad to hear that our staff left a positive impression on you with their service. Its great to know that our facilities, including the indoor pool, hot tub, and ice machine, were in good working order and contributed to your stay. Were pleased that you enjoyed our complimentary breakfast, and were happy to offer a variety of options to suit different preferences. Thank you for your suggestion about the fitness center; well definitely take that into consideration as we aim to improve our amenities. Our convenient location near a mall with movie theaters and restaurants is intended to provide our guests with easy access to entertainment and dining options. Were grateful that you chose to stay with us and that you found your overall experience to be close to being the best Holiday Inn Express youve stayed at. We value your feedback and hope to have the opportunity to welcome you back in the future. If theres anything else youd like to share or any suggestions you have, please feel free to let us know. Safe travels and thank you for choosing our hotel!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 02:49:40.195710",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 344,
            "total_number_of_photos_by_reviewer": 1244,
            "reviewer_url": "https://www.google.com/maps/contrib/118092379008725084260/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNkptYU93EAE",
            "reviewer_name": "Cipriano Tiongson",
            "rating": 5,
            "review_text": "Hello they have great excellent breakfast plus the service are great always have more food . The crew is excellent special the manager breakfast good to communicate with the guest there problem Rooms: Big rooms even standard Walkability: Movie theatre and restaurant Food & drinks: Breakfast is excellent",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 02:49:40.197841",
            "response_from_owner_text": "Cipriano Tiongson Thank you for taking the time to share your positive experience with us! Were delighted to hear that you enjoyed our excellent breakfast and that our service exceeded your expectations. Providing a satisfying and memorable stay for our guests is our top priority, and we appreciate your kind words. Its fantastic to know that you found our crew, especially the breakfast manager, to be excellent. We believe that good communication is key to ensuring a pleasant experience for our guests, and were glad that it resonated with you. Your feedback is truly valuable to us, and it motivates our team to continue delivering exceptional service. If theres anything specific you particularly enjoyed or if you have any suggestions for improvement, wed love to hear more. We look forward to the opportunity to welcome you back for another great experience.",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-15 02:49:40.197841",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108276837132107838638/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweHJIOU1BEAE",
            "reviewer_name": "Carole Wood",
            "rating": 5,
            "review_text": "The staff at this hotel were all super friendly from the man who picked us up from the airport in the middle of the night, to the breakfast ladies, front desk staff and the people who cleaned the rooms. The hotel was clean and quiet. The breakfast was good. Would stay again.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:49:40.200283",
            "response_from_owner_text": "Thank you for sharing your wonderful experience with us! Were delighted to hear that your stay at our hotel was a positive one from start to finish. Its fantastic to know that our staffs friendliness left a lasting impression on you, starting with the late-night airport pickup all the way to the breakfast team, front desk staff, and housekeeping. We believe that exceptional service comes from the heart, and your kind words reaffirm our commitment to delivering the best possible experience for our guests. Were glad that you found our hotel to be clean and quiet, allowing for a comfortable and relaxing stay. Providing a peaceful environment is important to us. Its also great to hear that you enjoyed our breakfast offerings. Starting the day with a good meal is essential, and were pleased that we could contribute to your positive experience. Thank you for considering us for future stays as well. We would be absolutely thrilled to welcome you back whenever your travels bring you to the area again. If theres anything more we can do to make your next stay even better, please dont hesitate to let us know. Safe travels, and looking forward to your return! Farah Dawood General Manager",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 02:49:40.200283",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 80,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/103562755433486639965/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2NLZjN3RRAB",
            "reviewer_name": "Xiangyu Zhou",
            "rating": 5,
            "review_text": "Holiday Inn Express & Suites Riverport Richmond, an IHG Hotel was a good place to stay. Yes, its not very close to downtown Richmond, but not very far away either. With 10+ minutes driving you can get anywhere. The hotel room was large with much needed amenities, and the breakfast was free. Parking was free as well. Overall its not bad to stay here.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:49:40.203773",
            "response_from_owner_text": "Xiangyu Zhou Were delighted to receive your positive feedback about your stay at the Holiday Inn Express & Suites Riverport Richmond! Thank you for taking the time to share your experience with us. Were glad to hear that our location, although not right in downtown Richmond, still offered convenience for you with a short drive to various destinations. Its great to know that you found the hotel room spacious and well-equipped with the amenities you needed for a comfortable stay. Our complimentary breakfast and free parking are designed to enhance our guests experience, and were pleased to hear that these offerings added value to your stay. We appreciate your kind words about your overall experience and your recognition that its a good choice to stay with us. Thank you for choosing our hotel, and we hope to have the pleasure of welcoming you back in the future. If theres anything else we can do to make your future stays even better, please dont hesitate to let us know. Safe travels!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 02:49:40.203773",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 291,
            "total_number_of_photos_by_reviewer": 2517,
            "reviewer_url": "https://www.google.com/maps/contrib/118215519041868550457/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOXF1b21nRRAB",
            "reviewer_name": "Samantha M",
            "rating": 5,
            "review_text": "Flight was cancelled at 1am and we needed a place to stay for the night. This holiday inn express location was amazing. Super nice, close to the airport, and accommodating. Would definitely recommend!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:49:40.206016",
            "response_from_owner_text": "Thank you for taking the time to share your experience with us. Were sorry to hear about your flight cancellation but were truly pleased to have been able to provide you with a comfortable and accommodating stay during what must have been a challenging situation. Were thrilled to hear that you found our Holiday Inn Express to be a great option for your unexpected overnight stay. Being conveniently located near the airport is something we take pride in, and were glad that it worked well for you. Thank you for your recommendation. It means a lot to us that you had a positive experience with us despite the circumstances. If youre ever in the area again, whether for a layover or any other reason, wed be more than happy to welcome you back. Safe travels, and we appreciate your kind words! Farah Dawood General Manager",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 02:49:40.206016",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105574137576523346191/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa1lYSTFnRRAB",
            "reviewer_name": "Pam Yu",
            "rating": 5,
            "review_text": "We had a very pleasant stay. The staff was really helpful, kind and courteous. Good service. The location of the hotel is great and close to everything. Thank you Juvy and Staff!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 02:49:40.208499",
            "response_from_owner_text": "I wanted to personally reach out and express my heartfelt gratitude for the wonderful review you shared about your recent experience with us. We were absolutely thrilled to read your kind words, and Im truly grateful for your generous feedback. Your review not only brought smiles to our faces but also serves as a tremendous source of motivation for our entire team. Its truly rewarding to know that we were able to exceed your expectations and make your stay with us a memorable one.",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 02:49:40.208499",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/106810507388473565799/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOFlTQll3EAE",
            "reviewer_name": "Brian Behounek",
            "rating": 5,
            "review_text": "We stayed in Vancouver for one night prior to going on a cruise. The Holiday Inn Express was a nice hotel and the staff was very friendly and helpful. Even though the hotel was totally booked, the service was excellent.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:49:40.926458",
            "response_from_owner_text": "Thank you for taking the time to share your feedback about your recent stay at the Holiday Inn Express in Vancouver. Were thrilled to hear that you had a positive experience during your short stay with us. Its wonderful to know that our hotel met your expectations and that our staff left a positive impression on you with their friendly and helpful attitude. We take pride in delivering excellent service even during busy times, and were glad to hear that you found the service to be top-notch despite the hotel being fully booked. Were honored that you chose to stay with us before your cruise, and we hope you had a fantastic time on your cruise as well. If you ever find yourself back in Vancouver, wed be delighted to welcome you back to our hotel. Safe travels and thank you for your kind words!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 02:49:40.926458",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/107846572844467187728/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSejl6VlVBEAE",
            "reviewer_name": "Amit Sibal",
            "rating": 5,
            "review_text": "Best place for staying. Great staff front desk, house keeping and dining. Always got great deals. Clean and nice atmosphere around the hotel. With lots of parking for the guest. Good breakfast option for everyday in the morning.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:49:40.931291",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 20,
            "reviewer_url": "https://www.google.com/maps/contrib/112888230894669528719/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNUxTN2hBRRAB",
            "reviewer_name": "Jae Chang",
            "rating": 5,
            "review_text": "a little out of the way but next to the giant movie theater and the ice rink. Staff are friendly and they had some complimentary toothpaste so i didnt have to go out to get some free continental breakfast and swimming pool with jacuzzi. best stay for a family with kids. not too many dining options in the area but its about a 15min drive to Richmond",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 02:49:40.934546",
            "response_from_owner_text": "Jae Chang Thank you for taking the time to share your experience with us. Were thrilled to hear that you enjoyed your stay at our hotel, and we appreciate your positive comments about our friendly staff and the convenient amenities we offer. Its great to know that you found our location near the giant movie theater and ice rink to be convenient. We strive to provide a comfortable and welcoming environment for our guests, and were pleased that the complimentary toothpaste was a helpful touch during your stay. Were also delighted that you and your family were able to take advantage of our free continental breakfast and enjoyed the swimming pool with a jacuzzi. Creating a family-friendly atmosphere is a top priority for us, and were glad to have met your expectations in this regard. We understand that dining options in the immediate area are limited, but were pleased to hear that the 15-minute drive to Richmond was manageable for you. Your feedback is valuable, and well certainly take it into consideration as we continue to enhance our guest experience. We hope to have the pleasure of welcoming you and your family back in the future. If theres anything specific youd like to share or if you have further suggestions, feel free to reach out. Thank you for choosing to stay with us.",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-15 02:49:40.934546",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 317,
            "total_number_of_photos_by_reviewer": 201,
            "reviewer_url": "https://www.google.com/maps/contrib/116352208471423079130/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4d3VMQ2NREAE",
            "reviewer_name": "ajay k Tandon",
            "rating": 5,
            "review_text": "Wonderful place to stay. Great service by Humera Chowdhry and General Manager Farah Dawood.  They are credit to this hotel as Humera did everything possible to make our stay comfortable.  The front lobby and hallways were immaculate. The front desk staff where friendly, gratefull we had chosen their accommodations, treated us with respect and made us feel at home. The room was amazingly clean, bathroom had sufficient towels. This is one of the best places to stay that I have been in for a long time. The breakfast was exceptional, and the atmosphere was great. I would reccomend this to anyone.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 02:49:40.938598",
            "response_from_owner_text": "Thank you for your incredibly kind and thoughtful review. Were thrilled to hear that you had such a wonderful experience during your stay with us. Were delighted that Humera Chowdhry and General Manager Farah Dawood made a positive impact on your stay. Its our dedicated staff members who truly make a difference, and were proud to have them as part of our team. Providing exceptional service and ensuring your comfort is our top priority, and were glad that Humera went above and beyond to make your stay special. Were also pleased that you found the cleanliness of our lobby, hallways, and room to your satisfaction. A clean and comfortable environment is essential for a great stay, and were pleased to have met your expectations. Its wonderful to know that you enjoyed our breakfast offerings and the overall atmosphere of our hotel. Your recommendation means the world to us, and were grateful for your kind words. Thank you once again for choosing us as your place to stay, and we look forward to the pleasure of welcoming you back in the future. If you need anything or have any further feedback, please feel free to reach out to us.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 02:49:40.938598",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/103304225392967955815/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweGVIQTJBRRAB",
            "reviewer_name": "Derek Gou",
            "rating": 5,
            "review_text": "Great rooms, great location, kind staff! The breakfast was also decent, and they do have a small pool, treadmills, and dumbells. Rooms: Quite large and love the design! Everything we needed.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 02:49:40.941894",
            "response_from_owner_text": "Thank you so much for taking the time to share your experience with us! Were thrilled to hear that you enjoyed your stay at our hotel. Its fantastic to know that you found our rooms to be great, our location convenient, and our staff kind and attentive   we always strive to create a welcoming atmosphere for our guests. Were glad you appreciated the breakfast we offer. We believe that a good start to the day begins with a satisfying meal. Additionally, were pleased to offer amenities like the small pool, treadmills, and dumbbells to cater to your fitness needs during your stay. Your feedback is invaluable to us, and we look forward to the opportunity to welcome you back in the future. If theres anything more we can do to make your next stay even better, please dont hesitate to let us know. Safe travels until then!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 02:49:40.941894",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 32,
            "total_number_of_photos_by_reviewer": 34,
            "reviewer_url": "https://www.google.com/maps/contrib/102471796161592532531/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOV9PWk1REAE",
            "reviewer_name": "Erika Holstein",
            "rating": 5,
            "review_text": "Stayed in a room for a week with 3 young kids, I loved how the room had a bedroom off the main living room and the counter that worked perfectly for them. Breakfast was always good and served at great times. The cooks even helped us out when getting there plates... such amazing help. I would 100% stay here again such a great stay.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 02:49:40.945128",
            "response_from_owner_text": "Erika we are truly happy to hear you and your family enjoyed your stay. Our breakfast crew are truly a big part of the team and it pleases me to know they went above and beyond for you all.  We look forward to seeing you all again soon",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 02:49:40.945128",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108840480339535305703/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1X3I2UHR3RRAB",
            "reviewer_name": "Paul Marleau",
            "rating": 5,
            "review_text": "The best hotel in Richmond. Farah, the manager is so nice. I highly recommend.",
            "published_at": "4 weeks ago",
            "published_at_date": "2023-10-25 02:49:40.948558",
            "response_from_owner_text": "Paul It was such a pleasure meeting you on Tuesday and we thank you for the amazing review. We appreciate you staying with us and I will make sure your mimosa will be ready for your morning breakfast.",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-11-01 02:49:40.948558",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 61,
            "total_number_of_photos_by_reviewer": 169,
            "reviewer_url": "https://www.google.com/maps/contrib/100287441874015816108/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdWFyUm1BRRAB",
            "reviewer_name": "Lisa Whited",
            "rating": 5,
            "review_text": "Customer service is great, staff are a fun group! Ambiance was ramped up by their holiday decorations, along with that little skiff of recent snow. Nice, clean room! 15-minute shuttle from YVR. Lots of family fun amenities very close by.",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 02:49:40.952071",
            "response_from_owner_text": "Lisa it was a pleasure meeting you and checking you in. Christmas is a special time for us as we love all the decorations and lights to cheer up the night. We are thrilled that you got to enjoy our hotel and we look forward to seeing you again soon.",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 02:49:40.952071",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/113445213392044602688/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ejZqcUh3EAE",
            "reviewer_name": "Corey Jones",
            "rating": 5,
            "review_text": "Always a pleasant stay. Friendly staff. Spacious and comfortable rooms. Will definitely stay there again.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 02:49:40.955160",
            "response_from_owner_text": "Corey Jones I wanted to personally reach out and express my heartfelt gratitude for the wonderful review you shared about your recent experience with us. We were absolutely thrilled to read your kind words, and Im truly grateful for your generous feedback. Your review not only brought smiles to our faces but also serves as a tremendous source of motivation for our entire team. Its truly rewarding to know that we were able to exceed your expectations and make your stay with us a memorable one. We take great pride in providing exceptional service and ensuring that our guests feel genuinely cared for during their time with us. It brings us immense joy to know that our efforts made a positive impact on your stay",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 02:49:40.955160",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/111714693016488860675/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVMGI2RXlRRRAB",
            "reviewer_name": "David Robert",
            "rating": 5,
            "review_text": "It gets the stars for 2 main reasons . First is an early check in. Let me check in at noon! Second ; 5 $ a day long term parking . Yes,The breakfast is amazing . On Sundays its special .looking forward to this - returning for work . Area is kinda tucked away and quiet . A sprawling underused industrial block amongst farm land . Within walking distance there is a rec center , movie theater , brew pub , ice rink... Drive to the end of no5 or a number of other roads and there are nice natural spaces and parks a good place when you unexpectedly have a long lay over or a early morning flight . Longterm parking with the airport shuttle make it all the sweeter. I missed it by a minute and they called it back for me . The morning breakfast was beefy . Pancakes,  biscuits,  sausage,  Turkey sausage   , scrambled eggs , beans, coffee , juice , fruitloops and muffins bagels ! Typically cheap as well Id give it a HELLS YEAH . Nearby activities: Theater , ice rink , Lazer tag , air park , bar , gym ,pool",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 02:49:40.957941",
            "response_from_owner_text": "Hi David Thank you for taking the time to share your positive experience with us! We are thrilled to hear that you had a pleasant stay and that our early check-in option and affordable long-term parking made your visit more convenient. We are delighted to know that you enjoyed our breakfast offerings, especially the special Sunday breakfast. Our team takes pride in providing a delicious and varied menu to start your day right. Its great to hear that you explored the area and found some interesting attractions within walking distance, such as the recreational center, movie theater, brew pub, and ice rink. We are indeed located in a unique and peaceful area, surrounded by nature and recreational activities. The proximity to natural spaces and parks at the end of No. 5 and other nearby roads offers our guests the opportunity to unwind and enjoy the outdoors. We appreciate your kind words and are pleased to learn that you are considering returning for work. We look forward to welcoming you back and providing you with another enjoyable stay. If there is anything specific you would like to experience or if you have any special requests for your next visit, please do not hesitate to let us know. Safe travels and see you soon!",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 02:49:40.957941",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 68,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/101694394074243161666/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScXBpOGp3RRAB",
            "reviewer_name": "Ping Guan",
            "rating": 5,
            "review_text": "Great weekend family vacation place, love the swimming pool. Friendly staff clean environment and delicious breakfast all you dream about. Highly recommend! Food & drinks: Delicious breakfast buffet",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:49:41.648198",
            "response_from_owner_text": "Thank you so very much for the great review. We are extremely happy for the recommendation and happy that your stay went well. We look forward to seeing you again",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 02:49:41.648198",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 118,
            "total_number_of_photos_by_reviewer": 191,
            "reviewer_url": "https://www.google.com/maps/contrib/104673053775751206894/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1czY2dzh3RRAB",
            "reviewer_name": "James Griff",
            "rating": 5,
            "review_text": "We had 12 couples in our group and it was our consensus that the hotel and its staff was great.   The food was great and all of our questions were answered with a smile.   We would like to give Yashman an extra thank you for her friendly smile and willingness to help us with anything we needed from checking in early to arranging transportation for when we leave.   She was fantastic! Thank to Yashman and the staff for a great stay at the Holiday Inn Express.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:41.652177",
            "response_from_owner_text": "James , Thank you so much for the 5 star review. This will bring a smile to the team as they work hard to ensure your stay is as comfortable as it was. Yashaman is truly a star employee who goes above and beyond. I have passed on your good wishes. we thank you for taking the time to give us your feedback and we look forward to seeing you on your next visit to Vancouver.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:41.652177",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104695273602546015803/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NmV6bFB3EAE",
            "reviewer_name": "TKO Transport LLC",
            "rating": 5,
            "review_text": "Probably the best hotel room I ve ever stay at. Alittle disappointed that when I was in line waiting my turn to check-in, one of the front desk clerks bypassed me and checked in another customer which I thought was rude. I hate to even bring this up. I m Black and the Indian front desk clerk checked in a White family ahead of me even though I was there first. I was so tired and just wanted to relax that it really didn t hit me till after I got in my room. For such a perfect hotel, that moment kinda ruined my stay. Still get 5 stars because this is the second time I ve stayed at this hotel and the front desk clerk, she was mixed with glasses, was beyond amazing.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:41.655493",
            "response_from_owner_text": "Sir I am so sorry that is how you felt. It is not our intention to make you feel that way. On behalf of my team and I, we would like for you to give us another opportunity to make it up to you. We thank you for your honest feedback and please reach out to me when you are in Vancouver and I will be more than happy to assist. Best Regards Farah GM.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:41.655493",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 60,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/116369533684514117185/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeHRDcGNREAE",
            "reviewer_name": "Hollie Gregory",
            "rating": 5,
            "review_text": "The hotel was clean and nice. Breakfast choices; eggs, sausage, Pancakes, muffins, bagels, cereal, yogurt, juice. They say they have a 24 hour shuttle. I called them from the airport and they said it wasnt running and to just take a taxi and they would cover the $34 flat rate, which they did but it took us over an hour in line waiting for our taxis. Frustrating. Overall though, a nice place to stay.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:41.658623",
            "response_from_owner_text": "Hollie please accept our apologies. I assure you that your concerns have not gone unnoticed and we apologize for the inconvenience, We are trying to accommodate all our guests as best as we can.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:41.658623",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 280,
            "total_number_of_photos_by_reviewer": 1426,
            "reviewer_url": "https://www.google.com/maps/contrib/116400890188276831156/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSb2RILTZnRRAB",
            "reviewer_name": "Isabel Arsenault",
            "rating": 5,
            "review_text": "Very well located, very clean and beautiful suite. Nice restaurant located beside with good prices. One of my favorite stays.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:49:41.661570",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 545,
            "total_number_of_photos_by_reviewer": 1447,
            "reviewer_url": "https://www.google.com/maps/contrib/100468731802821275555/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4a296S0FREAE",
            "reviewer_name": "Shona LaFortune",
            "rating": 5,
            "review_text": "Excellent breakfast. Could have used more USB chargers rather than just one on the TV.  Quiet room.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:49:41.664938",
            "response_from_owner_text": "We greatly appreciate your recognition of our efforts, and we will continue to work hard to maintain the highest standards of quality and customer satisfaction. If there is anything else we can assist you with or if you have any further feedback or suggestions, please feel free to reach out to us. Once again, thank you for choosing The Holiday Inn Express Riverport Richmond and for sharing your positive experience. We look forward to serving you again in the future!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 02:49:41.664938",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 29,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103285630239847492629/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1b0stTk13EAE",
            "reviewer_name": "JP",
            "rating": 5,
            "review_text": "Very good stay with clean rooms that had a fridge and microwave. Staff was very pleasant along with breakfast options both for veg and non-veg people. Free parking as well was a big plus and it s a central location to Vancouver Airport, Vancouver downtown and Ferry terminals.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:41.668223",
            "response_from_owner_text": "JP We appreciate you taking the time to give us some amazing feedback. I will be sure to pass this on to my team. Best Regards Farah GM",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:41.668223",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 64,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107604352642296696761/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMHRHUExREAE",
            "reviewer_name": "Lawrence Kim",
            "rating": 5,
            "review_text": "I know, it is in the middle of nowhere, which is saying something for Vancouver. But you know what? Thats the benefit: absolute quiet. Excellent facilities, a great breakfast buffet, and the staff are so friendly and professional. We had an excellent time there and we wouldnt hesitate to stay there again. Highly recommended.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:41.671318",
            "response_from_owner_text": "Hello Lawrence Kim, Thank you kindly for the wonderful review! We greatly appreciate all 5 stars. The team will be blown away to read your review of our facilities, breakfast buffet and team. We are looking forward to your next visit!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:41.671318",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 35,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/103323539984007311891/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN01hTnZnRRAB",
            "reviewer_name": "Amanda S",
            "rating": 5,
            "review_text": "I really enjoyed this hotel, hotel pick up from the airport, huge delicious breakfast which is included in the stay and the kids and I had the pool to ourselves. Subway is very close along with the movie theater, unfortunately the water park in walking distance was closed for maintenance but would definitely stay here again.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:41.674502",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/105727986749112874163/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMzVtb2FnEAE",
            "reviewer_name": "God highly favored Edmundo Jr Tubongbanua",
            "rating": 5,
            "review_text": "Thank you again for everything. This is my second review of this facility. Top-notch facility, staff, service, and value. Please pass my thanks to the Kitchen esp Sis Jovy and Sis Joy---we were satisfied with the amazing food. Thank you also to the housekeeping department - its very clean and super comfortable. The concierge staffs also were extremely attentive to every detail and very professional. Thank you, everyone.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:41.676800",
            "response_from_owner_text": "Hello Edmundo, We absolutely love guests like yourself! Thank you for taking the time to write such a wonderful review. We appreciate it immensely. The team will take such pride in your comments on our hotel being top-notch. We hope to welcome you back soon so that we can continue to get such special reviews like this one.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:41.676800",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/105038446418262956132/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbzRfWVVnEAE",
            "reviewer_name": "Joanne Lyon",
            "rating": 5,
            "review_text": "Great hotel.  Breakfast was amazing and they even offered a packed breakfast for the mornings we had to leave before breakfast opened.  Yasmin at the front desk was very nice and explained the bus/train routes.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:42.371874",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 101,
            "reviewer_url": "https://www.google.com/maps/contrib/100431016723632371444/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNGVIdW5nRRAB",
            "reviewer_name": "Ryan T",
            "rating": 5,
            "review_text": "Affordable rates out of the hustle and bustle of the main city. Close proximity to good restaurants and entertainment. Staged here for a cruise- close drive to leave vehicle at airport long term parking. Would stay again",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:42.377036",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/116993477340029721830/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbGJHcGtRRRAB",
            "reviewer_name": "NANA NANA",
            "rating": 5,
            "review_text": "Stayed 4 weeks on business. This hotel was awesome. The staff were very professional and helped immediately when asked for help. The rooms were very clean and the beds were pillow top and comfortable. The suites have separate bedroom with full kitchen and large smart TV in living room and bedroom. Never heard noise from my room. Really enjoyed the dining room and morning hot breakfast. Seemed very popular with all the guests. They thought of everything a guest would want. Loved the indoor swimming pool water was not cold and hot tub was very clean. Would definitely stay here when traveling back to the Vancouver area again. Close to everything and best restaurants nearby. Top rated hotel.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 02:49:42.380937",
            "response_from_owner_text": "Dear Ms. Chustz, Thank you so much for your 5 Star rating in regards to your stay with us.  We enjoyed seeing you daily throughout the hotel, between our breakfast room and the pool area.   I am very pleased to hear that you were comfortable in your room and our hot breakfast was enjoyable. Glad to hear that you also were able to enjoy the restaurants within the area, as there are quite a few. We will miss you and we look forward to accommodating you again on your next visit to Vancouver, BC Kind Regards, Karen McFerran Hotel Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-22 02:49:42.380937",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109135716064431642063/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcGVQVThBRRAB",
            "reviewer_name": "Judy Quartly",
            "rating": 5,
            "review_text": "Lobby was very inviting to the regular traveller. Check in was seamless and quick . The section we were in had  renovations to the hallways  making you feel relaxed.  The room was pleasant with everything you would need . Beds very comfortable and we all had a great sleep The morning continental breakfast was Wonderful!!! Ive never seen such great selection of food. I would recommend this hotel to all travelers for a great stay with great prices.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:42.384770",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 67,
            "total_number_of_photos_by_reviewer": 57,
            "reviewer_url": "https://www.google.com/maps/contrib/102663884462427382789/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcU9uanZnRRAB",
            "reviewer_name": "Mike Sal GeneralMail",
            "rating": 5,
            "review_text": "I was helped by Jenna M. and Yashman Brar. They are great customer service attendants at this hotel. I could not as for a better service and attention to details then these two. Yashman was particularly amazing. Always ask for her.  She is always smiling and gives attention to your concerns. The hotel was ok and just like any other Holiday Inn place. Breakfast was ok too. Although the breakfast restaurant is extremely small and limited with space to sit but no complaints.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:42.388011",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109960384586918025615/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aUsyamRnEAE",
            "reviewer_name": "Candace MacInnis",
            "rating": 5,
            "review_text": "I originally only had 1 night booked and called a couple days prior to my original arrival and booked in an extra night. When I arrived, they didn t have my extra night in the system but quickly worked it out for me and it wasn t an issue. We had an excellent room, bed was comfy, room was clean and breakfast was great.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:42.390869",
            "response_from_owner_text": "Candace, From my team to you, thank you so much for the amazing feedback. It is appreciated and i will pass this onto my team. We are looking forward to your return and please reach out if you need any further assistance with your next trip.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:42.390869",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/113754457576162240862/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dXQtZVFnEAE",
            "reviewer_name": "Tze-Yiu Yong",
            "rating": 5,
            "review_text": "Fantastic service. Breakfast was great even though it was really busy. Hotel was busy overall with some hockey teams at the hotel for a tournament - however, the hotel did not seem overly crowded or noisy. Workout room was adequate and pool was great - nice heated pool with a nice Jacuzzi tub. Location of the hotel was great as well at the Riverport Entertainment Centre. Very lively location but not too loud.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:42.394273",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 19,
            "reviewer_url": "https://www.google.com/maps/contrib/100580416265526522244/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNS1QYzF3RRAB",
            "reviewer_name": "Joshua Daniel Riedner",
            "rating": 5,
            "review_text": "We stayed here for our Wedding night and it was perfect. We were greeted with congratulations right off the bat at the front desk and were quickly checked in. The room was clean and large, with a Jacuzzi in it. The bathroom had a window that opened up to the t.v and when we walked in, we found a personalized card for us on the bed to congratulate us once again. Super happy with our stay. Also the breakfast was incredible!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:42.396925",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 19,
            "reviewer_url": "https://www.google.com/maps/contrib/106301906820746016361/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cS11SFJ3EAE",
            "reviewer_name": "Alysa Mahlerwein",
            "rating": 5,
            "review_text": "Very quiet and secluded hotel right off the highway. Very convenient commute to the BC ferry terminals. Hotel was newly renovated and clean. Comfortable beds and safe parking was exactly what we needed after a 13 hour drive.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:42.399404",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108934645097266923173/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4cGJXNTVBRRAB",
            "reviewer_name": "Rob Blackie",
            "rating": 5,
            "review_text": "The king 1-bedroom suite we booked had a full kitchen and dining area. The staff went above and beyond our expectations to make sure we had everything we needed, including a crib, high chair and additional plates. The bed was very comfortable. The front desk even provided face masks, gloves and sanitary wipes! I also liked the gym equipment (Precor treadmill and free weights). Well done guys!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 02:49:42.401987",
            "response_from_owner_text": "Dear Mr. Blackie, First of all let me thank you for choosing the Holiday Inn Express Riverport and thank you for being GOLD Member of IHG Rewards program. We appreciate your loyalty! We are glad you enjoyed your stay with us. Guest satisfaction is our top priority and it delights us to learn that we met your expectations. Hope to see you again in August! Hotel Team",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-22 02:49:42.401987",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116459265375904493547/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRN2RIZktnEAE",
            "reviewer_name": "Michael DeGroot",
            "rating": 5,
            "review_text": "Super convenient if you are at a tournament for the rink. Hotel had everything I needed. Breakfast was good (started 630 sooner would have been better for me but no big deal).  Coffee wasnt great but was always available. Hotel held bags after checkout and let me go to the pool for a swim and shower before my flight. Would recommend.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:43.044269",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 60,
            "total_number_of_photos_by_reviewer": 155,
            "reviewer_url": "https://www.google.com/maps/contrib/100194677021290887493/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3LXRQZlFBEAE",
            "reviewer_name": "The McLaughlins",
            "rating": 5,
            "review_text": "As a professional who travels regularly I have found this is one of the best. Extremely clean with wonderful rooms. Breakfast is very good and the staff are very helpful. They even have you covered if you forgot your toothbrush! 5 stars all the way. If you plan on being in Richmond this should be your place. Only con was the pool was a bit cloudy.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:43.048724",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 56,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/116864611328668726698/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaHFxZU13EAE",
            "reviewer_name": "Makayla Janelle",
            "rating": 5,
            "review_text": "Staff were amazing! A school group of 19 of us were stuck in Vancouver because of the snow and couldn t make it back to the island last night, and this hotel was able to accommodate our needs and found space for everyone. Greatly appreciated this, and they paid for the 5 cabs that took us to the hotel. To top it all off, they didn t even charge us for the rooms. HIGHLY RECOMMEND!! Thank you soooo much again to the Holiday Inn team! Very grateful",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:43.052157",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117909596888649849696/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJcFltUV9RRRAB",
            "reviewer_name": "Laura Perkins",
            "rating": 5,
            "review_text": "We had a suite and it was roomy and clean. The complimentary breakfast was the best continental, complimentary breakfast Ive seen. Even had little omelettes and sausages. Get the fresh stuff as it gets cool fast. Pool is small and nice. Hot tub was out of order for maintenece.  Oh well, next time, we will be back.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:43.055284",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 47,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105786662537710052193/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZbnI2RVF3EAE",
            "reviewer_name": "haggus6756",
            "rating": 5,
            "review_text": "Good hotel we had a suite on the end. The area was quiet the room had full fridge and a microwave. King size bed was comfortable. Staff was friendly and helpful. Location has restraints, movie theater, and pubs all within walking from the hotel.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:43.058569",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 132,
            "total_number_of_photos_by_reviewer": 87,
            "reviewer_url": "https://www.google.com/maps/contrib/111515607247682550895/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbWFxZlZREAE",
            "reviewer_name": "Matt Bianconi",
            "rating": 5,
            "review_text": "Great room with mini fridge and microwave. When we had our privacy hanger out they slipped a note under the door reminding us they couldnt clean our room that day and if we had any questions to call. While we were there they decorated the lobby for Halloween and the kids loved it. Decor was nice. Staff was friendly. The only issue would be the pillows. They bought pillow cases that say firm or soft in prominent letters. 7 out of 8 of our pillow cases said firm, 1 out of 8 pillows was firm... With the amount of laundry and pillows in a hotel I dont know who thought that would work.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 02:49:43.061629",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 61,
            "total_number_of_photos_by_reviewer": 38,
            "reviewer_url": "https://www.google.com/maps/contrib/105583356919916774305/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRLUtmSm13RRAB",
            "reviewer_name": "Ron Huizinga",
            "rating": 5,
            "review_text": "Nice hotel, quiet, I was upgraded as a Platinum member to a nicer room. Also, on Wednesday night, there was a Managers event from 5-6:30pm with some snacks and beer and wine. This was very nice. I used  the gym every morning, everything worked properly in the gym. The free breakfast is the typical Holiday Inn Express breakfast, nothing fancy, but fine for most mornings. I will stay here again if I am back in this area.",
            "published_at": "9 years ago",
            "published_at_date": "2014-11-22 02:49:43.064452",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/109526386518043860899/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVZzRtRWRBEAE",
            "reviewer_name": "Kwazy Canuck",
            "rating": 5,
            "review_text": "This is a great property with friendly and efficient staff. There were five of us staying in two rooms during a stressful time while a family member was having surgery in a local hospital. We only intended on staying for one night but due to complications after surgery we stayed for 4 nights. The management and staff went above and beyond to ensure that we could extend our accommodation even though they were booked near to capacity every night. The breakfast crew were outstanding and offered lots of GF options for a family member requiring it. The rooms were spacious and clean, and our grandkids really loved the swimming pool. Special shout out and kudos to Ana at the front desk who was so kind and compassionate during our stressful time, and also to the Breakfast Ambassador who was incredible in her role in providing great food and excellent service.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:43.067073",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 102,
            "total_number_of_photos_by_reviewer": 12,
            "reviewer_url": "https://www.google.com/maps/contrib/100295494579417208488/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtZ0thWnNBRRAB",
            "reviewer_name": "Pat Jones",
            "rating": 5,
            "review_text": "I really enjoyed my stay here. I stayed a week for work and enjoyed the stay. The staff were friendly and the gym was clean. They have a outdoor basketball court too which is great. Its really close to a awesome movie theater, indoor kids park, waterpark and a ice rink.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:43.069943",
            "response_from_owner_text": "Hello Pat, Thank you for taking the time to write a review and for the 5 star rating! We are so appreciative of your kind words. Our staff will be so happy to know you enjoyed your time with us. We hope to have you back soon.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:43.069943",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 111,
            "total_number_of_photos_by_reviewer": 167,
            "reviewer_url": "https://www.google.com/maps/contrib/114956181117835425893/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJa3ZlcEZREAE",
            "reviewer_name": "Katy Carley",
            "rating": 5,
            "review_text": "I wish I could give more stars!  I cannot speak highly enough of the personnel who work at this hotel.  They truly care about your stay from beginning to end.  I travel regularly for work and this hotel, by far, is my favourite one to stay at.  It is clean, quiet and has all of the amenities that you need.   If you let the hotel know ahead of schedule they will even do their best to accommodate food allergies.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:43.072962",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 111,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/109004641546696913430/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLOG9lZDFBRRAB",
            "reviewer_name": "Rupi Kahlon",
            "rating": 5,
            "review_text": "We enjoyed a 2 nights stay here. Nice hotel with great staff and room size. All Covid precautions were practiced. Loved the breakfast. It was fresh and had a lot of vegetarian options. Pool, hot tub and gym were well maintained and available only on prior booking - which adds that much needed level of security and relief during Covid. Coffee machine was available in room despite of Covid - which I liked. Location is convenient with restaurants in close proximity. Absolutely worth the value. Highly recommended.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:43.922759",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 103,
            "total_number_of_photos_by_reviewer": 564,
            "reviewer_url": "https://www.google.com/maps/contrib/102314204450547538755/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3OWRyTFBREAE",
            "reviewer_name": "Ron Peterson",
            "rating": 5,
            "review_text": "We stayed at this hotel because we came for a wedding. We found the hotel staff very friendly and helpful. It is in great shape. The room was clean and fresh. Nicely decorated. We also enjoyed going to a movie at the IMAX which is just a walk across the parking lot. That was fantastic. I would definitely recommend this hotel to people who are staying in the area. One of the things that I really liked about it was that it was not in the heart of the city, slightly out of the way and yet very accessible and we could quickly get to wherever we wanted to go. 5 star",
            "published_at": "9 years ago",
            "published_at_date": "2014-11-22 02:49:43.925262",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111070438948702309706/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpeGFuWG53RRAB",
            "reviewer_name": "Himanshu Dev",
            "rating": 5,
            "review_text": "Amazing, and I mean, really amazing customer service from general manager, Elena, and her team! Excellence at every step, this hotel is great for families, couples or anyone, for that matter. Really good breakfast, swimming pool and hot tub, with service that I havent even experienced at 5 star hotels. Personalized service, with every staff member greeting you every time. I will definitely stay here again :)",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:43.927383",
            "response_from_owner_text": "Dear Himanshu Dev, Thanks a lot for your kind words! It means the world to us to see that our guests have memorable experience. We cannot wait to see you back! Best Regards, Elena Grishina General Manager",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 02:49:43.927383",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 30,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/109653534146572163830/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvZ2MzMmZREAE",
            "reviewer_name": "James Chen",
            "rating": 5,
            "review_text": "Its a bit of distance from the city centre, but close to the movie theatre. The area is quieter. The rooms are nice and I was fortunate to be able to try the suite which was very spacious and comfortable, and has a full kitchen. Breakfast was good, has a bit more options than the usual HIE. When called to request for something it arrived very quickly. Staff friendly and helpful.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:43.929869",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 812,
            "total_number_of_photos_by_reviewer": 7056,
            "reviewer_url": "https://www.google.com/maps/contrib/113836218850872326338/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRX3VQMHVBRRAB",
            "reviewer_name": "TheTcairns",
            "rating": 5,
            "review_text": "Really enjoyed the friendly service. Pool was clean and not too much chlorine. Breakfast was very good and had fresh pancakes and all that anyone could really want. Beds were soft and clean and pillows were excellent. The staff was very accommodating and helpful!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:43.931967",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110348144614174810283/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwX3ZqWW1RRRAB",
            "reviewer_name": "Dinesh Kumar",
            "rating": 5,
            "review_text": "We were two couples who had a comfortable stay at this hotel that was clean and tidy. One of our room on the higher floor was overlooking large green field, which was very pleasing to the eye, in otherwise crowded surroundings of Richmond. I must particularly acknowledge extraordinary hospitality of Cole and Teresa, who both guided us through what was available inside and outside the hotel. Teresa went to the extent of organizing for our rental car to follow their shuttle to the airport, for a easy pick up of our friends.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:43.934160",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 46,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/117915044112565738638/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRaS1XaFFREAE",
            "reviewer_name": "Gerard Das",
            "rating": 5,
            "review_text": "I enjoyed my stay at this property during my recent business trip to Vancouver.  The hotel was clean and quiet.  Even though they were under construction they kept the place quiet.  The variety of the free breakfast is fantastic.  I will stay here again on my next trip to the area.",
            "published_at": "9 years ago",
            "published_at_date": "2014-11-22 02:49:43.936413",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105071580947636473723/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdHFQUFJREAE",
            "reviewer_name": "Misbah",
            "rating": 5,
            "review_text": "Theres nothing bad about this hotel. It was comforting and I did not want to leave Richmond! The hotel is located in a quaint, quiet little area next to a neighborhood. Its so serene. The hotel staff is very helpful for us tourists. They were able to give us all the info about downtown Vancouver and they even gave us a few discounts to local attractions. The hotel is very clean and I expected nothing less of Holiday Inn. The breakfast is delicious and has a bit of variety as well.",
            "published_at": "9 years ago",
            "published_at_date": "2014-11-22 02:49:43.938435",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111951649295651312313/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBakxQc3FRRRAB",
            "reviewer_name": "Paula Barrett",
            "rating": 5,
            "review_text": "We booked this hotel as a base for our 3 day visit to Vancouver,  on the way home from Maui. We arrived mid morning, way before check in. So tired! We were allowed to check in and take breakfast for no extra charge,  how good is that! Late check out on day 3 too, amazing. Comfortable,  clean,  quiet.  Perfect!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-22 02:49:43.940325",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/107676900686246688673/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnN0pxMFdBEAE",
            "reviewer_name": "David van der Spek",
            "rating": 5,
            "review_text": "Nice hotel with very nice rooms. The suite has 2 bedrooms, a living room, a kitchen and two bathrooms. Each room and the living room has their own TV which is also very nice. The hotel also has a nice gym and swimming pool as well as a good breakfast buffet. There are places to eat at walking distance and a very nice big movie theater with all the latest technology as well. Overall a very nice place to stay.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-22 02:49:43.942150",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/101151608741479849784/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMDZUQzN3RRAB",
            "reviewer_name": "Jacob Minderlein",
            "rating": 5,
            "review_text": "I always stay here when Im working in town. Great rooms. Breakfast is fantastic. Basketball court and pool!? Its great",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:44.584478",
            "response_from_owner_text": "Jacob thank you always choosing us. We are truly happy that you enjoy your stay with us and we look forward to seeing you on you next visits.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:44.584478",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 45,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102458931084921447937/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDOTYtSGl3RRAB",
            "reviewer_name": "Dawna Tschirhart",
            "rating": 5,
            "review_text": "We enjoyed 4 nights here. Short Drive to day trip to see Big Red Wood Trees. Business and 39th Wedding Anniversary trip. No hot tub beside the swimming pool available bc of Covid. I wanted the kitchen and it s great. Needs a cutting board. We had lots of Coffee and bought cream & groceries at the Local grocery store. There is No desk to work at. So the ironing board worked out well. The table would work but the bed was softer. No couch. But there s nice sitting areas around the Hotel. Old technology didn t work with the TV. Ironing board is useful! Plz add a foot stool with the chair for tired travellers. The lamp charger doesn t work. And the night light and clock are Bright! I covered them up! The mushrooms outside are Poisonous  . Possibly should be Removed. Nice time of Year to travel. Fortunately it s quiet on our side of the building because there s a lot of traffic on the   rise  side of the building. Beautiful sunset dinners here. We ll have great memories from BC. Far from home in Ontario. Checking out local wines.   Amazing selection at the grocery store. WoW! Staff are all helpful and friendly. Stay Here and enjoy the Best Mattress & Pillows! Breakfast has everything thank you!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 02:49:44.588511",
            "response_from_owner_text": "Thanks a lot for the review! Hope to see you back! Hotel Team",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 02:49:44.588511",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 39,
            "total_number_of_photos_by_reviewer": 102,
            "reviewer_url": "https://www.google.com/maps/contrib/103739597677790628738/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3cXQyR2N3EAE",
            "reviewer_name": "Antonina Lovyn",
            "rating": 5,
            "review_text": "I really enjoyed the service in this hotel, we were running a bit late in the morning and I called to see if they can extend our check out time, and they did for an hour. Their hot tub was nice, nobody was there. The breakfast was really good too, I really liked the pancake machine.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:44.592737",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 257,
            "total_number_of_photos_by_reviewer": 891,
            "reviewer_url": "https://www.google.com/maps/contrib/111993869808616660631/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNROUpQNFR3EAE",
            "reviewer_name": "Candy Forgrave",
            "rating": 5,
            "review_text": "Wonderful experience!! Staff was very Friendly, Professional and just inviting! The Breakfast they serve as part of your stay.... Was Excellent! We were here for short 2 day stay but will Definitely be coming here again while were in Richmond :)",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-22 02:49:44.596693",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108796775407263508757/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtc2FMWDdnRRAB",
            "reviewer_name": "Matthew Setser",
            "rating": 5,
            "review_text": "The pool was closed and that is the reason we chose this hotel. They made up for it by giving us free tickets to the water park and pool that is next door. I really have no complaints. Nearby activities: Located in a cluster of very fun activities including a water park, ice rink, imax theater and multiple restaurants.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:44.600075",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 89,
            "total_number_of_photos_by_reviewer": 393,
            "reviewer_url": "https://www.google.com/maps/contrib/109720710787656398352/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNWI3aXpnRRAB",
            "reviewer_name": "Bernardo Junicic",
            "rating": 5,
            "review_text": "Clean rooms and hallways. Complimentary breakfast is very high quality with a wide variety of juices, omelets, bagels, cereals, yogurts, and more. Pool is a nice size. Laundry room takes coins. High social and professional marks on all staff from the front desk, maids, and breakfast area.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 02:49:44.603840",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 260,
            "total_number_of_photos_by_reviewer": 1064,
            "reviewer_url": "https://www.google.com/maps/contrib/101919890653856838676/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cVlxY0hBEAE",
            "reviewer_name": "A. Black",
            "rating": 5,
            "review_text": "Whenever I stay in Vancouver area, this is my go to hotel. It is well priced for value. Clean spacious updated rooms in a safe neighborhood, featuring excellent wifi, pool/hot tub(clean), and breakfast. The jacuzzi rooms are good as well.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:44.606892",
            "response_from_owner_text": "Dear A.MC, Thanks a lot for a 5 star review! We are happy to learn that you enjoyed our clean rooms, WIFI and swimming pool. We hope to welcome you back soon! Best Regards, Elena Grishina General Manager",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 02:49:44.606892",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 168,
            "total_number_of_photos_by_reviewer": 34,
            "reviewer_url": "https://www.google.com/maps/contrib/105863751595281686683/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaXRMRzlBRRAB",
            "reviewer_name": "Donna Tung",
            "rating": 5,
            "review_text": "Very new Holiday Inn Express. It is right next to a movie theatre. Everything in our room was clean and in working order. Complimentary breakfast was fresh  and had a wide variety. There were milk, juices, coffee, tea, cereals, yogurt, hard-boiled eggs, omelette, pork sausage, turkey sausage, bagel, toast, English muffins, potatoes, and a pancake machine. I would stay here again. Remember to bring your swimsuit, there is an indoor swimming pool and hot tub.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 02:49:44.610447",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 32,
            "reviewer_url": "https://www.google.com/maps/contrib/111628503843663684796/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1Z29MVjBBRRAB",
            "reviewer_name": "Tin S.",
            "rating": 5,
            "review_text": "Went on a vacation with family. Our kids enjoyed the pool.  Good selection for breakfast. Near to a number of restaurants and recreation. Great location.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:44.613045",
            "response_from_owner_text": "Tin S. On behalf of all of us at the Holiday Inn Express Riverport Richmond, we would like to thank you for giving us a great review. We are thrilled that our kids enjoyed the pool. We look forward to seeing you again soon.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:44.613045",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106718291229887383451/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdEw2cTN3RRAB",
            "reviewer_name": "Summer Hinshaw",
            "rating": 5,
            "review_text": "It was right off the highway with easy accessibility and close to restaurants and an Imax theatre. The front desk clerk was curious and very friendly, she remembered it was my birthday the next morning. The room was spacious and the bed was very comfortable as were the pillows. I would highly recommend to a friend.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 02:49:44.616347",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 37,
            "reviewer_url": "https://www.google.com/maps/contrib/104969759955471304204/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMmFXTmJBEAE",
            "reviewer_name": "Hikaru Sulu",
            "rating": 5,
            "review_text": "This seemed to be a newly constructed hotel that had many amenities. It Pool, fitness room, bike lockers, large public conference area and a proper breakfast area made the stay very enjoyable. The room was modem and clean with wifi and wired network connections and ample plugs for electronics. The room I was in also had a little bar fidge as well as a microwave which was a very nice touch. The hotel was within walking distance for movies a few resturants and an ice rink center and had ample parking. The locaion was very close to the ironwood mall with has a large aray of amenities. Over all a very good experience",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:45.361827",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 50,
            "total_number_of_photos_by_reviewer": 235,
            "reviewer_url": "https://www.google.com/maps/contrib/109307524354525020706/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMHJtZlJREAE",
            "reviewer_name": "Yogesh Bassi",
            "rating": 5,
            "review_text": "Excellent customer service and complete staff was supportive during our visit.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:49:45.365439",
            "response_from_owner_text": "Thank you for taking the time to leave such a positive review of your recent visit. Were thrilled to hear that you had an excellent experience with our customer service and that our entire staff provided you with the support you needed during your stay. Ensuring that our guests feel well-taken care of is our top priority, and your feedback is a true testament to our teams dedication. If theres anything specific that stood out or any additional ways we can enhance your future visits, please feel free to let us know. We truly appreciate your kind words and the opportunity to have hosted you. We look forward to welcoming you back for another great experience in the future. Farah Dawood General Manager",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 02:49:45.365439",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108423454873791263151/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRX1pfbkRBEAE",
            "reviewer_name": "Nicholas Tsenis",
            "rating": 5,
            "review_text": "Very comfy beds. Breakfast was great as well. Omelettes, sausages and plenty of breads. Only stayed a night, but would definitely stay again. Very clean and easy to get to from the airport.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 02:49:45.369688",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106203564113581085085/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMFllWnJnRRAB",
            "reviewer_name": "Phyllis Au",
            "rating": 5,
            "review_text": "Stayed in room 352.  Very comfortable suite with full sized fridge, microwave, sofa, two Tvs, and a induction stove.  Perfect for pandemic times.  Save on Foods is 5 minutes away.  Christian, Lorraine, Rya, and Michelle quickly resolved my problems and professionally.  Thanks for the wonderful stay, im waiting for the plated hot breakfast, missing that so much!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:45.372890",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101360030532681171403/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnb2VDU25RRRAB",
            "reviewer_name": "Joel Peterson",
            "rating": 5,
            "review_text": "I stay here a couple times a year for work and I always enjoy it. Im always greeted with friendly, professional staff. Ive never been disappointed with my room, and the location is perfect for what I need. Great complimentary breakfast!",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 02:49:45.375789",
            "response_from_owner_text": "Dear Joel Peterson, Thank you for your 5 Star rating and compliments in regards to your stays with us.  The Team enjoys making sure our guests are looked after from the time they check in and throughout their stay with us.  We are very lucky to have you as a regular guest and we look forward to welcoming you back again on your next visit. Kind Regards, Karen McFerran Hotel Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-22 02:49:45.375789",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109109177041167478851/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bmJYV3hRRRAB",
            "reviewer_name": "Jessica G",
            "rating": 5,
            "review_text": "This Holiday Inn was great, felt pretty fancy. You can see how they follow guidelines in action so you can feel safe. The staff was super kind, and they still offered breakfast! Super great option for a place to stay.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:45.379285",
            "response_from_owner_text": "Dear Jessica, We are indeed delighted to know that the service of our team, our amenities and our facilities were to your liking and that your experience turned out to be memorable, that would hopefully merit more return visits soon. We look forward to welcoming you back on your next visit. Best Regards, Elena Grishina General Manager",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 02:49:45.379285",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 193,
            "total_number_of_photos_by_reviewer": 297,
            "reviewer_url": "https://www.google.com/maps/contrib/101236944319929859783/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdGRUMGRREAE",
            "reviewer_name": "Diana Chomack",
            "rating": 5,
            "review_text": "Very friendly employees, super clean room,  great rates, excellent breakfast (great grab and go service in light of covid). And great covid protocols in general. Stayed here for work and was really happy with the hotel.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:45.382749",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 27,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/105654127396673322939/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5bl82RGZnEAE",
            "reviewer_name": "Chrisuala Pasco",
            "rating": 5,
            "review_text": "Best hot breakfast you will find in any hotel with friendly staff, clean and comfortable rooms! My family and I enjoyed our stay very much! We will be coming back again!  Highly recommend it!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:45.385973",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101250450653408488172/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3OF92N01BEAE",
            "reviewer_name": "Holly R",
            "rating": 5,
            "review_text": "We stayed at the hotel for a sports event at Watermania. The stay was pleasant, the room was quiet and clean. Hotel was accommodating in extending breakfast hours so athletes were able to eat before they had to be at the pool. Will definately be back in the spring.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:45.388886",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111124576872951722888/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBczllTTRBRRAB",
            "reviewer_name": "Alejandro Espejo",
            "rating": 5,
            "review_text": "I had a great stay at the hotel. The room was clean and had everything i needed. They also provide a 24 hour shuttle to the airport. Complimentary breakfast is also great.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 02:49:45.391187",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 53,
            "total_number_of_photos_by_reviewer": 30,
            "reviewer_url": "https://www.google.com/maps/contrib/111920367093838404659/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMFo2eHF3RRAB",
            "reviewer_name": "Nurmina Hirji",
            "rating": 5,
            "review_text": "Very clean, courteous service and great breakfast selections. Rooms have excellent comfortable beds with great amenities. Definitely a repeat my next trip to Vancouver!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:46.042534",
            "response_from_owner_text": "Dear Nurmina Hirji, Thank you so much for your 5 Star review.  We truly appreciate your review and we are so pleased that your stay with us was excellent! We look forward to your next visit to Vancouver. Kind Regards, Karen McFerran Hotel Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-22 02:49:46.042534",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/100287132782977865493/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOWMzS2tBRRAB",
            "reviewer_name": "Arun Pillai",
            "rating": 5,
            "review_text": "A comfortable hotel for business trip. Their breakfast is included and is tasty with plenty of options. The room is clean and comfortable. This is a no-frills sort of place. I recommend.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:46.045049",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 26,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/114388446719543379775/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBN3Z6V1RBEAE",
            "reviewer_name": "Frederick Lancelot",
            "rating": 5,
            "review_text": "Very clean and spacious rooms, friendly staff. Hotel is well maintained. Breakfast buffet is excellent. All around excellent hotel, I make it a point to go here when I travel to BC for work.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:46.047004",
            "response_from_owner_text": "Dear Mr. Lancelot, Thank you very much for your review as we do strive to deliver the best in our guest experience and quality of service. We look forward to your return visit. Kind Regards, Karen McFerran Hotel Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-22 02:49:46.047004",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100797614637816568065/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LTZIZjJ3RRAB",
            "reviewer_name": "Pearl D'Silva",
            "rating": 5,
            "review_text": "Excellent room with all the amenities and really helpful and polite staff. Enjoyed our stay here . The hot breakfast is a bonus. Definitely staying here again.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:46.049283",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 34,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/108509997332183520470/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNG9mRGNBEAE",
            "reviewer_name": " ",
            "rating": 5,
            "review_text": "The rooms were very clean and furnished with modern-ish decor. The staff is very friendly and courteous. The price was more expensive then what I would normally go for, but at the quality it was worth every penny.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 02:49:46.052899",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111946069978558266400/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eWVPY0l3EAE",
            "reviewer_name": "Marilyn Box",
            "rating": 5,
            "review_text": "Nice rooms! Close to the airport. Shuttle service to airport.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:49:46.054844",
            "response_from_owner_text": "Marilyn Box I wanted to take a moment to express my heartfelt thanks for your kind and positive review of your recent stay with us. Your feedback truly brightened our day, and were thrilled to know that you had an enjoyable experience. Its gratifying to hear that our efforts to provide exceptional service and create a welcoming atmosphere were successful. We greatly value your appreciation of our teams hard work and dedication to ensuring your comfort and satisfaction.",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 02:49:46.054844",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 236,
            "total_number_of_photos_by_reviewer": 24,
            "reviewer_url": "https://www.google.com/maps/contrib/109444139329131404557/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbjVqRmVnEAE",
            "reviewer_name": "Amit Kumar",
            "rating": 5,
            "review_text": "Good place. Excellent rooms. A bit far from airport or Richmond mall. Excellent spread in breakfast. Airport shuttle a available. PK was very friendly and jovial staff.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:46.057534",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101448623992574116413/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LWNfYjV3RRAB",
            "reviewer_name": "Jamie Stevens",
            "rating": 5,
            "review_text": "This hotel is in exceptional shape. The manager on staff is very friendly. She called me in for some repairs on the building. She is really professional, paid promptly. Highly suggest this hotel",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:46.059590",
            "response_from_owner_text": "Dear Jamie Stevens, Thanks a lot for your kind works. It was a great pleasure meeting you. Looking forward to seeing you again. Best Regards, Elena Grishina General Manager",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 02:49:46.059590",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 156,
            "total_number_of_photos_by_reviewer": 462,
            "reviewer_url": "https://www.google.com/maps/contrib/106940098787346159983/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBanBuWVp3EAE",
            "reviewer_name": "Leon W",
            "rating": 5,
            "review_text": "Had a really nice stay. Very helpful staff, reasonable price, great location, modern facilities large room. All staff were very helpful and friendly.  great WIFI speed. Would be great for family,located in the heart of  entertainment complex.",
            "published_at": "9 years ago",
            "published_at_date": "2014-11-22 02:49:46.062075",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109739647614980663238/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtb3NHNHdBRRAB",
            "reviewer_name": "London Spikers Badminton club",
            "rating": 5,
            "review_text": "A perfectly nice place to stay, no complaints at all, Great staff, very clean , very curteous We will visit again",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:46.063811",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106109377920757403071/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbzZqWVpREAE",
            "reviewer_name": "Hao Xu",
            "rating": 5,
            "review_text": "Wonderful breakfast and airport shuttle service. Clean and comfy room for family stay. Located by the Riverport recreation hub. Close to U-pick farms and Fraser River.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 02:49:46.698066",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 49,
            "total_number_of_photos_by_reviewer": 31,
            "reviewer_url": "https://www.google.com/maps/contrib/115522277003358193552/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRXzgtY3VnRRAB",
            "reviewer_name": "Steven",
            "rating": 5,
            "review_text": "Came here for a place to stay to tour around Vancouver for a school trip. Came all the way from Edmonton. Nice place really good breakfast by the way rooms were very comfortable and clean. Staff very friendly.",
            "published_at": "10 years ago",
            "published_at_date": "2013-11-22 02:49:46.700580",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 75,
            "total_number_of_photos_by_reviewer": 121,
            "reviewer_url": "https://www.google.com/maps/contrib/103696212732304154738/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeUw3SWd3RRAB",
            "reviewer_name": "Adam Harrington",
            "rating": 5,
            "review_text": "Great rooms! Suite was spacious, modern, and  clean. We had a youth hockey team stay for the weekend, they had a fantastic time. Thank You!",
            "published_at": "8 years ago",
            "published_at_date": "2015-11-22 02:49:46.703087",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115960000973296640369/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncnFlOVpREAE",
            "reviewer_name": "Pete Klassen",
            "rating": 5,
            "review_text": "Clean rooms, friendly service, and most importantly a great breakfast.  It would be nice if there was a bar in the hotel but its definitely not a deal breaker",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 02:49:46.705267",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 44,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/104902747931461356463/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRekpHY3l3RRAB",
            "reviewer_name": "Joanne Field",
            "rating": 5,
            "review_text": "The Holiday Inn Express Riverport is our favorite place to stay in the Richmond area. It is close to biking trails around Steveston, and the hotel is within walking distance to a huge cinema complex and several resaturants. There is a tasty breakfast buffet, the  staff is friendly and everyone does their best to make our stay a pleasant one.",
            "published_at": "9 years ago",
            "published_at_date": "2014-11-22 02:49:46.707422",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112246783703251459551/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4X0pIYXNnRRAB",
            "reviewer_name": "J. G.",
            "rating": 5,
            "review_text": "Great stay here. Staff was very accommodating. Hotel was always clean and welcoming. Spacious rooms, great showers. Will stay here again",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 02:49:46.709267",
            "response_from_owner_text": "Thanks a lot for the review! Hope to see you back! Hotel Team",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 02:49:46.709267",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 796,
            "total_number_of_photos_by_reviewer": 518,
            "reviewer_url": "https://www.google.com/maps/contrib/106681120655915828829/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdm9PeG13RRAB",
            "reviewer_name": "Mohamed Youssef",
            "rating": 5,
            "review_text": "The receptionist, Amr was very professional and friendly. He advised us to book our ferry online for the next day because it was busy weekend. We proceeded with his advice. He made our day. Thank you Amr!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:46.711622",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/105751137968656457451/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNnNyNkZREAE",
            "reviewer_name": "Robert Cossette",
            "rating": 5,
            "review_text": "There was a bit of a booking issue (done through Expedia) but the staff fixed the issue and got us a better suited room.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:49:46.714014",
            "response_from_owner_text": "Hi Robert, Thank you for the Stellar 5 star review! We greatly appreciate it. My sincerest apologies for your issues with Expedia but so happy to hear your team were able to help fix the booking challenge and give you a great room. We look forward to your next stay!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 02:49:46.714014",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 148,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114324269217997257272/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhLXUzZDFnRRAB",
            "reviewer_name": "Marshall Basarab",
            "rating": 5,
            "review_text": "Amazing place good people at the front desk they help people and also have phone chargers and cables at the desk! I will always come to holiday inn. If I ever have a bad experience here, I will leave a bad review.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:49:46.716608",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 104,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/106762861307603489179/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRemJPSXpBRRAB",
            "reviewer_name": "Maciej Kaczor",
            "rating": 5,
            "review_text": "Great place to  stay. Very friendly staff.Complimentary shuttle to office and airport. Nicest shuttle driver on planet,thanks for great chats every morning before stressful day at work.Cheers Ms P.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-22 02:49:46.718832",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 39,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/114558511762963345088/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}