{
    "place_id": "ChIJJYVOCYNxhlQRrkWpvkO-Ao4",
    "reviews": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bDgzWVBnEAE",
            "reviewer_name": "kilam",
            "rating": 5,
            "review_text": "Service here was super welcoming. Shocking for such a high end area. Especially for how they treat people of color. Impressive. Food was really good, overall the menu has things other restaurants do but everything is served and made meticulously, you can tell there s a lot of effort put into everything. Servers are friendly and flexible. Good experience and the atmosphere is welcoming too!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:23.829064",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 173,
            "total_number_of_photos_by_reviewer": 562,
            "reviewer_url": "https://www.google.com/maps/contrib/117962650880183785320/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1a2Utc3RRRRAB",
            "reviewer_name": "Conor S",
            "rating": 5,
            "review_text": "We had an amazing time at the restaurant. We enjoyed the chefs tasting menu, one of our guests had some dietary requirements and the kitchen expertly pivoted and created a tantalizing spread of food. The efficiency and care of service was very apparent our service was above average and our server went to great lengths to go above and beyond to ensure every guest was satisfied with the tasting menu and their experience with the restaurant. It truly is a magical experience dining somewhere where you are taking such great care of and the use of unique and beautiful ingredients are so present. Dietary restrictions: Gluten and dairy free options present",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:23.832267",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 40,
            "total_number_of_photos_by_reviewer": 14,
            "reviewer_url": "https://www.google.com/maps/contrib/112191072132300541379/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabDhMZmd3RRAB",
            "reviewer_name": "Chris Sartain",
            "rating": 5,
            "review_text": "Can t say enough good things about our time at Botanist! We came for our wedding anniversary and had a beautiful card and champagne waiting for us at the table. The hostesses were very courteous and our server, Chris, was amazing. He thoroughly explained different menu options to make sure the experience was catered to our tastes and checked on us often from the appetizers through the main course to dessert. The atmosphere was wonderful. We sat in the semi-outdoor seating area near the bar with beautiful foliage and piano playing in the background. One thing to note: be wary of the bread delicious and so tempting to keep eating it but save your appetite for the main course and you won t be sorry. Tagliatelle, poached halibut, and king salmon were perfect along with the raspberry pavlova. Also enjoyed our drinks:  What the Flower  and  Needed Escape . Would definitely recommend!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:23.835974",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/113234912059415630342/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLUo2Skp3EAE",
            "reviewer_name": "Denny Chou",
            "rating": 5,
            "review_text": "Out of all the amazing restaurants in Vancouver, my wife and I decided to celebrate our anniversary here and it turned out to be a very wise choice! Kudos to the mastermind, Sarkis, who orchestrated a table miracle on our special night, spreading the word to the entire staff as our fantastic night capped off with two glasses of complimentary champagne to toast with right away before getting to the menu. My wifes favourite was the butter poached lobster! The plating was beautifully presented and the sauce was tastefully done, not overpowering the natural sweetness of the fresh lobster! My favourite was the oven roasted cauliflower. The cauliflower is like a white canvas that provides the texture and everything else on the plate just meshed so well and tasted so heavenly together. This is a definitely a MUST TRY! Ambiance was delightful, complemented by the remarkable skills of a pianist who effortlessly transitioned from contemporary jazz to Spirited Away soundtracks! Adding to the experience, our waiter was also super friendly and made sure we had everything that we needed. All and all it was a great night and we would definitely go back to celebrate another important day!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:23.839004",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/115812657662969053971/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1OUw2bXVBRRAB",
            "reviewer_name": "Vee",
            "rating": 5,
            "review_text": "I came here for cocktails. Im sure the food is great, and ideally, I would have enjoyed the chance to taste it, but I only had an hour and Id heard amazing things about their cocktail program so that was my only intention. And it was worth it. There are a lot of bars on the official Best Bars of 202_ and of the ones Ive tried, often theyre pretty underwhelming. I dont know who chooses them or how much money a bar has to pay to be on them, but most of the time, it doesnt seem to match with my experiences. Botanist, however, does belong on that list. Is it the best cocktail bar ever? No. But it is an exceptionally good hotel bar? Yes. Arguably, hotel bars have a much more difficult task than a regular cocktail bar because they have to appeal to a much wider range of tastes, people, and experiences. Generally, theyre fairly generic, and play it safe with flavours, never straying too far from trends or accessibility of the most inexperienced tourist. Thats why Botanist is special. Sure, sitting at the bar, I saw people be boring and order Aperol Spritzes and wines and espresso martinis.   But the cocktail menu is so much more. Its big, for one thing. Has a great deal of diversity. You can find any sort of drink from a fizzy, sweet concoction to a serious spirit-forward sipper. What I enjoyed most was the marriage of very BC/Canadian ingredients with spirits, some of which are fairly rare to find on a hotel bar cocktail list. Both that I tried were delicious, and mostly important for me, you can actually taste and feel the booze. Sure, one of them (Council of Trees -- amazing name!) seemed pretty juicy and easy, but you could *feel* it by the last sip. What a sneaky drink. I loved it. Thats what Im looking for: cool flavours, mixed and balanced so well that I barely can tell its a cocktail but hits hard enough that I dont say, Well, I could have just ordered a lemonade. Dont get me wrong, you can taste the interesting scotch, but it wasnt too much or too little. Im going to be honest: I saw the Council of Trees on their menu online weeks ahead of time when planning my trip and knew I had to try it. I adored the botanical ingredients, and even its little cryptic blurb on the menu. If nothing else, I was going to try it. And it did not disappoint. The second cocktail (Stone Fox) was a lot heavier, and very spirit-forward, which I appreciate on a cocktail menu. Especially hotels. As a cognac lover, I had to try it. It was a little heavy on the sweet apricot for me personally, but a lot of people would like it this way. Shout out to the great bar snacks, too. They do not skimp. It was almost like a tapa, thats how much you get and its good quality too. Bartenders were sociable but not overbearing and seemed to nail the choices for other patrons. The bar area itself is small, and not exactly the coziest as its right in the corridor leading from the entrance to the restaurant, but if youre only having a drink or two, its totally fine. Hostess was super-nice and accommodating. Would definitely come back.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:23.842355",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 441,
            "total_number_of_photos_by_reviewer": 1870,
            "reviewer_url": "https://www.google.com/maps/contrib/106448042821226229309/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcjhuZVZnEAE",
            "reviewer_name": "Michael Wang",
            "rating": 5,
            "review_text": "Amazing food and service. Our waiter Brendan was great and guided us in our dining/drinking adventure. As there were so many amazing options on the menu we decided to go with A La Carte in order to try more of the menu since we are from out of town. Everything tasted amazing and they even split some of the dishes for us in order to make it easier to eat. I could recommend everything that we ate. Drinks also did not disappoint, very tasty and unique. I think this was my favourite restaurant of this trip and we went to quick a few nice restaurant (including a Michelin star restaurant). Highly recommend it if you are able to try it. Street parking is reasonable, plan for 3 hours though.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:23.845714",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 646,
            "total_number_of_photos_by_reviewer": 2715,
            "reviewer_url": "https://www.google.com/maps/contrib/107230848769906303179/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaakpQYVdREAE",
            "reviewer_name": "Alice L.",
            "rating": 5,
            "review_text": "Dined here based on a recommendation from a colleague.  It is located in the Fairmont hotel near the waterfront & is spacious & airy.  We decided to order from the tasting menu & it did not disappoint.  Each entree was a piece of art that was thoughtfully prepared from the presentation & garnishes to the combination of the right pairing of accents to highlight the taste & texture of the main. The bread appetizer was warm & buttery, had to resist filling up on it. Favorites were: Chicken amuse bouche - so very tender & too pretty to eat Gazpacho with basil sorbet - chip garnish provided a nice light crunch & the basil sorbet provided a cooling sensation, couldve eaten it just by itself in a bowl Halibut in smoked buttermilk - tender, not fishy & light milkiness/creaminess from the buttermilk, the herbs enhanced the neutral taste of the fish Butter infused candy cap mushrooms - light caramel tasting foaminess, quite the experience Service was thoughtful & attentive without hovering. Overall, a very satisfying dining experience.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:23.848559",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 106,
            "total_number_of_photos_by_reviewer": 218,
            "reviewer_url": "https://www.google.com/maps/contrib/113915010252420623371/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabmFISVdREAE",
            "reviewer_name": "Paula Hlavacek",
            "rating": 5,
            "review_text": "Wow! So impressed. We came from Reflections (at Georgia) where we had an awful experience. Horrible cocktails for $25 bucks a pop, watered down garbage however  came here and couldn t recommended this place more! Botanist is 11/10 all around. Cocktails, service, atmosphere, just phenomenal. Bartenders are so professional and friendly. Cocktails are between $16-20 for complex, deep, delicious concoctions. You must try the clarified milk drink (Much needed Escape) and try the (What the flower)! Jeff the bartender was great. Thanks for having us!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:23.851214",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 592,
            "total_number_of_photos_by_reviewer": 3568,
            "reviewer_url": "https://www.google.com/maps/contrib/113786803254838155499/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeUxPa0VnEAE",
            "reviewer_name": "R R",
            "rating": 5,
            "review_text": "Our lunch at this tasting menu-only restaurant was a true delight! The culinary journey presented through the carefully crafted courses left us amazed. Each dish was a masterpiece of flavor and presentation, showcasing the chefs incredible talent. But what truly made the experience exceptional was the impeccable service provided by our server, Jay and Dawn, along with the the assistant managers, Deepesh and Kal. Their attentiveness and genuine passion for hospitality made us feel like VIPs. If youre seeking an unforgettable dining experience with outstanding food and service, this restaurant is a must-visit.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:23.853608",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 79,
            "total_number_of_photos_by_reviewer": 249,
            "reviewer_url": "https://www.google.com/maps/contrib/102097263869440813647/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMFlYT3NBRRAB",
            "reviewer_name": "Justin Evans",
            "rating": 5,
            "review_text": "What a stunning restaurant and food to follow. Never had such soft and creamy salmon, it melted like delicious butter on my tongue with the perfect flora of blackening. Seriously great food!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:23.856017",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 43,
            "reviewer_url": "https://www.google.com/maps/contrib/108622148807565121814/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBb19fS3ZBRRAB",
            "reviewer_name": "Minh Le",
            "rating": 5,
            "review_text": "A staple of upscale dining in Vancouver. The cocktails are some of the best in the city that is awarding winning. Top notch service. The food can be a bit of a hit and miss as it changes quite a bit with the season. The 3 dishes we had were tasty, but just not memorable that leaves you wanting more. The octopus was a bit on the chewy side and the scallop was buried under all the sauce that took away from the delicate textures and flavour of the sea. The salad was my favourite of the night as it had a great textures from the bee pollen and acid from the dressing.",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:25.171248",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 292,
            "total_number_of_photos_by_reviewer": 1272,
            "reviewer_url": "https://www.google.com/maps/contrib/117206384873936038176/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1X3BIVUNBEAE",
            "reviewer_name": "Julie Morris",
            "rating": 5,
            "review_text": "Had brunch here on a Sunday while in Vancouver for the weekend. First off the hotel is beautiful! You walk up a marble staircase where you are greeted by the hostess. You definitely want to secure a spot with a reservation. Everyone was attentive and very nice. During brunch you can choose either two or three courses which also included either sparkling wine or a mimosa to start. You also get a cocktail with the main dish. Several items to choose from in the first and second courses. Third course is dessert (two options). I highly recommend the mushroom toast, lobster Benedict, and black forest cherry dessert.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:25.175096",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/102290359801413467552/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad1BhZkNBEAE",
            "reviewer_name": "Ben Deziel",
            "rating": 5,
            "review_text": "Just went for brunch for my partners birthday and it was splendid. Amazing service!! Our server brought them a cute croissant with a candle without me even asking. So thoughtful",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:25.178311",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 29,
            "reviewer_url": "https://www.google.com/maps/contrib/117334351427881884234/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGdC02dlF3EAE",
            "reviewer_name": "Momo K",
            "rating": 5,
            "review_text": "It was difficult to book a reservation here since it s so popular! I managed to get in to celebrate my wedding anniversary. The staff gifted us a congratulatory card signed by all the staff members along with delicious champagne. The server was very knowledgeable so we went with her recommendations for both appetizers and mains. The scallop appetizer was BOMB. I would definitely order again. The burrata was too basilly for my taste. My husband really enjoyed the lamb which comes with lentils. I wasn t too hungry so I went with the appetizer sized pasta dish which was average. The dessert  I wanted to order everything on the menu but went with the strawberry yuzu tart that comes with a scoop of strawberry sorbet. I would go back to try the rest of the dessert menu. It was a perfectly balanced dish. Although this restaurant is located in the Fairmont Pan Pacific hotel, we were pleasantly surprised by the decent pricing compared to other restaurants. We ve booked our next visit here on Christmas day and are excited to try their brunch menu . Parking: We were lucky to accidentally park in the underground lot via an entrance attached to the cruise docking area but not sure if there is another way to get in.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-17 02:07:25.181781",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 109,
            "total_number_of_photos_by_reviewer": 192,
            "reviewer_url": "https://www.google.com/maps/contrib/100916389673354281751/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeTVfTUlBEAE",
            "reviewer_name": "Alejandra Beers",
            "rating": 5,
            "review_text": "Our waitress Ria, was very sweet and attentive. She kept checking in on us to make sure we were ok. The food and drinks were delicious! Music a bit too loud, but in their defense, it was a live DJ!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:25.185338",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": 18,
            "reviewer_url": "https://www.google.com/maps/contrib/102632399812839703638/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eDZtU01BEAE",
            "reviewer_name": "Joyce Chan",
            "rating": 5,
            "review_text": "Came here for brunch based on reviews and seeing them on a few top lists for Vancouver and glad to say it lived up to the hype. At first I was worried as most reviews spoke mostly about the aesthetics of the restaurant, which I really dont care about but the  food was actually so good! My beet burrata had such a nice refreshing blend of flavors and my husbands salmon was melt in your mouth delicious. The mushroom toast was also really good. Service was so friendly and unpretentious. Value is absolutely there considering it comes with 2 cocktails/ drinks as well. We thought it would not be enough food but we left full. Would absolutely return and recommend others to try.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:25.188308",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 157,
            "total_number_of_photos_by_reviewer": 623,
            "reviewer_url": "https://www.google.com/maps/contrib/113202867677527990824/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbXQzVGRREAE",
            "reviewer_name": "Vinicius Fernandes",
            "rating": 5,
            "review_text": "5 starts for everything undoubtedly. The food testing menu with level 2 wine pairing was phenomenal! Every wine and meal was an experience. It is certainly a pricy experience but, we would do again for sure. You wont regret. Cheers",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:25.191016",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 121,
            "total_number_of_photos_by_reviewer": 352,
            "reviewer_url": "https://www.google.com/maps/contrib/109986098276083843761/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OWR1clJnEAE",
            "reviewer_name": "Daniel Jung",
            "rating": 5,
            "review_text": "An exquisite dining experience! Came in for brunch with no reservation. Luckily, after a 10-minute wait, someone canceled. Service was brilliant, food and drinks tasted delicious, and the vegan dessert was amazing! The brunch was under $90 with tips included. Fantastic spot for a date. Highly recommend reservations! I will be back 100% thank you!",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:25.193476",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 247,
            "total_number_of_photos_by_reviewer": 838,
            "reviewer_url": "https://www.google.com/maps/contrib/111149626096541591082/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdTl6dllnEAE",
            "reviewer_name": "Julia Vorivodina",
            "rating": 5,
            "review_text": "An upscale restaurant with amazing food. Also, the food presentation is really beautiful! We enjoyed our dinner at the restaurant. Well definitely come back!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:25.195897",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 44,
            "total_number_of_photos_by_reviewer": 99,
            "reviewer_url": "https://www.google.com/maps/contrib/108358612543228323403/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseGZxMWdBRRAB",
            "reviewer_name": "Laurie Jean-Francois",
            "rating": 5,
            "review_text": "The service was just as amazing as the food! We went for a birthday brunch and between the great service and the delicious plates, Botanist completely made our trip to Vancouver a great one!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-24 02:07:25.198542",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 29,
            "total_number_of_photos_by_reviewer": 26,
            "reviewer_url": "https://www.google.com/maps/contrib/106519545059087118334/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1Mm9PVGtnRRAB",
            "reviewer_name": "KANVAS",
            "rating": 5,
            "review_text": "This was my second visit all the way from Toronto. We had a great night and my brother was surprised! As it was also his birthday. Again thanks to our server and the kitchen team for making the night memorable and incredible.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:25.795428",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": 20,
            "reviewer_url": "https://www.google.com/maps/contrib/112265732848268546024/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOVlxU0VnEAE",
            "reviewer_name": "Helen Wong",
            "rating": 5,
            "review_text": "My second time to Botanist, last time I went was four years ago also for my birthday. Everything tasted delicious, even my boyfriend was surprised because he did not know what to expect prior the visit. Services was good too. The most memorable dish was the tagliatelle. Both charred octopus and lobster were delicious, even the strawberry yuzu tart was amazing. I am not a lamb person but my boyfriend liked lamb rack and lamb belly dish very much. Definitely will go back again, especially if they have new dishes or new menu. beef carpaccio charred octopus tagliatelle butter poached lobster lamb rack and lamb belly duo strawberry yuzu tart chocolate marquise (on the house)",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:25.798791",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 41,
            "reviewer_url": "https://www.google.com/maps/contrib/108380726524420855799/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLS02cmpnRRAB",
            "reviewer_name": "Maddi B",
            "rating": 5,
            "review_text": "Came here for brunch and was super impressed. $65 per person is steep for brunch, but you really do get a lot for the value. Perhaps less so if you only order vegetarian dishes, however they do sound delish. 2 alcohol (or not) drinks and two very generously sized dishes! Come hungry. The lobster eggs Benedict is next level. The mushroom toast also delicious. The vibe is warm, friendly and upscale. Will definitely be back.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:25.802361",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 88,
            "total_number_of_photos_by_reviewer": 175,
            "reviewer_url": "https://www.google.com/maps/contrib/105066762971005138448/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadUpMVnpBRRAB",
            "reviewer_name": "Joey Lam",
            "rating": 5,
            "review_text": "I had a great experience here. Food and cocktail were both awesome but our server Chris was the highlight of the show. We ordered two starters, three cocktails and two desserts in total. Hand cut Tagliatelle was amazing. It was nicely presented. I loved mushroom, it smelled nice and it was refreshing and not too heavy. The pasta was perfectly cooked. I don t normally eat seafood but I always enjoy nicely done scallops. The presentation was beautiful. They came with three pieces and were exceptional. Our server Chris said we could order four pieces instead of three if we wanted. Chris also could tell right away what kind of cocktails I would like just by looking at me. I loved the Council of Trees he recommended. It was kind of fruity with a hint of honey but not too sweet. And it gave you an after taste of pine tree. We also ordered Lost in Translation. It would be close to a really good Old Fashion but just even better! We had Strawberry Yuzu Tart for dessert because I love Yuzu! It was slightly sour but in a refreshing way. We absolutely enjoyed it. Chris recommended his favourite dessert Chocolate Marquise. It was also very delicious. Who doesn t like chocolate? However, we liked the tart more, as it was very unique. We had a friend who had a habit taking a  small bite  of other people s food and we tried to stop him from doing too much. Chris was so funny to give him a  tiny  spoon for him to have desserts! LOL I often don t enjoy the server inviting themselves too much into the conversation but Chris blended in well naturally. This was exactly when the tipping was for. Excellent service! A kind reminder: there was a decoration on the table that looked like an infused water. Don t drink it!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:25.805370",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 57,
            "total_number_of_photos_by_reviewer": 165,
            "reviewer_url": "https://www.google.com/maps/contrib/108075297415715114644/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNjVTeUt3EAE",
            "reviewer_name": "Savannah",
            "rating": 5,
            "review_text": "Gorgeous interior and even better service! Went with a group of 12 people so we were seated in one of their private rooms with no extra cost. The private rooms have a set 3 or 2 course meal ($65 for 2 courses and $71 for three) the only difference between the 2 and 3 course meal is dessert for the 3 course meal. Excellent service, always tentative to waters sides etc. Food had amazing flavour and unique presentation. I would definitely recommend this place for an upscaled brunch or dinner!",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:25.808799",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 159,
            "total_number_of_photos_by_reviewer": 425,
            "reviewer_url": "https://www.google.com/maps/contrib/110260646550996706219/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaXQzdkdnEAE",
            "reviewer_name": "Nagela Nukuna",
            "rating": 5,
            "review_text": "Absolutely incredible location, wonderful decor and atmosphere with the live pianist, and top -notch drinks (especially if you like a tea-based alcoholic drink). Food and service were incredible!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:25.811199",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 119,
            "reviewer_url": "https://www.google.com/maps/contrib/113933101006301303644/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcW9MVUFREAE",
            "reviewer_name": "Justinne R",
            "rating": 5,
            "review_text": "I recently had the pleasure of experiencing the Botanists six-course tasting menu with wine pairing. The entire evening was nothing short of exquisite! My fiance and I dined on a Friday to celebrate my birthday. From the moment we stepped in, we were enveloped in an atmosphere of sheer elegance and luxury. What truly stood out was the impeccable service we received. From the warm greeting at the door to the attentive server guiding us through each course, and the sommelier who expertly paired our wines, every member of the staff made us feel valued and taken care of. Its worth mentioning that they went above and beyond to rectify a previous visits issue, showcasing their commitment to ensuring a flawless experience. The culinary journey began with a potato nest adorned with a delicate quail egg - a perfect introduction to the evenings delights. The flame-kissed kampachi paired with corn was a symphony of light flavors that danced on the palate. The gazpacho was a testament to freshness, and the smoky undertones of the octopus added a delightful twist. The dessert that followed was the ideal ending to a gastronomic feast, leaving us with a satisfied yet light sensation. In addition, they were also flexible and accommodating with our dietary restrictions, which is always appreciated. A standing ovation to the talented chef and their dedicated team for crafting such an exquisite dining experience! The wine pairing was truly a revelation. Each wine complemented its respective course perfectly, and the sommelier, Matthew, was undoubtedly a connoisseur. His passion and knowledge shone through as he shared insights about the wines, making the experience not just enjoyable, but educational as well. The Poetry in Motion cocktail was a refreshing revelation, a divine concoction that lingered on the palate. The coordination among the servers, led by Larry, was a seamless symphony. The transition from one course to another was flawlessly executed, ensuring we had ample time to savour each dish. We were so engrossed in the experience that the three hours we spent dining flew by in what felt like an enchanting moment. Adding to the enchantment was the live pianist, whose melodies transformed the evening into a personal musical. I felt like the star of my own production, surrounded by a harmonious backdrop of flavours and melodies. For those wishing to indulge, the Botanists six-course tasting menu is the epitome of a treat-yourself experience. It not only met, but far exceeded my expectations. As a local, I cant wait to return and relive this unforgettable culinary journey. In a word, we were truly spoiled!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:25.814307",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 57,
            "total_number_of_photos_by_reviewer": 53,
            "reviewer_url": "https://www.google.com/maps/contrib/112171251394068231934/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSam9LZ2N3EAE",
            "reviewer_name": "Micah E",
            "rating": 5,
            "review_text": "Came here for brunch and chose 3 courses with 2 cocktails included. I think that was a great deal for everything. It was delicious. Service was great. Love the atmosphere.. it was a perfect spot to brunch with my gals.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:25.817325",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 19,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/100796630749970513695/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eUkzNnBBRRAB",
            "reviewer_name": "Jennifer Kelly",
            "rating": 5,
            "review_text": "The brunch at the Botanist is incredible. Service is impeccable. High class. Beautiful setting and lots of bright windows. DJ on the weekends. The brunch menu is the best deal as it includes two cocktails and three courses. Highly highly recommend.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:25.819553",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 280,
            "total_number_of_photos_by_reviewer": 331,
            "reviewer_url": "https://www.google.com/maps/contrib/117776208822335751180/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeE0tNVZREAE",
            "reviewer_name": "Brandon Morant",
            "rating": 5,
            "review_text": "We had an awesome 30th birthday dinner here. Everything we had was perfect. The food was incredible and so were the cocktails. The service was also really friendly but not overbearing and the vibe was good. Its pricey, but its worth every cent.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:25.821751",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 30,
            "reviewer_url": "https://www.google.com/maps/contrib/107675581345202806353/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdVphODZ3RRAB",
            "reviewer_name": "Tommy",
            "rating": 5,
            "review_text": "Have been here a few times and each time has been a great dining experience. The restaurant, staff and food are all amazing. It has become one of my favorite spots in the city.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:26.417452",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/108451398427957222887/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScUx1UFhREAE",
            "reviewer_name": "J Kaur",
            "rating": 5,
            "review_text": "This is truly my favourite vegetarian fine dining experience in Vancouver. I ve been here multiple times from birthdays to anniversaries and date nights, their tasting menu never ever disappoints. They are so accommodating of dietary restrictions and make sure that what they serve you is actually delicious. What is so fantastic is that they provide vegetarians with food that is interesting, innovative, and so flavourful. They have passionate and incredibly knowledgeable sommeliers here as well who bring that extra level of care and attention to your entire experience. The service is always great, food comes out in a timely manner, and atmosphere can be a little loud but is still great. We ve done both private dining and sat in the dining room and found every experience here to be phenomenal. Highly recommend Botanist for their seasonal tasting menu and wine pairings! You won t regret it.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:26.421931",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 43,
            "total_number_of_photos_by_reviewer": 14,
            "reviewer_url": "https://www.google.com/maps/contrib/100479743711443982001/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NmE2NWVREAE",
            "reviewer_name": "Joel Chan",
            "rating": 5,
            "review_text": "We got the three-course brunch and it was delicious. I ordered the charcuterie plate as my appetizer followed by a croque madame and the strawberry coconut panna cotta for dessert. The food was fantastic and I dont know which dish I liked more because it was honestly all good. My wife ordered the hand-cut beef tartare, butter poached lobster benedict, and the milk chocolate coffee mousse. We also got the antioxidant juice, orange juice, and blue moon non-alcoholic cocktail which paired very nicely with our food. Overall great experience with a very friendly, courteous, and professional staff. Even the washrooms were gorgeous.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:26.425580",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 70,
            "total_number_of_photos_by_reviewer": 451,
            "reviewer_url": "https://www.google.com/maps/contrib/110352562919775107923/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdTVIdDVnRRAB",
            "reviewer_name": "Anne",
            "rating": 5,
            "review_text": "A fantastic brunch experience-- the atmosphere is relaxing and the restaurant itself is beautifully decorated. Depending on where youre seated, youre able to peek into the kitchen and watch the chefs preparing dishes. For the brunch menu, there are an incredible number of options for the guest to select. I enjoyed the crab and avocado benedict and my friend really liked her French toast. The drinks were good and the dessert offerings were spectacular. By far, my favourite part of the meal was the pavlova (light and airy on the inside yet perfectly crisp on the outside; it was perfectly executed). The service was attentive and warm; the presentation of each dish was also as expected for a restaurant of this caliber. I would return to try out their other offerings!",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:07:26.429292",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 110,
            "total_number_of_photos_by_reviewer": 295,
            "reviewer_url": "https://www.google.com/maps/contrib/110720069233074339865/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNC1qaVdREAE",
            "reviewer_name": "Swanky Christy",
            "rating": 5,
            "review_text": "We had breakfast at the botanist every day as well as we stopped for drinks one evening. I love everything about this place. Selection, decoration, service! Egg Benedict with crab and salmon both were our favorites. Dont skin detox juices, we tried them all. Pistachio croissant wins the almond one but both were delicious. Crispy potatoes on the side is such a great addition.  Fresh fruit bowl is pricey but it comes with home made whipped cream and fresh berries (specially during winter). We also had amazing coffee there and gravlax and avocado toast were both amazing. This is my favorite place for breakfast in Vancouver! Also they have very cute patio seating, feels like you are in the garden.",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:07:26.432075",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 323,
            "total_number_of_photos_by_reviewer": 1800,
            "reviewer_url": "https://www.google.com/maps/contrib/114790609166563804518/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcGUyRHlRRRAB",
            "reviewer_name": "Cindy Lo",
            "rating": 5,
            "review_text": "Went here for the Hanky Panky collaboration dinner on Nov 4 and it was by far the most amazing dinner I have had at Botanist. The food was so well thought out and presented. The portion was great and tasted incredible. Cocktails were really nicely done. They were beautifully balanced yet complex. Creative flavours and presentation. Service is amazing as always.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:26.434939",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 134,
            "total_number_of_photos_by_reviewer": 638,
            "reviewer_url": "https://www.google.com/maps/contrib/109252362152623263525/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4LXJ6NXpnRRAB",
            "reviewer_name": "Nathan Chan",
            "rating": 5,
            "review_text": "Excellent restaurant, with amazing bar and cocktails, I ve been before but recently attended for a collaboration dinner with Alo restaurant from Toronto. The food setting and service were once again excellent. Will be back.",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:26.437901",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 26,
            "total_number_of_photos_by_reviewer": 76,
            "reviewer_url": "https://www.google.com/maps/contrib/111014377919082171210/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMGVMcFNREAE",
            "reviewer_name": "Rohit B",
            "rating": 5,
            "review_text": "The best dining experience in Vancouver. The place looks great, the food menu and options are vegan / vegetarian friendly. The waiter was so good! 5 stars for him alone. We tried the roasted cauliflower which was very very delicious. They are ranked 2 in all of Canada for cocktails and they did not disappoint. They are reasonably priced for the location and experience.",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:26.440585",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 97,
            "total_number_of_photos_by_reviewer": 194,
            "reviewer_url": "https://www.google.com/maps/contrib/111638820739539692554/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobi1iMjZnRRAB",
            "reviewer_name": "Peter Powell",
            "rating": 5,
            "review_text": "Came for a birthday dinner for just 2 of us about 9. The ambiance, food and service were all amazing. Live piano playing on the Friday night. Started with inventive and tasty cocktails, proceeded to appies (the charred octopus was fantastic as were the scallops). Mains consisted of lamb 2 ways for me and grilled pork dish for both of which were fantastic. Possibly the best lamb Ive had. Glad we saved a little room for the pear tart dessert. Not to be missed! Great people watching too. Parking: Paid parking at the hotel is expensive. $24 for the evening",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:07:26.442967",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 254,
            "total_number_of_photos_by_reviewer": 1776,
            "reviewer_url": "https://www.google.com/maps/contrib/101606395409126814005/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaanRQQXh3RRAB",
            "reviewer_name": "Annie Chu",
            "rating": 5,
            "review_text": "Was lucky enough to share the experience of the tasting menu with a long time friend of mine at this beautiful restaurant! The food looked like artwork and everything we had was very tasty. The duck breast in particular was very memorable. The shortbread cookie to go was a nice little touch! Our server Brandon provided great service. What a wonderful evening! I would definitely recommend Botanist as a place to celebrate something special.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:26.445832",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 215,
            "total_number_of_photos_by_reviewer": 293,
            "reviewer_url": "https://www.google.com/maps/contrib/117567315373072337126/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOS1xNDFBRRAB",
            "reviewer_name": "Robert Varda",
            "rating": 5,
            "review_text": "Excellent craft cocktails with bartenders that are knowledgeable and willing to push the envelope. Will definitely return and recommend to others. Only downside was the generic piano playing. Note: only visited the bar for after dinner drinks.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:27.102928",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/110506025255229051739/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdVpDdGd3RRAB",
            "reviewer_name": "K W",
            "rating": 5,
            "review_text": "Had the tasting menu here and it was phenomenal! I think the menu changes seasonally but I really enjoyed the duck.amazing flavour and well cooked. The mulled wine ice cream is something I want in my every day life.  Service was top notch. It s a great idea for a special occasion.",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:07:27.107007",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 257,
            "total_number_of_photos_by_reviewer": 396,
            "reviewer_url": "https://www.google.com/maps/contrib/102430559860389045542/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaFkzcEJBEAE",
            "reviewer_name": "Kimberly Stephenson",
            "rating": 5,
            "review_text": "A week after dining here, Im still trying to wrap my head around how amazing this place was! The drinks, food, atmosphere-- EVERYTHING exceeded expectations. Even the journey to the bathroom was pleasantly surprising; I found myself lingering at the hallway photography exhibits, and feasting my eyes on the bustling lounge below. There was also a live pianist, whose effervescent fingers doled out jazzy covers to pop songs like something out of a 40s noir film.  The lighting was perfect (not too bright, not too dim). Its impossible to say the service was inattentive-- they anticipated every refill, every wanton desire for more oatmeal sourdough bread (which was scrumptious).  The other culinary standouts were the lamb shanks/belly (which now rivals bacon for me, lol!) and the sour-cream ice cream for dessert.  Be prepared to crave another visit!",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:27.110754",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 42,
            "total_number_of_photos_by_reviewer": 40,
            "reviewer_url": "https://www.google.com/maps/contrib/102927846302779249017/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdmJqQ0NREAE",
            "reviewer_name": "Michael Lee",
            "rating": 5,
            "review_text": "Great food with surprisingly sizable portions for a restaurant of this quality. Server was knowledgeable and kind to us. Free champagne for our anniversary was a nice addition. Great cocktails and overall a nice experience. Staff were all cheerful and patient.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:27.113244",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 34,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/102733656567712300657/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOGRTd2tnRRAB",
            "reviewer_name": "David Luu",
            "rating": 5,
            "review_text": "Went with a friend to celebrate a life milestone and wanted to treat ourselves to a unique, fancy meal. You enter into the hotel and walk past a lively group of people drinking in the hotel lobby bar and lounge. Botanist is located up a set of stairs, with incredible decor. We ordered a few dishes and desserts for each. The meal was excellent, unique, with amazing plating. Service was friendly and fresh. We were lucky enough to sit right by the kitchen, and could see the staff working hard right behind us. The highlight of Botanist is the beautiful dining area with plants and stuff everywhere. The meal was excellent. Had a great time.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:27.116165",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 29,
            "reviewer_url": "https://www.google.com/maps/contrib/114020108930534239156/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQteFozcXR3RRAB",
            "reviewer_name": "J.J. LaRocque",
            "rating": 5,
            "review_text": "We love it here! Such a great vibe with incredible views. There s a great 2-3 course brunch menu with great value. The food was excellent quality with awesome service. Highly recommend the avocado smash, steak & eggs, Burrata salad and the cranberry mimosa for brunch. We would love to come back for dinner :)",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:27.118956",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 124,
            "total_number_of_photos_by_reviewer": 767,
            "reviewer_url": "https://www.google.com/maps/contrib/114637066728490620540/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScTlMRUpBEAE",
            "reviewer_name": "D S",
            "rating": 5,
            "review_text": "Great ambience and amazing service, but the food quality was a little disappointing. The peak seared striploin was average, and I think they could have used a better cut or sous vide it for better texture. The roasted maitake mushroom was way too salty for our liking, but maybe thats how some like it?  I would definitely recommend that this be taste tested and changed if it is in fact too salty. It was still a good experience overall. Dessert was excellent, we had the milk chocolate hazelnut mousse.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:27.121410",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 339,
            "total_number_of_photos_by_reviewer": 344,
            "reviewer_url": "https://www.google.com/maps/contrib/102807232224026589036/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeS1UUG9nRRAB",
            "reviewer_name": "Megan Jen",
            "rating": 5,
            "review_text": "Tried out their Brunch set 3 course menu ($68 a person) for Father s Day! By the end, everyone was super full and we even had to take some stuff to-go. My favourite would be the avocado toast   Would definitely come back to try different items on their other menus.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:27.124170",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 16,
            "reviewer_url": "https://www.google.com/maps/contrib/111060716963058493575/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaXViSkRnEAE",
            "reviewer_name": "Jia Li",
            "rating": 5,
            "review_text": "Very delicious food with interesting flavors and nice presentation. Great cocktails. The bread especially was fantastic, while they did say it was not baked in house. One of our favorite restaurants during our visit.",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:27.126731",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 61,
            "total_number_of_photos_by_reviewer": 61,
            "reviewer_url": "https://www.google.com/maps/contrib/110999307171519359772/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdjllamZnEAE",
            "reviewer_name": "Madison Chow",
            "rating": 5,
            "review_text": "This was the most exquisite dinner experience I ve ever had! My boyfriend and I came for an anniversary dinner with the intent to experience the best that culinary practice had to offer and we were met with just that. To start we shared scallops, then moved on to our respective meals of duck and strip loin (dish description in image caption): everything was cooked to perfection, the food was visually stunning, and it left you wanting to avoid drinking lest you wash the lingering taste away. All in all, it was an incredible experience to try some food I d never had before (duck/scallops), have that food exist in its best  possible preparation, and also see  average  ingredients be elevated to taste so delicious! Truly the best restaurant I ve ever been to.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:27.128995",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/102766011981052987760/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Mk5mOTdRRRAB",
            "reviewer_name": "Monet Beswick",
            "rating": 5,
            "review_text": "Beautiful room, amazing service. We had the tasting menu brunch and it was really good. The ricotta mushroom toast and the brioche French toast was my favourite ! Really beautiful place for brunch . 10/10",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:27.734475",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 95,
            "total_number_of_photos_by_reviewer": 71,
            "reviewer_url": "https://www.google.com/maps/contrib/105441237834194891545/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbGZMYVhnEAE",
            "reviewer_name": "Richard Fung",
            "rating": 5,
            "review_text": "Quick Summary Great ambiance and decor. Great food and love their sustainability project. Highly recommend a reservation. Food- 5 stars We got the prix-fixe menu that came with a cocktail and a 3 course meal. It did feel a bit strange to have 3 courses because it gave off a tasting menu vibe, but was still very enjoyable. The first 2 courses were fantastic. The first dish was a white fish that was cooked perfectly and I very much enjoyed the creamy sauce with truffle topped off. The second dish was the duck breast and it was cooked perfectly. Every bite was incredibly juicy. The only slight disappointment was the dessert to end the night. There was hardly any crumble and it was mostly airy mousse that we were eating, which was my only critique. The brilliance of the first 2 dishes outweighed the dessert Service- 5 stars Fast and attentive Bottom Line Botanist was a terrific experience from beginning to end. The Fairmont that its located in also is a fun experience as there was live music and a lively bar environment in their lobby bar.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:27.738178",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 6,
            "total_number_of_reviews_by_reviewer": 307,
            "total_number_of_photos_by_reviewer": 1011,
            "reviewer_url": "https://www.google.com/maps/contrib/104203729809591171711/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eGJlc1JBEAE",
            "reviewer_name": "Heron Hanuman",
            "rating": 5,
            "review_text": "I was fortunate to celebrate a friends milestone with a group of close friends in the private room. The cocktails are incredible. Like really good. The good is art and I didnt feel hungry leaving. The wine sommiellier needs his own YouTube channel.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:27.741466",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 44,
            "total_number_of_photos_by_reviewer": 113,
            "reviewer_url": "https://www.google.com/maps/contrib/104884546878217562549/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldTZyb0RBEAE",
            "reviewer_name": "Andrew",
            "rating": 5,
            "review_text": "To get to the restaurant you have to go through the lobby of the hotel and up the stairs. There you ll find a gem of a restaurant where I had my best brunch in the city. They have a unique prix fixe brunch which comes with two cocktails (i recommend the verdant vista), an appetizer, entree, and dessert. It s a great deal for the quality of food you get. Each dish surprised me in its own way. The standout was the spaghettoni which was incredible. If you re in the area, don t miss out on this place.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:27.745270",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 417,
            "total_number_of_photos_by_reviewer": 1407,
            "reviewer_url": "https://www.google.com/maps/contrib/107983768859387435949/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMnB5NDZnRRAB",
            "reviewer_name": "Matthew Oliver",
            "rating": 5,
            "review_text": "Incredible experience all around! Angela was our server, and she was an angel. The perfect mix of professional and personable. The 2 & 3 Course Brunch options are very smart, and you get a lot of bang for your buck. I will definitely be back again. Thank you!!",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-10 02:07:27.747791",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106610364868390142642/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcHF5UktnEAE",
            "reviewer_name": "Amar Adiya",
            "rating": 5,
            "review_text": "If youre looking for cocktails that are both sweet and strong, then this is the place for you! The mixologists at this establishment really know their stuff, and they never fail to deliver on the perfect blend of flavors and potency. Whether youre in the mood for a fruity, refreshing drink or something a little more robust and boozy, theyve got you covered. But its not just the cocktails that are top-notch at this establishment. The atmosphere is always lively and fun, with great music and a friendly crowd. Plus, the bar snacks are always on point   I always end up ordering a few extra rounds just so I can munch on their delicious appetizers. Overall, this is the perfect spot for anyone who loves a good cocktail (and who doesnt?). So go ahead and indulge   you wont be disappointed (except maybe by the bill, but hey, thats the price of a good time, right?).",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:27.751046",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 157,
            "total_number_of_photos_by_reviewer": 587,
            "reviewer_url": "https://www.google.com/maps/contrib/105665259731757376801/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNXA2ZnZBRRAB",
            "reviewer_name": "DS C",
            "rating": 5,
            "review_text": "We had three-dish course brunch meal. Each person gets two drinks, appetisers, main and dessert. They had a great selection of appetizets. Try their pistachio croassaint and beef tartare! The main dish was good as well but the dessert was too sweet for me. Thats just an opinion and i don t have sweetooth. Though it is expensive for brunch, I see myself revisit here someday.",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:07:27.753629",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 66,
            "total_number_of_photos_by_reviewer": 131,
            "reviewer_url": "https://www.google.com/maps/contrib/107849820342393565610/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadmE3YlpBEAE",
            "reviewer_name": "Steve Kim",
            "rating": 5,
            "review_text": "Top notch dining experience - been here twice for brunch and I d say it s a good deal. From ambience to service and of course the food, it s a luxurious affair. Their cocktails are also terrific. We ll certainly find more reasons to dine here again.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:27.756160",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 52,
            "total_number_of_photos_by_reviewer": 35,
            "reviewer_url": "https://www.google.com/maps/contrib/105373133041094354756/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSenF1d2Z3EAE",
            "reviewer_name": "lily scheifele",
            "rating": 5,
            "review_text": "Went here for my Birthday diner and It was fantastic, The staff were amazing and everyone was so sweet! and the food was FANTASTIC! I am dairy free and they were VERY accommodating. Highly recommend and will come again ! (two entrees shown below)",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:27.759257",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 29,
            "total_number_of_photos_by_reviewer": 40,
            "reviewer_url": "https://www.google.com/maps/contrib/112255721084090790172/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dVBQYlhBEAE",
            "reviewer_name": "Rebecca Taves",
            "rating": 5,
            "review_text": "Excellent attention to detail made for an elegant dining experience. This is the kind of upscale restaurant that might make some feel nervous if they arent already familiar with the rituals of fine dining, but the staff were so warm and unobtrusively invested in our experience that we felt welcome and at ease. The burrata salad was generous and perfectly accented by both earthy and acid tones. The lobster Benedict was rich and savoury with a curious note of almond. I cant tell you how my friends sable fish was because she was bewitched and left me none. We shared the black forest dessert, presented to me as a surprise for my birthday celebration. Such a beautiful take on an apple fallen to the forest floor with bark and soil, and an apple-shaped cherry mousse that revealed more and more flavours as you worked towards its core. I loved it! Only 4 stars for atmosphere because the chairs are lovely to look at, but you have to sit bolt upright unless you want to lean back at a 45deg angle.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:27.761790",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114122897515109238457/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbU1iNTlRRRAB",
            "reviewer_name": "J V",
            "rating": 5,
            "review_text": "I had my anniversary here and it was an experience to remember. We came here for the brunch and it was fantastic. The staff were extremely friendly and professional. The food was fantastic. The beef tartare was delicious and seasoning was on point. My steak and eggs were beautifully. The mill chocolate peanut butter bar had the perfect amount of peanut butter without being over-powering. The environment was amazingly refreshing. This might be my go-to for further celebrations!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:28.353000",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 61,
            "total_number_of_photos_by_reviewer": 82,
            "reviewer_url": "https://www.google.com/maps/contrib/105169279228880949557/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Nk83Z2h3RRAB",
            "reviewer_name": "A Stint Abroad",
            "rating": 5,
            "review_text": "My boyfriend and I came here for breakfast and decided to indulge in a little bit of everything. We got a chocolate croissant, chia pudding, egg Benedict s, and a bowl of fresh fruits. Everything was delicious! I would definitely recommend this place for breakfast.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:28.354665",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 236,
            "total_number_of_photos_by_reviewer": 663,
            "reviewer_url": "https://www.google.com/maps/contrib/105703165994271018318/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M0wycm5RRRAB",
            "reviewer_name": "Maryia R.",
            "rating": 5,
            "review_text": "Recommended both for dinner and weekend brunch! The food is delicious, and the cocktails are strong and flavourful. Will be back.",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:28.356535",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 18,
            "reviewer_url": "https://www.google.com/maps/contrib/108519739548068838447/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeW9pbkhBEAE",
            "reviewer_name": "Stephanie",
            "rating": 5,
            "review_text": "What a beautiful space! Nestled on the second level of Fairmont Pacific Rim is Botanist. We dined for dinner but more recently came for the set menu brunch. You can choose two or three courses (with or without dessert essentially) from their brunch. This also comes with two drinks of your choosing. Pro-tip for a boozy brunch: you can choose two cocktails! Their cocktails are excellently crafted so I think it s worth the price of admission! Our favourites at brunch were the crab & avocado Benedict and Sablefish for a more substantial meal. The burrata with beets was refreshing and beautifully plated.",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:07:28.358553",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 105,
            "total_number_of_photos_by_reviewer": 1151,
            "reviewer_url": "https://www.google.com/maps/contrib/105486896515210160922/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLXFXcmhRRRAB",
            "reviewer_name": "Melissa Blanchard",
            "rating": 5,
            "review_text": "Lived up to the hype! From start to finish our experience was perfection. We had Chris taking care of us and we were in very good hands.  He completely made the experience for us. Chris was so helpful with drinks and food.  I am so upset I don t remember the name of our sommelier, he was wonderful and totally went above and beyond. I was worried the drinks would be too floral for me, however, I found them to all be very mild when it came to the floral notes. The food was everything you could want in a contemporary fine dining restaurant. Every bite we had was exquisite. Nothing was out of place of missing.  Our table enjoyed the Wagyu Carpaccio, Charred Octopus, seared scallops to start and the duck, steak and lamb as our entrees.  Not one of us had any issues with our meals. The bread and butter were also delicious, I will definitely be driving out to that bakery to get some of the bread for our home. I would highly recommend for any of your special occasions or really any occasion. Vegetarian options: Several vegetarians options that indulge you in mushrooms Wheelchair accessibility: There is an elevator beside the entrance of the restaurant.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:28.360300",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 26,
            "total_number_of_photos_by_reviewer": 103,
            "reviewer_url": "https://www.google.com/maps/contrib/102035326675665303788/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaczkyUG93RRAB",
            "reviewer_name": "Lukas",
            "rating": 5,
            "review_text": "This was one of my top 5 restaurant experiences ever, and I ve eaten at some pretty good places. Between my partner and me, we had 7 plates, all of which were impeccable   tasty, perfectly cooked and seasoned, beautifully plated, creative menus, well-selected ingredients. Service (Alyssa) was really friendly, down-to-earth, and welcoming. The sommelier was also really friendly. People bringing the next course were knowledgeable and always had a smile on their face. The atmosphere here is energetic and also great. There is a nice mix between poppy live piano and some uplifting, often electronic music from the speakers. Noise level is high enough to be invigorating, but not so loud as to make conversation difficult. We had a table next to the open kitchen and loved the concentrated, calm demeanor of the kitchen staff. It s really rare for a restaurant to nail every single part of a culinary experience   food, service, atmosphere   but BOTANIST proved this is still possible to do, at a fair price to the customer. Next time I ll try the tasting menu! Vegetarian options: Some vegetarian and pescatarian options in each course.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:28.362208",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 165,
            "total_number_of_photos_by_reviewer": 100,
            "reviewer_url": "https://www.google.com/maps/contrib/105332850185097047233/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcTUtZlRBEAE",
            "reviewer_name": "Rosa Ho",
            "rating": 5,
            "review_text": "Had the prix fixe brunch here and it did not disappoint. Portions are hearty and the food is rich, so come hungry. The service was really good and the atmosphere was upscale but not pretentious. Enjoyed our meal here and will definitely come again.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:28.364309",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 85,
            "total_number_of_photos_by_reviewer": 67,
            "reviewer_url": "https://www.google.com/maps/contrib/109526932686086470936/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcHBqQUFnEAE",
            "reviewer_name": "Eden L",
            "rating": 5,
            "review_text": "I celebrated my friend s bridal shower last weekend and everything was perfect :) Our server was very friendly and helpful, and knowledgeable in all the menu and was able to help us choose the perfect dishes. Of course the food was absolutely delicious and they provided us with complimentary bubbles for our friend. Absolutely loved it!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:28.366152",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 47,
            "reviewer_url": "https://www.google.com/maps/contrib/113972610461022058388/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOVlPVTVRRRAB",
            "reviewer_name": "Michael Ziefflie",
            "rating": 5,
            "review_text": "We had an amazing stay with elisa our server. Very attentive and made sure we had a one of a kind experience. Our sommelier was amazing as well! Great storytelling when it came to the wine and the pairings were delicious. Had the chefs tasting highly recommend! We were absolutely stuffed to the brim after. The milk punch and the moss cocktails were some of the best I ve tried in Vancouver :)",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:07:28.367646",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/115024257133650341850/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dnF1SUl3EAE",
            "reviewer_name": "Vivian Zhao",
            "rating": 5,
            "review_text": "I used to be a regular here. The staff are lovely and unfortunately it seems management up top wants to cut costs and skimp out on the quality of food and drinks. They used to have these awesome theatrical cocktails that had smoke coming out of them and stuff, and now they cant even bother with those but demand higher prices. If I were the head honchos at the botanist, Id smarten up and put in the effort before all those new shiny michelin recommended bars steal away your customers, and rightfully so. But again, BEST STAFF in the world!!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:28.369172",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/107430518946404538306/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdHVyR25RRRAB",
            "reviewer_name": "Phoebe Gong",
            "rating": 5,
            "review_text": "My fav restaurant in Vancouver in 2022!   Came here to the celebrate the new year. We chose the tasting menu  We ll take it from here  with wine paring. Every dish came with great wine combo and informative introduction. It was totally worth the price. Would recommend it to anyone who s celebrating a special occasion.",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:07:28.939293",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 42,
            "reviewer_url": "https://www.google.com/maps/contrib/105160306070748221312/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdWJta2lBRRAB",
            "reviewer_name": "Diana Milirud",
            "rating": 5,
            "review_text": "Went for brunch with friends. Both food and service were great. We initially had a reservation for 4, but they were accomodating and added 2 more people to our table since we had a last minute change.  Would come back here for a special occasion.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:28.942980",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 31,
            "total_number_of_photos_by_reviewer": 93,
            "reviewer_url": "https://www.google.com/maps/contrib/110272880571142263142/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtam9lZHZRRRAB",
            "reviewer_name": "Eric S",
            "rating": 5,
            "review_text": "Amazing. Everything.  Food was spot on, Octopus and Scallop appetizers were delicious, and for dinner the Lamb chops were perfect! Filip was a great server and was knowledgeable and efficient! Cocktail selection was great also, and many were quite tasty!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:28.946435",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 321,
            "total_number_of_photos_by_reviewer": 165,
            "reviewer_url": "https://www.google.com/maps/contrib/112112440666495948798/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobC1XcUl3EAE",
            "reviewer_name": "Simranjit Singh Bhatia",
            "rating": 5,
            "review_text": "If youre looking for an exceptional dining experience, look no further than Botanist. Nestled on the second floor of the Fairmont hotel, this cozy space boasts a lively ambiance thats perfect for any occasion. On my wifes birthday, we decided to indulge in the best that culinary art had to offer, and we were not disappointed. From the hearty portions to the rich flavors, everything about our meal was superb. The service was friendly and attentive, ensuring that our dining experience was a memorable one. What sets Botanist apart is their unique approach to reimagining dishes and ingredients, resulting in surprising yet refreshing combinations that will leave your taste buds dancing with joy. All in all, from start to finish, our meal at Botanist was a fantastic experience that I would highly recommend.",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:07:28.950324",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 50,
            "reviewer_url": "https://www.google.com/maps/contrib/110026034929844530096/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdFk3U3VBRRAB",
            "reviewer_name": "Edmond Shum",
            "rating": 5,
            "review_text": "4.5 stars IMHO. Everything you see in my pics were yummy, sorry Im too lazy to describe further, just go try if budget allows  Pity I had big lunch that I couldnt try the chefs surprise tasting menu. Quite a popular  restaurant so reservation is recommended.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:28.953024",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 215,
            "total_number_of_photos_by_reviewer": 646,
            "reviewer_url": "https://www.google.com/maps/contrib/112545656833067525939/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVazVuVHVnRRAB",
            "reviewer_name": "Elsy Chow",
            "rating": 5,
            "review_text": "Impressed A delicious, thoughtful, meal. We have been wanting to come here for a while but put it off. So glad we finally did. Came here for a Birthday dinner. The ambience  was light, airy and beautiful. We got great service from Chris who knew a great deal about all the food on the menu and on the tasting menu and was attentive throughout the evening. My husband and I had the tasting menu and the wine pairings. Loved every dish. The salmon was like butter. The tomato dessert, amazing. The food is mainly locally sourced and the wines are mainly organic. Lovely, presentation, very innovative and delicious meal. After getting back from a trip and eating at a lot of great restaurants in Europe, Botanist still managed to shine and give my taste buds a treat. I was very impressed. One of my new favourite restaurants",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 02:07:28.956477",
            "response_from_owner_text": "Dear Elsy, We are glad to hear about your recent Botanist experience and thrilled that you enjoyed the  We ll take it from here  menu with the wine pairings. It is also very rewarding to learn that you were impressed by the customer service offered by Chris, and we will certainly share your kind compliments with the team. We look forward to welcoming you back again soon! Sincerely, Kristin Unger Restaurant Manager, Botanist",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-12-01 02:07:28.956477",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 326,
            "total_number_of_photos_by_reviewer": 3456,
            "reviewer_url": "https://www.google.com/maps/contrib/110663839474394579811/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxeE1yaTV3RRAB",
            "reviewer_name": "Amanda Lim",
            "rating": 5,
            "review_text": "We lucked out and went for both dinner and brunch. I absolutely loved this restaurant. It is a beautiful place where staff really pay attention to details and you feel very taken care of from the start to the finish of your meal. The cocktails are lovely and it was nice to get dressed up and have a decadent meal. I would recommend the scallops and breakfast risotto as well as any of their cocktails. Was super pleased with their gluten free options as well. Thank you!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:07:28.959499",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 409,
            "total_number_of_photos_by_reviewer": 1086,
            "reviewer_url": "https://www.google.com/maps/contrib/118421876576526128518/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldXFpd0N3EAE",
            "reviewer_name": "Ethan McDonald",
            "rating": 5,
            "review_text": "Wow.  This place really blew my expectations away.  I didnt try any food, just went for drinks.  Honestly, they made some of the highest quality cocktails I have ever tasted.  The bartenders are great guys too.  They had really good recommendations based on what I said I was looking for.  They are certainly pricey compared to your average cocktail place, but its not your average cocktail place!  I would highly recommend giving it a try if youre looking for an upscale drinking experience.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:28.961745",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 121,
            "total_number_of_photos_by_reviewer": 63,
            "reviewer_url": "https://www.google.com/maps/contrib/104531277609955253801/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcXBDd2FREAE",
            "reviewer_name": "Tim Nguyen",
            "rating": 5,
            "review_text": "Great food and drinks for brunch. I got the eggs benny and mimosa. Server was very attentive and the vibe is nice inside.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:28.964152",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/103278845409899496876/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcEwzTGlBRRAB",
            "reviewer_name": "Irene H",
            "rating": 5,
            "review_text": "Botanist is one of the most beautiful spots I ve visited    I love the interior and decor, as well as the amazing service we had. We came for their weekend brunch which consisted of choosing an appetizer, main, dessert, as well as sparkling wine and a handcrafted cocktail to accompany your meals   For the price we paid which was $62 per person, it was definitely worth it since you also got sparkling wine and a cocktail of your choosing. This spot is definitely a must visit if you re looking for upscale brunch, for a girls day or to take someone special. Reservation is a must which can be done easily online. IG: Ayenomz",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:28.966314",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 226,
            "total_number_of_photos_by_reviewer": 957,
            "reviewer_url": "https://www.google.com/maps/contrib/117874201401791491240/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlc09uZlZnEAE",
            "reviewer_name": "Joanna Yan",
            "rating": 5,
            "review_text": "Located in the Fairmont hotel on the second floor, Botantist had a cozy dining space with a lively ambiance. If you sit near the back you can see the chefs inside the kitchen preparing the meals. Our server, she was accommodating to a dairy allergy and kept me and my partner on the loop on which dishes could be adjusted or recommended a dish that didn t have dairy on it. The scallops were my favorite, it was was wrapped with duck prosciutto and the flavor of the duck was absorbed by the scallops. The fried duck skin was tasty on top of it! We mentioned that it was our birthdays this month and at the end of the meal she brought out a dish for each of us with ice cream and sorbet with a small candle on the plate. It was a thoughtful gesture.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:29.572947",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 28,
            "total_number_of_photos_by_reviewer": 592,
            "reviewer_url": "https://www.google.com/maps/contrib/102012734133548028488/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcmN5aV9RRRAB",
            "reviewer_name": "Svea Poulsen (Sveava)",
            "rating": 5,
            "review_text": "Such an incredible space! Thoughtfully designed space with beautiful lighting. The service was on point. Chris our server was so lovely. He had great timing and had great suggestions. We tried the We ll Take It From Here Chefs tasting menu. The flavours were absolutely perfect and the Uni risotto was my absolute favorite. Everything about this dining experience was delightful. Would highly recommend this for a special occasion or if you want a special treat!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:07:29.576996",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 372,
            "total_number_of_photos_by_reviewer": 1569,
            "reviewer_url": "https://www.google.com/maps/contrib/109898239997223252510/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXb01TdGZREAE",
            "reviewer_name": "Rachel Starchuk",
            "rating": 5,
            "review_text": "came here for my friends birthday, it was my first time going to a place this fancy. the atmosphere was very nice. Although, in the garden the chairs arent very comfortable, and the lighting in the evening is pretty harsh. the food was very good ( we had the salmon and the duck ) the duck was our favourite. The what the flower drink was very flowery, and u could not taste the alcohol which was amazing. After asking we recieved a free desert ( banana tart ) for the occasion which was beautiful and all the flavours went amazingly together. definitely reccomend eating here at least once for the experience of high quality food. :)",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:29.580026",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/114960030492444541692/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NUo2T05REAE",
            "reviewer_name": "Lee Mason",
            "rating": 5,
            "review_text": "My wife and I had an amazing experience at Botanist tonight! Thank you Blair and Mathew for the world class food, service, and wine pairings!! Definitely get the tasting menu and the wine pairings  you won t be disappointed. We will be coming back with anyone we want to impress.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:29.583030",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/105962298372056860575/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cUxPMXpnRRAB",
            "reviewer_name": "Nicholas Quintillan",
            "rating": 5,
            "review_text": "Certainly a terrific experience. I ve known the lead bartender my whole life. He recently won some well-deserved accolades and he truly is the best bartender in Canada and even perhaps the world. A strong statement for sure, however, his cocktails are creative, unique, balanced, and ridiculously flavourful. The service was outstanding and the food was unbelievably great. If you want an  out-of-this-world  experience, come have some drinks and food at Botanist. Highly, highly recommended! It was the best Burrata and Duck I ve ever had.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:29.586000",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 344,
            "total_number_of_photos_by_reviewer": 1771,
            "reviewer_url": "https://www.google.com/maps/contrib/118017075339925063009/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NXZxVzJ3RRAB",
            "reviewer_name": "Emily Cho",
            "rating": 5,
            "review_text": "Food was cooked perfectly, and was delicious. The menu was very well thought out, with classic items paired with surprising goodies on the side ( the sirloin had some gnocci-like chewy tidbits) The music in the curved seats area was a bit too loud for conversation. I went for my birthday and recieved a card signed by the staff, which was very sweet! Parking: Its a hotel so valet parking is available probably, but street parking a block or two away is not too expensive",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:29.588499",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 24,
            "total_number_of_photos_by_reviewer": 74,
            "reviewer_url": "https://www.google.com/maps/contrib/111433062285202090255/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcXEydnJRRRAB",
            "reviewer_name": "Karen Wu",
            "rating": 5,
            "review_text": "Had a great time at Botanist! The wagyu beef carpaccio and the dry-aged duck breast are a must order. Also really enjoyed their live jazz music from a pianist throughout our dinner",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:29.591786",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 37,
            "reviewer_url": "https://www.google.com/maps/contrib/103951402230242024451/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMS1qLTN3RRAB",
            "reviewer_name": "Simone Sortwell",
            "rating": 5,
            "review_text": "One of our favourite brunch places in Vancouver! Botanist has delicious food and notable cocktails. The atmosphere is elegant with a natural botanical garden feel. The servers are extremely friendly and helpful. I would recommend reservations to ensure you get a table for brunch on the weekends.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:29.594584",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 29,
            "reviewer_url": "https://www.google.com/maps/contrib/112575283289428363198/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxa3VQUmlRRRAB",
            "reviewer_name": "Bryanna g",
            "rating": 5,
            "review_text": "We were fortunate enough to get a table at Botanist this weekend and it ended up being a fantastic experience all around! Service was wonderful. The meals were attractive, well composed and of course delicious. To my surprise the appetizer tagliatelle (split in the photo which was a nice surprise when it arrived for easier sharing), the sourdough bread and the chocolate fondant dessert stole the show for me. I tend to like meat centric appetizers the most when dining out so I was pleasantly surprised by which dishes ended up being my favorite. We tried most of the cocktails on their list and each one was unique and flavorful. The stamped logo in the ice was just one of the many fine details we noticed throughout our experience. My only disappointment was that we got full too fast and I could not try more dishes.  Next time! Thanks again Botanist staff!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:07:29.596954",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 41,
            "total_number_of_photos_by_reviewer": 96,
            "reviewer_url": "https://www.google.com/maps/contrib/105276562227890662975/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOWN1SzBBRRAB",
            "reviewer_name": "Shawn Gill",
            "rating": 5,
            "review_text": "Went here for the chiefs tasting menu what a feast, great presentation. WOW   so delicious",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:29.599179",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 116,
            "total_number_of_photos_by_reviewer": 312,
            "reviewer_url": "https://www.google.com/maps/contrib/104522494087857912174/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDcV9icDhBRRAB",
            "reviewer_name": "Athena",
            "rating": 5,
            "review_text": "This restaurant came highly recommended by several friends, and it did not disappoint! I came here for their Thanksgiving brunch, which included a glass of sparkling wine, an appetizer, an entree, a dessert, and a cocktail, and each item was executed to perfection. The servers were also attentive and friendly, and the interior was gorgeous (perfect for those Instagram photos). Overall, Botanist is an excellent choice for fine dining or when youre looking to impress.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:07:30.185883",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 191,
            "reviewer_url": "https://www.google.com/maps/contrib/109089562596351193753/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeFlmWmdBRRAB",
            "reviewer_name": "Kristen",
            "rating": 5,
            "review_text": "Gorgeous atmosphere!! Both the restaurant and the lobby bar are chic, trendy, perfect for after work drinks or a bite. Good crowd, young professionals, chic, social. The food and service were both fantastic, as per most Fairmont establishments. Highly recommend",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:30.189533",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 31,
            "total_number_of_photos_by_reviewer": 158,
            "reviewer_url": "https://www.google.com/maps/contrib/104615901946882426714/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbkktUFVBEAE",
            "reviewer_name": "M Ping",
            "rating": 5,
            "review_text": "I like the whole plant vibe. The names of the cocktails are quite unique and the service was attentive. We had the tasting menu and the food was presentation was delicate and well executed. My favourite dish was the torched salmon! The texture was rich and smooth because they only charred the surface.",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 02:07:30.192900",
            "response_from_owner_text": "Thank you for your kind compliments on your recent experience at Botanist. We are glad to read that you enjoyed the food and beverage offerings, especially the Torched Salmon. We hope to welcome you back again soon! Sincerely, Kristin Unger Restaurant Manager, Botanist",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-12-01 02:07:30.192900",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 209,
            "total_number_of_photos_by_reviewer": 836,
            "reviewer_url": "https://www.google.com/maps/contrib/111004289367557640062/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbE42bDBBRRAB",
            "reviewer_name": "yvette y tang",
            "rating": 5,
            "review_text": "Its an experience! Obvi the pics cant transcend the small and texture, I would say its a pretty good price for the 6 course menu. Wonderful! No eating the next day.....",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:30.196705",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 605,
            "total_number_of_photos_by_reviewer": 324,
            "reviewer_url": "https://www.google.com/maps/contrib/105290422702691440975/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NXJ1OG9nRRAB",
            "reviewer_name": "Felipe Canas",
            "rating": 5,
            "review_text": "Unique cocktails, top notch food, excellent service.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:30.200250",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 95,
            "total_number_of_photos_by_reviewer": 52,
            "reviewer_url": "https://www.google.com/maps/contrib/116872922101108090934/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndWRINE5nEAE",
            "reviewer_name": "Winston Fan",
            "rating": 5,
            "review_text": "Food here is great, the Chef spend time making sure the food has multiple layers of taste and there are many different kind of elements to make up a dish.  Food her looks simple but it is never boring, and the chef really spend on arranging the plates so it looks appetizing and delicious.  The plates all came out with the right temperature so it is perfect to eat, not too hot and not too cold.  Service here is very good, the waiters and waitresses are well trained.  Price is pretty decent in a high end hotel.  I enjoyed my time dining here in this restaurant, and I would definitely come back again.",
            "published_at": "5 years ago",
            "published_at_date": "2018-12-01 02:07:30.203554",
            "response_from_owner_text": "Dear Winston, Thank you for sharing your feedback on your recent Botanist visit. We are happy to hear that you enjoyed the flavor and ascetics of our dishes as well as the service provided by our team. We look forward to welcoming you back soon. Sincerely, Shon Jones-Parry General Manager, Botanist",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-12-01 02:07:30.203554",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 345,
            "total_number_of_photos_by_reviewer": 2299,
            "reviewer_url": "https://www.google.com/maps/contrib/109400250418893082794/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbUpHaGJREAE",
            "reviewer_name": "Jacob Wong",
            "rating": 5,
            "review_text": "We had the tasting menu for Valentines Day at the Botanist restaurant with the featured wine pairing. Honestly, with the pandemic and all, I was glad to finally sit back down in a nice restaurant after so long. All the food was good with my favourite going to the smoked and charred seabass, and the root salad with tomato water. The truffle shavings, unfortunately, were tasteless for the most part as I tried really really hard to taste some earthy goodness, but couldnt get any fragrance from them (either summer truffle, or a not so great batch), and they ended up being a pretty garnish on the pasta in the end. Mind you, the pasta was still good, and Im inspired to make it at home some time. The live dinner jazz piano music was also a great addition to dinner, and I had a good chuckle with the music selection for the night with pieces coming from several anime movies and video games such as Studio Ghibli mixes, Sailor Moon, Super Mario 64, and Final Fantasy just to name a few. Our server and sommelier were great and took time to chat with us at times. We were well taken care of and they were very polite. In the end, we spent 3 hours for dinner and had a very relaxing night. Although, this was the most Ive spent on a meal in Vancouver, ever, it was a good welcome back into the fine dining scene that Ive been away from for too long.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:30.206585",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 151,
            "total_number_of_photos_by_reviewer": 304,
            "reviewer_url": "https://www.google.com/maps/contrib/111606710567674406022/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcWNXeUN3EAE",
            "reviewer_name": "C M",
            "rating": 5,
            "review_text": "I had an amazing brunch here. Beautiful botanical interiors, good services, and egg Benedict was the best I ve ever tried in Canada. French toast was also great! I wanna try the bar next time. I highly recommend this place.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:30.209028",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 359,
            "total_number_of_photos_by_reviewer": 2366,
            "reviewer_url": "https://www.google.com/maps/contrib/107630661908365795774/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtaXNQaHlBRRAB",
            "reviewer_name": "Tracy Ta",
            "rating": 5,
            "review_text": "Had dinner here on our visit to Vancouver and we were blown away. The drinks were so beautiful and so so so delicious oh my goodness. I can t express how much we loved the drinks. The appetizers we ordered were the wagyu beef carpaccio, the charred octopus and the burrata salad. The burrata salad was good but it was nothing special. The beef carpaccio was definitely up my alley, very good. The charred octopus was chefs kiss amazing. For our main course we ordered the duck and the salmon. Both were done with perfection. Highly recommend this restaurant to anyone!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:30.211428",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 99,
            "total_number_of_photos_by_reviewer": 723,
            "reviewer_url": "https://www.google.com/maps/contrib/102664193033965595150/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoazQtbkNBEAE",
            "reviewer_name": "Yvette",
            "rating": 5,
            "review_text": "If you love tasting menus, Botanist is the place to go. As someone who has surveyed many Michelin star and high end restaurants, I was blown away by the quality of the food and service from staff.",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:07:30.213787",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 36,
            "total_number_of_photos_by_reviewer": 41,
            "reviewer_url": "https://www.google.com/maps/contrib/112850764080524892448/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}