{
    "place_id": "ChIJnZ1frX1xhlQRghsMoiNlK7I",
    "reviews": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbl9tSlZnEAE",
            "reviewer_name": "John S",
            "rating": 5,
            "review_text": "Aquariums West is an aquatic paradise right in the heart of Vancouver. I was immediately captivated by the sheer variety of plants available - from lush greens to vibrant reds, they had a wide selection that were visually stunning. The knowledge and guidance provided by the staff made it easy to select the perfect plants for my aquarium. One of the most delightful discoveries during my visit was the adorable cherry shrimp. These little creatures added an unexpected charm to the store. The staff s expertise in caring for these small invertebrates was evident, and their health and vivacity were a testament to the store s commitment to quality and care for all its inhabitants. The store itself is a treasure trove for any aquatic enthusiast. Beyond the vibrant flora and charming shrimp, Aquariums West boasts an impressive array of supplies and fish species. The attention to detail in maintaining the tanks and the quality of the aquatic life on offer truly sets this place apart. Whether you re a seasoned aquarist or a newcomer to the hobby, Aquariums West is an absolute must-visit. The diversity, quality, and expert guidance make it a top destination for all things aquatic. I left not just with new additions for my tank but also with a wealth of knowledge. Kudos to Aquariums West for providing such a wonderful experience.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:14:21.234492",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 132,
            "reviewer_url": "https://www.google.com/maps/contrib/100082286603959938429/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMW8zd3JBRRAB",
            "reviewer_name": "Christina Evans",
            "rating": 5,
            "review_text": "First time ordering with you guys and ya have some of the nicest plants I ve seen in a long time. Very accurate fullness like the photos. I ordered 4 different Anubias types. Many had multiple plants too.  Great prices for what I received. Packaged well. Super pumped and definitely need more so I look forward to it!",
            "published_at": "4 days ago",
            "published_at_date": "2023-11-18 01:14:21.238266",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/107250118990176232241/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eGViSXB3RRAB",
            "reviewer_name": "Nicole Parsons",
            "rating": 5,
            "review_text": "Honestly this is the best (and only?) good Aquarium store in the city. Always super knowledgeable & helpful staff regarding reptiles and fish. Aquarium equipment and supplies. A Great selection of water plants. They also sell rodents, guinea pigs and chinchillas too! Pretty much bought everything for our tank from this store over the past 15 years. Except our actual tank which was from the 80s. Just a heads up side note; It can be a little uptight with the on-going covid restrictions and how you enter and leave the store can be a bit uncomfortable and off-putting. You have to leave your backpack behind the counter and wait behind a rope before being allowed entry. This is understandable in our city of Vancouver where shoplifting & addiction is rampant unfortunately. This store is way too nice to let any scumbags in. I get it.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:14:21.241830",
            "response_from_owner_text": "Hi Nicole, Thanks for being a happy and loyal customer for 15 years.  It is unfortunate that we have had to implement security measures at the stores entrance and exit.  It is all meant to keep staff and customers safe.  The stories we could tell....",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:14:21.241830",
            "review_likes_count": 6,
            "total_number_of_reviews_by_reviewer": 148,
            "total_number_of_photos_by_reviewer": 98,
            "reviewer_url": "https://www.google.com/maps/contrib/118369554737501814316/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a0xhTGN3EAE",
            "reviewer_name": "Avery Carmichael",
            "rating": 5,
            "review_text": "I didn t buy anything but my god did I have fun here for an hour or so. They carry such a large variety of fish. There s also reptiles, amphibians, spiders, and a set of guinea pigs looking for a home!! When I have the time and space for fish I will be coming back here to get them and all the supplies",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:14:21.245372",
            "response_from_owner_text": "Hi Avery, We hope that you do come back if/when you decide to get into fish, plants or exotic reptiles.  Hopefully, you have been inspired.",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-11-01 01:14:21.245372",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 45,
            "total_number_of_photos_by_reviewer": 54,
            "reviewer_url": "https://www.google.com/maps/contrib/117016951361046152113/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbmZMaExnEAE",
            "reviewer_name": "Jocelyne Lin",
            "rating": 5,
            "review_text": "Beautiful, beautiful aquariums and friendly employees. You may find interesting fish now and then, as they frequently import fish from Asia. Check their website to find out what they currently stock!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:14:21.248842",
            "response_from_owner_text": "Hi Jocelyne, The staff will love your review. Thanks for recognizing that the aquariums are beautiful and the employees are friendly.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:14:21.248842",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 96,
            "total_number_of_photos_by_reviewer": 125,
            "reviewer_url": "https://www.google.com/maps/contrib/118394685436432325986/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcDVDd3hRRRAB",
            "reviewer_name": "P Cho",
            "rating": 5,
            "review_text": "Ive finally made it to this place after a long desire to come here.  The lack of parking and location make it hard to visit. The store is clean and tidy.  However I am thrilled about how clean their tanks are.  Also they seem to specialize in planted tanks.  Fish are also quite unique. We were asked if we needed help twice so we were looked after well.  The prices are decent and we noticed other stores upping the cost of basic fish like neon tetras.  I wont complain about the cost here because everything costs more in this day in age..  Plus rental space downtown is not cheap.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:21.252164",
            "response_from_owner_text": "Hi P Cho, Thanks for leaving such a detailed review and noticing the clean aquariums.  Parking downtown is difficult if you dont know where to go. Lucky for us we are super close to Costco where there are tons of parking spots all the time.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:21.252164",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 140,
            "total_number_of_photos_by_reviewer": 126,
            "reviewer_url": "https://www.google.com/maps/contrib/106786203725608479654/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a2Zhek9BEAE",
            "reviewer_name": "Cassandra McWade",
            "rating": 5,
            "review_text": "This is my go-to pet shop, despite living out int he Tricities. Super amazing staff who are friendly, knowledgeable, empathetic. Prices are good and if you have any specialty reptiles, I trust the people at Aquariums West as having the final word. Theyve made entering the exotic pet hobby welcoming and easy for a newbie",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 01:14:21.254964",
            "response_from_owner_text": "Hi Cassandra, We are so happy that you make the trip from the Tricities to Yaletown to shop in our store.  The fact that you trust us as having the final word with regards to reptile care is fantastic and says volumes about the staff.  They will be so happy to read this review.",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-11-01 01:14:21.254964",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111018453420804689089/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMl8tSnpnRRAB",
            "reviewer_name": "Ashley G",
            "rating": 5,
            "review_text": "Amazing selection of high grade equipment, unique breeds, and the best aquascaping supplies I ve ever seen. If aquariums are a hobby you enjoy or want to get into, I highly recommend a visit. It s also a gorgeous store to just take a look in, the staff clearly put a lot of love and care into the stunning ecosystems they create.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:14:21.258091",
            "response_from_owner_text": "Hi Ashley, What a fabulous review.  Thank you so much for recommending Aquariums West!  We have an amazing staff that are passionate about what they do.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:14:21.258091",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103650976892348109840/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaV95NXpRRRAB",
            "reviewer_name": "Michael Vogel",
            "rating": 5,
            "review_text": "Fantastic specialty place with everything anyone would need to start or maintain a fish tank or terrarium. Great stock both in hardscape, live plants and both freshwater and saltwater fish. The staff is very knowledgeable and will be able to help you with any problem you might have. I couldnt recommend them more if I tried.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:14:21.260888",
            "response_from_owner_text": "Hi Michael, Thanks for taking the time to leave such a great review and letting people know that we have everything anyone would need to start or maintain a fish tank or terrarium.  We are so happy that your experience was a good one.",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:14:21.260888",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 93,
            "total_number_of_photos_by_reviewer": 174,
            "reviewer_url": "https://www.google.com/maps/contrib/113214028340946037101/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad0s3U2Z3EAE",
            "reviewer_name": "Ivor Luk",
            "rating": 5,
            "review_text": "Great customer service - I bought an aquarium kit as an impulse. When I got home searching for accessories etc I found out that another local store was selling what I just bought for 40% less than what I paid for it. I was disappointed in myself for not checking before hand but I let the owner Jeannie know and she accepted the discrepancy and refunded me the difference even though I said I would prefer supporting small businesses and happily take store credit - she insisted I take the refund. We don t see these kind of store owners these days  thank you Jeannie",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:14:21.263673",
            "response_from_owner_text": "Thanks so much for the kind words Ivor! Jeannie will be happy to hear you had a good experience with us. We always try to make things work with our customers. Being a small business and competing with larger chains can be tough, and we appreciate you supporting us!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:14:21.263673",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114863376832345467460/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aVlXb2t3RRAB",
            "reviewer_name": "Alex Bellavance",
            "rating": 5,
            "review_text": "My first time here was great! I m new to the fishkeeping hobby and aquascaping - the staff were answering my questions without me feeling annoying and gave me some helpful tips. The store was stocked with so many cool natural decors, equipment, and beautiful livestock. Thanks guys!",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 01:14:21.917301",
            "response_from_owner_text": "Hi Alex, We appreciate you taking the time to leave us a fabulous review.  Glad you got some helpful tips from the staff.  We receive new fish, plants and decorations almost every week so you will have new products to see next time you come to the store.",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-11-01 01:14:21.917301",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 28,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/108912959703961619986/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bnV5M3JRRRAB",
            "reviewer_name": "Allyson Sagin",
            "rating": 5,
            "review_text": "Happened to wall by on our way to lunch and of course had to go in, even if fish store shopping when you cant buy fish is torture. Beautiful store, well organized, whoever is planting their tanks is AN ARTIST, they are absolutely stunning. Fish all seemed well loved, but the care and attention paid to their bettas made me so happy. Lots of space, fresh clean water, happy clear eyed brightly coloured fish. The same love and attention paid to their reptiles and amphibians. Your store was a pleasure to shop in and we are so happy we are going home from our vacation with some new decor for our own tanks.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:14:21.921641",
            "response_from_owner_text": "Hi Allyson, Thanks for the great review.  Glad that you made a trip to visit Aquariums West during your vacation.  The staff work very hard at their presentations and are so happy when they are recognized as artists!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:14:21.921641",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108092547230871431778/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabi0yODN3RRAB",
            "reviewer_name": "Enrique sanchez",
            "rating": 5,
            "review_text": "Good service Friendly employees Cool animals Store is overall clean and organized would find everything you need for your fish tanks or reptiles 10/10  recommended checking is place out",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:14:21.924967",
            "response_from_owner_text": "Hi Enrique, Thanks for the 10/10 review!",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-11-01 01:14:21.924967",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114414696049514455505/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOFl2NnRBRRAB",
            "reviewer_name": "Queenie Le",
            "rating": 5,
            "review_text": "I ve been to Aquarium West several times and I ve only ever had nice experiences. The one time I purchased a large tank, they helped me carry it to my car and when I had questions about the plants and livestock their staff was very knowledgeable and would help me find exactly what I was looking for. The girl that works there is honestly the best! There was one time where she helped me brainstorm a plan for re-aquascaping my tank. Overall, I highly recommend it here :)",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:14:21.928150",
            "response_from_owner_text": "Hi Queenie, We are very happy that you have had nice experiences shopping in the store. And yes, Jenn is the best!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:14:21.928150",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": 12,
            "reviewer_url": "https://www.google.com/maps/contrib/111815511829493547270/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSa05tUGJBEAE",
            "reviewer_name": "noah rosello kero",
            "rating": 5,
            "review_text": "Went on a morning visit over to Aquariums West the other day! Had an alright time purchasing aquatic plants and a few fish, staff there are super friendly and knowledgeable! Thanks again friends :) Will for sure be back soon!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:14:21.931323",
            "response_from_owner_text": "Hi Noah, Thanks for taking the time to leave a 5 star review.  The staff will be happy to see that you think they are friendly and knowledgeable.",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:14:21.931323",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/114059479802081777667/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4XzlucWlBRRAB",
            "reviewer_name": "Med Mazher",
            "rating": 5,
            "review_text": "Fantastic aquarium shop with a great selection! Knowledgeable and friendly staff, well-maintained tanks, and a wide range of products. I especially love their terrariums and paludarium displays. Highly recommended!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:14:21.934317",
            "response_from_owner_text": "Hi Med, Happy that you enjoy the terrarium and paludarium displays.  They are meant to inspire and enjoy. Always nice to hear that the staff are friendly and knowledgeable.",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:14:21.934317",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116525747566018209096/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMDdEMDlRRRAB",
            "reviewer_name": "Meadow Pavlovic (TheWizardInYourBasement)",
            "rating": 5,
            "review_text": "JAW DROPPING BEAUTIFUL STORE Trust me, go here instead of ANY other fish store in Van!!! When I walked in my mouth dropped until an employee said hello lol. I have problems with every fish store I ve ever been to because of quality, disease/parasites, bad employees, etc, but NOT THIS PLACE I came in for some stuff for my betta because I did a fish in cycle (tank was barren), and left with 4 beautiful and cute red cherry shrimp (cheapest I ve found in Van and great quality), a couple bundles of moss, and two long grass like plants. No sign of disease, high quality supplies/fish, friendly and knowledgeable staff, and the care of the tanks were immaculate! Lots of the tanks had GORGEOUS aquascapes (good for inspiration), and I was met at the door by a pond of goldfish (lovely touch, a little overstocked but they take such good care of the tanks/water it s not a problem). I also saw a cute turtle, and lots of saltwater supplies/fish, all in great condition. I also saw a few enclosures for reptiles I assume, and they looked very natural and well put together (I know nothing about reptiles, but the enclosures looked very nice). I have to give these guys a full 5 stars because I ve NEVER seen such a well kept fish store in my life (I used to breed fish and I ve kept fish for almost my whole life). I could go on forever about how amazing this place is, everyone who has fish NEEDS to go here sometime!!!! I couldn t find a single fish that looked sick, all plants were high quality, a few discounts around the store for bulk buying, all in all they ACED what a pet store should strive to be. Jaw dropping impressive and stunning, I wish I could give 10 stars   I ll never go to another place from now on for fish. Fantastic job to everyone who works there and whoever owns the place",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:14:21.937330",
            "response_from_owner_text": "Hi Meadow, Wow! what a fabulous review.  We are so happy that you had a really good look at everything and recognize all the hard work it takes to have healthy fish and beautiful aquariums.  The staff appreciate the fact that as an aquarist and fish breeder yourself, you really know what it takes.",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:14:21.937330",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116887741119660588401/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbUk3UjZBRRAB",
            "reviewer_name": "Blaithin Ruadh",
            "rating": 5,
            "review_text": "Great selection of supplies needed for any sort of fish tank, very helpful staff and always a pleasant experience when i visit",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:21.940663",
            "response_from_owner_text": "Hi Blaithin, Thanks for your 5 star review and posting such great pictures!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:21.940663",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 79,
            "total_number_of_photos_by_reviewer": 615,
            "reviewer_url": "https://www.google.com/maps/contrib/105408175378567285157/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCX2NyUXlnRRAB",
            "reviewer_name": "Mayumi Dar",
            "rating": 5,
            "review_text": "My son wanted to start his very first terrarium for his very first pet and everyone I knew said this was the place to go.  The store is super clean, well organized and stocked. Doug was extremely helpful.  Even though he was the  fish guy  he was so knowledgeable and patient and took so much time going through everything with my son and I.  Everyone in the store was very helpful and obliging to my sons questions and comments.  I highly recommend this shop, not only for their amazing selection of products and beautiful setup but their service and knowledge is top notch. Ty Doug and AW!",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:14:21.943479",
            "response_from_owner_text": "Hi Mayumi, Wow!  Thanks for taking the time to leave a great review.  Doug will be so happy that you recognized his patience and knowledge. How exciting for your son to learn all about looking after a living creature!  I am assuming he got a lizard, which makes for a fabulous first pet.  Have a ton of fun with your son and his new responsibility.",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:14:21.943479",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104106697850291471940/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdGJqbV9RRRAB",
            "reviewer_name": "Aryaman Chadha",
            "rating": 5,
            "review_text": "Great collection of healthy fish. After buying my fish from here and taking care of it for more than a year now, i agree that its not possible to teach a customer everything there is to know. The staff was actually very helpful when I came in at a slower day.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:14:21.946090",
            "response_from_owner_text": "Hi Aryaman, Thank you for updating your review! We love helping people see the joy in fish keeping, and its always fun to see how our customers improve and continue to be excited about this amazing hobby!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:14:21.946090",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 31,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/105792406720737073312/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbEx1R1BREAE",
            "reviewer_name": "bob gifford",
            "rating": 5,
            "review_text": "Ive been in a bunch of different aquarium shops. This one stands head & shoulders above anything else around the lower mainland. Great selection and super helpful staff.",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:14:22.652447",
            "response_from_owner_text": "Hi Bob, Wow!  Thanks for the great review.  The staff will love that you recognized them.",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:14:22.652447",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 82,
            "total_number_of_photos_by_reviewer": 130,
            "reviewer_url": "https://www.google.com/maps/contrib/106152437363896723156/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVZy1UeXlBRRAB",
            "reviewer_name": "Ray Dubs",
            "rating": 5,
            "review_text": "Fun to have a look even if you re not buying a pet (though you might be really tempted to after seeing all the marvellous creatures here) Such a huge collection of animals they have at Aquariums West. Mostly fish but you ll also see plenty of other neat specimens like snakes, lizards, turtles, frogs and even huge spiders and scorpions. Check out the biggest spider you ll ever see in real life: the Bird-Eating Spider",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:22.655849",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 75,
            "total_number_of_photos_by_reviewer": 168,
            "reviewer_url": "https://www.google.com/maps/contrib/108829111665734774915/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyZy1tQnBBRRAB",
            "reviewer_name": "Questgiver Cyradis",
            "rating": 5,
            "review_text": "Best pet store in the area for nonstandard pets. Clean, knowledge, and kind. Have all I need for reptile supplies. Absolutely worth the extra commute time for me to go there instead of the dirty and grungy pet store down the street. ^^ The above is my original review from 11months ago, and I stand by it. I got my beloved bearded dragon here. My lizard is a delight. The shopkeepers here care for the animals well, and get them acclimated to people calmly and compassionately. Dropping in, Id often see them with a chameleon or a chinchilla on their shoulder, getting the animal used to chilling with them. I have since moved away, so I cant go here anymore for my pet supplies. But I found myself needing a letter from them verifying that my lizard was captive bred and that they sold it to me - they responded to my email immediately and professionally with a letter stating as much. I wish this shop all the best, and highly recommend them.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:14:22.658174",
            "response_from_owner_text": "Hi there, Thanks for the 5 star review and choosing Aquariums West over a dirty and grungy store.  Yahoo!  All the cleaning has paid off!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:22.658174",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 35,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/101685550709410912530/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aW92aGp3RRAB",
            "reviewer_name": "Wendy Mui",
            "rating": 5,
            "review_text": "Thank you Aquarium west! Great customer service and super helpful to a newbie trying to raise neocaridina s. They were super patient with all my questions and helped me along the way. Best experience ever!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:22.661033",
            "response_from_owner_text": "Hi Wendy, Thanks so much for leaving such a great review.  Raising shrimp is so much fun.  Maybe one day when you master breeding shrimp, you can supply us with some of your babies!  Good luck!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:22.661033",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/104459783898089108092/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOTliQVR3EAE",
            "reviewer_name": "Youngmin Koo",
            "rating": 5,
            "review_text": "Best fish store in Vancouver   I could live in it. Super helpful staff, shout out to Jen, lol. The stores located downstairs & a bit hard to find at first. But totally worth it. Excellent prices too. Wish I had more tanks.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:14:22.663771",
            "response_from_owner_text": "Hi Youngmin, Thanks for the great review and Jen will be pleased that you have appreciated her help.",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 01:14:22.663771",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/102975470980063085922/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSN3VQTUFnEAE",
            "reviewer_name": "Aman Randhawa",
            "rating": 5,
            "review_text": "Nice selection of all things fish and reptiles. They have great display set ups of reptile terrariums and vivariums! All the staff were very friendly and helpful too!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:14:22.666176",
            "response_from_owner_text": "Hi Aman, Thanks for taking the time to recognize our great displays and helpful, friendly staff.",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:14:22.666176",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 27,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107383343612438273788/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eTliX3BnRRAB",
            "reviewer_name": "Anna Kolichen",
            "rating": 5,
            "review_text": "Coming here is an addiction at this point! They have everything you could possibly need and more. Number 1 indicator that an aquarium store is high quality and knows what they are doing to me, is how they keep their bettas Not a single miserable cup in sight! Each fish has its own little tank and they are all healthy and happy looking! Staff is helpful and friendly without being overbearing (think constantly asking about assistance and following you around) which is nice when just browsing the shelves and planning what to get! Highly recommend this store",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:22.668538",
            "response_from_owner_text": "Hello Anna, What a great review. Thank you for taking the time to share your thoughts.Over the years we have changed how we keep our Bettas, and are always looking to improve.It can be a challenge when we get new orders of over 100 or more, but we always try to give them a comfortable holding area until they go to their larger, enriched, forever homes. Thanks again and hope to see you soon.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:22.668538",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/113232715291038762061/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeGJLaGt3RRAB",
            "reviewer_name": "D B",
            "rating": 5,
            "review_text": "Lots of aquatic pets here, some reptiles and guinea pigs as well. Cool place",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:14:22.670885",
            "response_from_owner_text": "Hi D B, Thanks for noticing that we have a cool place!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:14:22.670885",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104099899881250192411/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwXzZpTVdnEAE",
            "reviewer_name": "Nurse Nina",
            "rating": 5,
            "review_text": "Very knowledgeable staff and wonderful selection of aquatic supplies and live stock",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:14:22.674030",
            "response_from_owner_text": "Hi Nurse Nina, Thanks for leaving us a stellar review.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:14:22.674030",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 105,
            "total_number_of_photos_by_reviewer": 47,
            "reviewer_url": "https://www.google.com/maps/contrib/102976491481116397066/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNzZIY2tBRRAB",
            "reviewer_name": "Psychotic Percy",
            "rating": 5,
            "review_text": "Very friendly staff even if you dont buy anything and just go around looking like me :)))). Nice place.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:14:22.676618",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 92,
            "total_number_of_photos_by_reviewer": 241,
            "reviewer_url": "https://www.google.com/maps/contrib/117767364802655693111/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScTZUcWNBEAE",
            "reviewer_name": "Allison Collingwood",
            "rating": 5,
            "review_text": "Great! Always have a good range of freshwater and saltwater fish, as well as a moderately-sized reptile section. I come here mostly for frozen food for my ball python, which they have in many sizes for decent price.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:14:25.185811",
            "response_from_owner_text": "Hi Alison, Thanks for taking the time to leave us a 5 star review.  We really appreciate that you have noticed our selection of fresh and saltwater fish and purchase food for your ball python.",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:14:25.185811",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/102967871379484482426/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsME11V0dBEAE",
            "reviewer_name": "Quiara Finly",
            "rating": 5,
            "review_text": "Lowest prices at any fish store we ve been to in the lower mainland. Will be back!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:14:25.189616",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110386916748190017570/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcHVQOFRnEAE",
            "reviewer_name": "Heather Morlidge",
            "rating": 5,
            "review_text": "This place is awesome! Amazing staff! They re extremely knowledgeable and will take the extra time to make sure any kind of set up you are building for your animal friends is safe, clean and well put together. Also makes for a great place to stop by and see some awesome critters and learn more about what youre getting into before you make any big decisions. I would recommend this as a top spot for all aquarium needs",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:25.191868",
            "response_from_owner_text": "Hi Heather, Thanks for the detailed 5 star review and recognizing the knowledgeable and amazing staff!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:25.191868",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104933616812503307063/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNnRIaW9BRRAB",
            "reviewer_name": "Manny",
            "rating": 5,
            "review_text": "Great place with good selection of fish and everything. People working in there are always nice and knowledgeable. Definitely recommend",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:14:25.194278",
            "response_from_owner_text": "Hi Manny, We so appreciate you leaving a 5 star review and noticing the knowledgeable staff.",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:14:25.194278",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111899786652451486634/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBZ09QampRRRAB",
            "reviewer_name": "Dan C",
            "rating": 5,
            "review_text": "Its a unique petshop where things are way more organised and clean.. there is variety of different pets in containers like fishtanks and setups you can choose from as per your needs.. and interests.. very friendly, knowledgeable and helpful staff..",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 01:14:25.196792",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 75,
            "total_number_of_photos_by_reviewer": 648,
            "reviewer_url": "https://www.google.com/maps/contrib/116520311103103861087/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMnVqNHZ3RRAB",
            "reviewer_name": "Makayla Clapp (Mak)",
            "rating": 5,
            "review_text": "Best local  aquarium store in the lower mainland",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 01:14:25.199233",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 28,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/106436071358332308544/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtaExmMklREAE",
            "reviewer_name": "Cris Tan",
            "rating": 5,
            "review_text": "I love this place. Its like a very relaxing place for me. The website is updated daily with live animals and goods, different shipments coming from different parts of the world. The Staff were very knowledgeable and friendly. I like the gothic cool chic, she is great and knows it all. Also, the cute tall guy with aviator hat, hes very approachable, nice. The other guys as well and cashiers were on top of things. I highly recommend this place for beginners, advanced and pet enthusiasts.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:25.201566",
            "response_from_owner_text": "Hi Cris, Thanks for loving and recommending Aquariums West!  We really appreciate you noticing the fabulous and knowledgeable staff that work here.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:25.201566",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/113846793738814635621/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCN0lPbmpnRRAB",
            "reviewer_name": "Sar",
            "rating": 5,
            "review_text": "Probably the nicest aquarium on the mainland! Every tank in here is a masterpiece - huge props to the staff for the creativity and skill it takes to create and maintain them. Lots of plants and fish for sale, as well as niche things that are hard to find elsewhere.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:14:25.203882",
            "response_from_owner_text": "Hi Sar, Thank you for leaving us such a great review.  It is so nice that you recognize the staffs hard work.",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-01-22 01:14:25.203882",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107065533997047598202/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcHF1UVF3EAE",
            "reviewer_name": "Harran Shi",
            "rating": 5,
            "review_text": "The more you go the more you like it, the longer you stay in there the more you find the hidden gems. They help you test your tank water and you can call them for stock availability. You can even call them to have your items ready in a bag to pick up. They listen to your instructions carefully and they have your items ready right on time. Before buying, if you ask about the fish, if it has been medicated and quarantined, they are always able to tell you. If your fish is sick they are willing to talk to you and provide advice. The plants are on the expensive side but they do not have algae. I especially like their low iron glass aquascape tanks. You can watch them for days. The Asian staff I think his name is Douglas is super enthusiastic and funny. The manager seems kinda quiet and yeah that is kinda true and you may be scared to approach him at first but he is actually super chill dude. Please do your research on the animal before purchasing.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:25.206399",
            "response_from_owner_text": "Hi Harran, Wow!  Thanks for leaving such a detailed review.  So happy that you have had your questions answered and been given good advice. Doug will be very happy to read this.  And...the rest of the staff too.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:25.206399",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 330,
            "total_number_of_photos_by_reviewer": 166,
            "reviewer_url": "https://www.google.com/maps/contrib/109675933446422460802/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtX01PUHlnRRAB",
            "reviewer_name": "Caroline Dick",
            "rating": 5,
            "review_text": "Went to Aquariums West for the first time today. Ive been keeping fish for decades and this is hands down the best aquarium store Ive ever seen. The COVID protocols are good, the staff are friendly. If you want help, they help you, if you want to be left alone, they leave you alone. They are knowledgeable and share information without being condescending. The selection is amazing. The tanks are beautifully kept. Its just a really fantastic store.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:25.208734",
            "response_from_owner_text": "Hi Caroline, Thank you so much for taking the time to leave such a stellar review.  The staff will be very happy to read this.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:25.208734",
            "review_likes_count": 5,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115688549410671389726/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeHIzcmRnEAE",
            "reviewer_name": "Artem Kuznetsov",
            "rating": 5,
            "review_text": "Love this store. Great selection of equipment, hardscape and livestock. Prices reflect the convenient location.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:25.942808",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 32,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/109773983645821150882/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbE8yRHFnRRAB",
            "reviewer_name": "Hayden Kruger",
            "rating": 5,
            "review_text": "Always come here to buy my Amphibians and Nano fish! They always have a great rotating selection of Reptiles, Amphibians, and Fish. Staff are always welcoming and helpful. I highly recommend them for all your Exotic Pet needs!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:25.945990",
            "response_from_owner_text": "Hello Hayden, Thank you for the great review! Hope to see you again soon.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:25.945990",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/106421345020151617774/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcU5MUjNnRRAB",
            "reviewer_name": "Trevor Schmidt",
            "rating": 5,
            "review_text": "Aquariums West is absolutely the best Lower Mainland store for aquarium and terrarium needs. Ive shopped there many times and have always found the staff to be very professional and knowledgeable. Jenn in particular has been a life-saver numerous times when Ive needed amphibian advice. Highly recommend!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:25.949388",
            "response_from_owner_text": "Hi Trevor, Thanks for leaving such a great review and recognizing Jenn for her knowledge and professionalism.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:25.949388",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104613822458304639662/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbXFEMGFnEAE",
            "reviewer_name": "Bijan Markazi",
            "rating": 5,
            "review_text": "Great selection of aquarium supplies, fish, and plants.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:25.952389",
            "response_from_owner_text": "Thanks Bijan for taking the time to leave a review.Great pictures !",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:25.952389",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 61,
            "total_number_of_photos_by_reviewer": 251,
            "reviewer_url": "https://www.google.com/maps/contrib/103562696509523722845/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaV9TRC1nRRAB",
            "reviewer_name": "Adrian Crook",
            "rating": 5,
            "review_text": "Another zoo we visit on the way home from school, but this is downtown. Great, family owned pet store.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:25.955438",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 33,
            "total_number_of_photos_by_reviewer": 731,
            "reviewer_url": "https://www.google.com/maps/contrib/115998725451062197582/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5eWIzYWdRRRAB",
            "reviewer_name": "Jack Hagemeister",
            "rating": 5,
            "review_text": "Amazing place with super knowledgeable and helpful staff. I dont get my fish/other tank animals anywhere else. It is clear that all the staff truly care about their jobs. Yes their prices run on the higher side, but in this hobby you should already be at peace with having to spend a little money for quality products. If youre not ok with spending money, maybe this isnt the right hobby for you (you are taking care of live animals after all). I could honestly spend hours in there looking at all the cool species. 10/10 would recommend.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:25.958107",
            "response_from_owner_text": "Hi Jack, Thank you so much for taking the time to give us such a stellar review.  We appreciate your business so much.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:25.958107",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108180133497922900660/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXanVyZFd3EAE",
            "reviewer_name": "Brad McDonald",
            "rating": 5,
            "review_text": "Aquariums West is a great pet store. The staff is knowledgeable and they take very good care of their varied living creatures. This provides those acquiring a new pet a much needed good start towards furthering the health and well being of a new animal friend.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:25.960554",
            "response_from_owner_text": "Hi Brad, Thanks for taking the time to leave us a 5 star review.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:25.960554",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114588363265472695624/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLaU9XUnRRRRAB",
            "reviewer_name": "Kolyn Gay-Message",
            "rating": 5,
            "review_text": "This is a great pet store, they provide good service, healthy fish and accurate advice. Ive never bought a fish and had outbreaks in my tank. I have had problems in the past with my tank and they were able to help me. Regardless of the limited occupancy due to COVID restriction, the staff gave me the time I needed to make the right purchase.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:25.963269",
            "response_from_owner_text": "Hi Kolyn Gay-Gray, Thanks so much for your review.  We are happy that you were able to get the help you needed for your purchase and advice when things didnt go quite right.  Everyone is trying their best.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:25.963269",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103455321227171304833/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaklyLTRRRRAB",
            "reviewer_name": "Yosuf Harb",
            "rating": 5,
            "review_text": "Came in looking for a fairly uncommon reptile and they were so much help. Glad I went in. Although the entrance and exit are a little odd, I ended up having to help a woman in a wheelchair in because no one heard her knocking on the door",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:25.965588",
            "response_from_owner_text": "Hello Yosuf, Thanks for taking the time to leave us a review. Glad we were able to help with your reptile needs. Being in a basement does have its challenges for sure. We do have doorbells and an intercom for building entry for those coming down the elevator, which work most of the time. We are always a phone call away to come let folks in if there are issues with the door. Thanks for your help and have a great day.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:25.965588",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/104080947503674903130/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCXzlXNTlRRRAB",
            "reviewer_name": "firstt3nor",
            "rating": 5,
            "review_text": "Fantastic store. They actually seem to care about their fish and customers. For a medium sized store they carry a lot of products and livestock. Definitely with coming here from out-of-town.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:14:25.968352",
            "response_from_owner_text": "Hi Firstt3nor, Thanks for visiting from out of town and leaving us a 5 star review.",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 01:14:25.968352",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/111363507779113022217/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNHBlMWF3EAE",
            "reviewer_name": "Terry Chow",
            "rating": 5,
            "review_text": "Decided to buy some plants online as I dont have a car and transit would take me about an hour.  Plants got here the day after they shipped in perfect condition.  They even refunded some of the shipping cost since it wasnt calculated properly in the online checkout.  A great experience and looking forward to visiting the store one day.  I actually work about 5 minutes away but have been working from home for the last year!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:26.613103",
            "response_from_owner_text": "Hi Terry, Thank you so much for taking the time to leave a review.  I hope you do come by and visit the store but now you know how easy it is to buy plants online!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:26.613103",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 13,
            "reviewer_url": "https://www.google.com/maps/contrib/100366024416072422437/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdjZDcDd3RRAB",
            "reviewer_name": "Aliyah Daniels",
            "rating": 5,
            "review_text": "Aquariums West is my go-to shop for fish and reptile supplies. I have an assortment of pets at home, and its so convenient to get all of my shopping done in one place. The staff is very friendly, knowledgeable, helpful, and gives advice to work within your budget. The animals husbandry standards and care are superb. I have seen them give great advice to first-time pet owners, and they are equally able to help me answer more advanced questions about my animal care. If a staff member on duty doesnt have insight into a specific issue, they have great teamwork to source the correct information for their customers. The only downside is that their hours conflict with my (admittedly unusual) work schedule, so I really have to prioritize scheduling my trips! Highly recommend for all exotic pet and reptile needs!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:26.616096",
            "response_from_owner_text": "Hi Aliyah, WOW! Thanks for leaving such a detailed review.  We really appreciate you taking the time to do that.  If you ever need anything sent to you by Canada Post (so you dont have to leave work) that isnt listed on the website, just let us know and we would be happy to mail it to you.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:26.616096",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115744435209807405407/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdUtuM1VREAE",
            "reviewer_name": "Clayton",
            "rating": 5,
            "review_text": "Awesome store its so cool. The staff where super nice and gave me a awesome deal on a plant I liked. They have everything at a good price and fully stocked. Huge selection of shrimp and fish. This is the only place Ive see hillstream loaches. Also the red tail shark near the entrance is huge! 100% a must go for fish keepers. I ment Ive never seen hillstreams In my life :) it was my first time there dont mean to miss lead",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:26.618951",
            "response_from_owner_text": "Hi Clayton, Thank you for leaving such a great 5 star review.  The staff will love it! We order in Hillstream Loaches every time we see them on our suppliers availability list.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:26.618951",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/108519586434667924473/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLeVBTQnl3RRAB",
            "reviewer_name": "Skye Dyken",
            "rating": 5,
            "review_text": "Great store! Despite being swamped with Covid, theyve been handling the demands pretty well and doing the best they can managing crowds. Worth the wait! Knowledgeable staff that are honest about what your pet will need and do their best to prepare you for giving the animal youre purchasing the best life possible. Definitely recommend - great staff, clean store and great atmosphere!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:26.621651",
            "response_from_owner_text": "Hi Skye, Thanks for the great review.  It is a very challenging time and we really appreciate your acknowledgement of the demands that the staff face every day.  You are obviously a patient and kind person to let others know that it is worth the wait.  Thank you so much!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:26.621651",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106450218679225407020/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHLXFyS2hRRRAB",
            "reviewer_name": "Vlad Constantinescu",
            "rating": 5,
            "review_text": "Absolutely amazing aquascaping and fish store! Would highly recommend! They are super helpful and can help you no matter where you are at in skill level. They have been instrumental in helping me get my first aquarium set up and stocked with great plants and decor.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:26.624208",
            "response_from_owner_text": "Hi Vlad, Thanks so much for posting such a great review.  We really appreciate you recognizing that the store is for both beginners and experienced aquascapers.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:26.624208",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/101174896210350350062/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZME42a3J3RRAB",
            "reviewer_name": "Kolton Drechsel",
            "rating": 5,
            "review_text": "Experienced, knowledgeable, professional, and fun staff. They can help with any questions from beginners getting into the hobby and for those a little more experienced. Great selection of shrimp and fresh water fish. Lots of great live plant selection. The overall environment of the store is welcoming.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:26.627057",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/117684241786391203323/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNGV5aUhREAE",
            "reviewer_name": "Kim Vargas",
            "rating": 5,
            "review_text": "The nicest and cleanest fish store that I have been. The fish and other stiff are not expensive too. Nice staff too. I bought a guppy here. And the next day the guppy that I bought from them died ( so I thought it was my fault ) the following day I went to this store again. Checkinh i they still have the same guppy that I bought. To my surprise the lady told me they all died too. So I told her the one that I bought died too. And then she told me that I could choose a guppy again and shell gonna give it free.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:14:26.629526",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117949083237521317734/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNTZYRHpRRRAB",
            "reviewer_name": "W Y",
            "rating": 5,
            "review_text": "Great selection of fish, shrimps, aquatic plants, accessories and equipment. Very knowledgeable and helpful staff.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:26.631621",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 55,
            "total_number_of_photos_by_reviewer": 324,
            "reviewer_url": "https://www.google.com/maps/contrib/111818374087985911235/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPb196Y1RBEAE",
            "reviewer_name": "Jessica Willens",
            "rating": 5,
            "review_text": "Great selection of freshwater fish",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:26.633936",
            "response_from_owner_text": "Hi Jessica, Thanks for leaving a 5 star review and some great photos!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:26.633936",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 225,
            "total_number_of_photos_by_reviewer": 1615,
            "reviewer_url": "https://www.google.com/maps/contrib/109716470805171574844/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheHR6YzZnRRAB",
            "reviewer_name": "Grumpy Walrus",
            "rating": 5,
            "review_text": "Great Store. I bought some Marine Shrimp there that I am very happy with! They are healthy and were well cared for inside the store. I was helped by two very knowledgeable employees Jen & CJ who were more then happy to spend all the time with me that I needed to have all my questions answered, and the Shrimp were bagged as I selected them. That visit was great experience overall and I will for sure be returning to the shop!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:26.636471",
            "response_from_owner_text": "Hi Grumpy Walrus, Thanks so much for leaving a detailed 5 star review.  Jen and CJ will be really happy to see this!  Seems to me you are a Happy Walrus instead of a grumpy one.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:26.636471",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117955062337469830283/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLVpHeHh3RRAB",
            "reviewer_name": "Matthew Murray",
            "rating": 5,
            "review_text": "Aquariums West is a great aquarium store! They have a wide selection and helpful staff. Weve bought all of our fish, shrimp, snails, and plants here.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:27.256480",
            "response_from_owner_text": "Hi Matthew, Thanks so much for taking the time to leave us a 5 star review.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:27.256480",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 47,
            "total_number_of_photos_by_reviewer": 19,
            "reviewer_url": "https://www.google.com/maps/contrib/103651390466494708435/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNW9HUkF3EAE",
            "reviewer_name": "Alexia Joseph",
            "rating": 5,
            "review_text": "line ups were long. Waited 45 min to get in so I recommend planning your trip around a 45 min wait so you are prepared. Staff was really helpful and kind.( Really sexy guys that work there , so, ladies that was a plus +++ tattooed guy was very sexy ;) made my wait worth my while LOL ). But really, very beautiful layout and very good prices. I recommend this store to anyone in the lower mainland  who is in the hobby of starting out, you  must go here.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:27.259979",
            "response_from_owner_text": "Hi Alexia, Thanks so much for your very positive review and so sorry about the wait, not too much we can do about that.  Glad you liked the eye candy!!  The tattooed guy will love this review!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:27.259979",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108441990508434755360/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMGVPaWFBEAE",
            "reviewer_name": "Fraser Parlane",
            "rating": 5,
            "review_text": "The staff here are fantastic and helpful.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:27.262686",
            "response_from_owner_text": "Hi Fraser, Thanks for your 5 star review.  Your review gives such a boost to the staff!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:27.262686",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 66,
            "total_number_of_photos_by_reviewer": 74,
            "reviewer_url": "https://www.google.com/maps/contrib/104515066838738606696/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxM3NDTndBRRAB",
            "reviewer_name": "Adrian Lee",
            "rating": 5,
            "review_text": "Lovely aquarium and pet store just outside BC Place in Vancouver. Its located in the basement, but the store is well stocked and the staff were super helpful and willing to help educate. Focused more on aquatic life and pets, but theres a small section for other pets as well.  The tanks are all very clean and were happy with the fish recommended and purchase there. Parking is on the street and a bit of a challenge, be prepared to walk a block or two.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:27.265773",
            "response_from_owner_text": "Thank you Adrian for your lovely review and it is so nice to acknowledge the staff.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:27.265773",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 257,
            "total_number_of_photos_by_reviewer": 724,
            "reviewer_url": "https://www.google.com/maps/contrib/108512112307202223024/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcE9TX25BRRAB",
            "reviewer_name": "cj brabant",
            "rating": 5,
            "review_text": "Aquariums West is pretty outstanding. My experience with them is limited to buying live stock and asking for advice, a lot of advice. I cant count the number of times Ive been in the store where... well, really every person working (esp. Alex) is willing to take the time to listen and help you. The coolest part though, and why I truly give them 5 stars is when I call. Often, I have a simple question, other times I have a pretty complex one dealing with a specific fish. No matter the case, they have taken the time to talk and listen, and then lead me in the right direction. I really am thankful that stores like this exist and how passionate they are. (Yes, Google helps too but often its conflicting info and its nice to have someone help you sort all that out.)",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:14:27.268402",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 28,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/114199293023618200964/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cmJQRmF3EAE",
            "reviewer_name": "Kevin C",
            "rating": 5,
            "review_text": "Ordered some living plants online and very satisfied. Those living plants arrived on time, healthy, and were well wrapped and protected inside a box. Also the shipping cost was partially refunded (automatically) to reflect the real cost. Definitely will order more.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:27.270713",
            "response_from_owner_text": "Hi Kevin,  We really appreciate you leaving us a 5 star review.  Thanks for the synopsis of your experience.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:27.270713",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107389145921756522116/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cnEyQmJREAE",
            "reviewer_name": "Rowan",
            "rating": 5,
            "review_text": "Aquariums West is always my go to place whenever Im downtown. They have everything you could ever need for Aquarium hobbyists and terrarium critters alike. The service is excellent and the prices are reasonable. Their displays are stunning and very well kept. Love you guys!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:27.273381",
            "response_from_owner_text": "Hi Rowan, Thanks so much for leaving such a nice review.  We really appreciate you noticing our stunning (as you put it) displays!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:27.273381",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 29,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/100748488560528045143/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNXRXX1F3EAE",
            "reviewer_name": "Nikita S",
            "rating": 5,
            "review_text": "My first visit, stopped in quickly to buy a betta. There were lots of options, and the staff person was super helpful and knowledgeable. Good covid safety measures in place as well. Would definitely visit again for any aquarium/fish needs!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:27.276150",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112122088444183211965/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbFB6M0VnEAE",
            "reviewer_name": "G A",
            "rating": 5,
            "review_text": "Have been buying all my tropical fish and a majority of the food & accessories from this store for 20 + years. They are always helpful and found them very knowledgeable about supplies and fish. Have followed them around to three different locations. I know travel from Surrey to Vancouver for my aquarium needs.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:27.278422",
            "response_from_owner_text": "Hi Glenn, Wow!  Thanks for being a customer for 20+ years and following us to our different locations.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:27.278422",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 59,
            "total_number_of_photos_by_reviewer": 94,
            "reviewer_url": "https://www.google.com/maps/contrib/111180476811735282054/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJekl1Y3ZnRRAB",
            "reviewer_name": "Jordyn  Siferra 89  Chan",
            "rating": 5,
            "review_text": "Just started keeping cherry shrimp and I noticed that they were dying off at a fast rate. The person who gave me the shrimp told me to go to this store and I did. I was helped by three different staff members, all of whom were super friendly and laid back, not to mention able to answer all of my questions. They tested a sample of my aquariums water that I brought in and told me what I needed to address the water issues without  being insistent or pushy. Prices are what youd expect for a specialty store, but to me its definitely worth it for the service and expertise I get here.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:27.280849",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/115424909629116716841/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNjlQY3BnRRAB",
            "reviewer_name": "Shivani Meher",
            "rating": 5,
            "review_text": "This is our go-to fish store. The staff working at this location is friendly, kind and knowledgeable. You can call them and ask about their fish inventory before visiting the store to make sure they have the fish you are looking for. Wide range of fish food and plants are also available at this location.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:27.887398",
            "response_from_owner_text": "Thanks Shivani for recognizing the friendly staff.  We appreciate you taking the time to review the store.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:27.887398",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 46,
            "total_number_of_photos_by_reviewer": 96,
            "reviewer_url": "https://www.google.com/maps/contrib/109669363245570235339/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxLUlPM3hnRRAB",
            "reviewer_name": "J Smith",
            "rating": 5,
            "review_text": "I have been shopping at Aquariums West for years now, and they are my go to store. I have always found the employees to be friendly, and accommodating and will do everything they can to help. I have never had a bad experience at this store, I will continue shopping there for my aquarium and reptile needs. I also appreciate that they have taken COVID seriously and keep capacity down, and require masks, one of the best retailers I have been to in regards to their COVID protocols.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:27.890588",
            "response_from_owner_text": "Hi Justin, Thanks for taking the time to post a great review and your mention of our Covid protocols.  We appreciate your appreciation!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:27.890588",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/110286845051495771638/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNXFtWHB3RRAB",
            "reviewer_name": "Dan Clunn",
            "rating": 5,
            "review_text": "Great staff, very friendly and knowledgeable! My wife is really into fish tanks and this place has been amazing at helping her find the right stuff to get started. They take covid protocols very seriously which is something I really appreciate. I drive all the way out from Maple Ridge to shop here, thats how good they are!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:27.893559",
            "response_from_owner_text": "Hi Dan, We really appreciate you appreciating our Covid protocols. I hope you too are getting into fish tanks along with your wife.  Thanks so much for the 5 star review.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:27.893559",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 80,
            "total_number_of_photos_by_reviewer": 26,
            "reviewer_url": "https://www.google.com/maps/contrib/109159051636542077595/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvN19IblBREAE",
            "reviewer_name": "Mike Adamski",
            "rating": 5,
            "review_text": "Pricey (it is downtown after all), but very elegant displays, and great and healthy livestock. The have a new up and running saltwater fish and coral section which is looking really good as well. Good stock of dry goods, tanks, equipment, etc. Staff are friendly and knowledgeable, especially when it comes to freshwater fish. They stock a few reptiles as well, like frogs, geckos, snakes. All look to be in good condition!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:27.896656",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 135,
            "total_number_of_photos_by_reviewer": 20,
            "reviewer_url": "https://www.google.com/maps/contrib/111489120133826295574/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeWVEWVVnEAE",
            "reviewer_name": "Amber Sinclair",
            "rating": 5,
            "review_text": "The place was a little hard to find but once I did the staff was super helpful. Very friendly and accommodating. They had some beautiful fish in there and some nice reptile set ups.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:27.899109",
            "response_from_owner_text": "Hi Amber, So glad that you found us!  Thanks for leaving a 5 star review!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:27.899109",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 45,
            "total_number_of_photos_by_reviewer": 12,
            "reviewer_url": "https://www.google.com/maps/contrib/110321041673339145203/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXJuSU9REAE",
            "reviewer_name": "Eli Dunham-Jasich",
            "rating": 5,
            "review_text": "Have been coming here for years ever since I started keeping planted tanks---staff are all very friendly and have never done me wrong with advice that doesnt hold up.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:14:27.902019",
            "response_from_owner_text": "Hi Eli, So happy we havent done you wrong with our advice.  We appreciate you taking the time to leave us 5 stars!",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 01:14:27.902019",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109274831033781351904/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5d2MzX2ZREAE",
            "reviewer_name": "Fantsy Pants",
            "rating": 5,
            "review_text": "I love coming here! Great experience, friendly and knowledgeable staff that offer help but also give you space to look around. I love my cherry shrimps and guppy fish! Go during the week if you are able to when it is not as busy and no lineups :)",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:27.904563",
            "response_from_owner_text": "Hi Fantsy Pants, We really appreciate you taking the time to give us a 5 star review.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:27.904563",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111024269906840968848/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbWVmODVnRRAB",
            "reviewer_name": "Shane Golden",
            "rating": 5,
            "review_text": "Super helpful staff. Vancouvers best local fish store. I regularly shop at different fish stores online and brick/mortar and the cleanliness of the livestock at Aquariums West is next to none. Ive never had a single pest on any of the dozens of fish / coral Ive purchased. All my livestock go through strict quarantine procedures and I document as much as I can to help other people in the hobby.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:14:27.906962",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 61,
            "total_number_of_photos_by_reviewer": 172,
            "reviewer_url": "https://www.google.com/maps/contrib/111680659836093005365/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJN3R6YWd3RRAB",
            "reviewer_name": "Alexis S",
            "rating": 5,
            "review_text": "Picked up 3 rats here, staff were accommodating and very helpful and knowledgeable. Because of my situation I needed to pick out the rats one day and pick them up the next day, no other store was able to accommodate this but they had no problem with it. The animals all look well cared for here",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 01:14:27.909168",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 162,
            "total_number_of_photos_by_reviewer": 391,
            "reviewer_url": "https://www.google.com/maps/contrib/114711671552164561006/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyaEpfbk9nEAE",
            "reviewer_name": "Dana Lam",
            "rating": 5,
            "review_text": "I wish I lived in Vancouver because I went here yesterday and felt sad that I wouldnt be able to come here often. Very beautiful tanks. The guppy and mollies looked really good. Might consider a road trip to pick up some plants and fish",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:27.911476",
            "response_from_owner_text": "Hi Dana, Thanks for leaving us a 5 star review.  We do ship live Tropica plants and dry goods all across Canada.  You can check out the website www.aquariumswest.com New plants arrive every Tuesday afternoon.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:27.911476",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115605758168960982448/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRckpiMEVnEAE",
            "reviewer_name": "Canadian Maple",
            "rating": 5,
            "review_text": "I was so impressed by this store - the animals are in great setups, well taken care of, and appropriately fed. Youll be hard pressed to find healthier amphibians/reptiles/fish at another store! I would recommend Aquariums West to anyone looking for healthy plants, animals, or equipment. The staff are also extremely personable, friendly, and knowledgeable. There isnt a bad thing I have to say about this place.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-22 01:14:28.517389",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106260853903486346974/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aDlxYlFBEAE",
            "reviewer_name": "JC",
            "rating": 5,
            "review_text": "Huge space Especially being located in a downtown Freshwater and saltwater is available here. Huge selection of filter, tanks and others. The fish looks pretty and healthy I bought swordtails here.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:28.520390",
            "response_from_owner_text": "Hello JC, Thank you for your review. We try to get new livestock every week to make it interesting. Hope your swordtails are doing well.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:28.520390",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 253,
            "total_number_of_photos_by_reviewer": 45,
            "reviewer_url": "https://www.google.com/maps/contrib/101835525760441939149/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlME03MWJ3EAE",
            "reviewer_name": "Leopoldo C. Angel Casillas",
            "rating": 5,
            "review_text": "The place is great, they have a good variety of products and theyre very friendly, I have to clarify that the only thing is that some stuff are a bit over priced, maybe the location     besides that is a good place to find anything you need for your pets!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:28.523669",
            "response_from_owner_text": "Hello Leopoldo, Thanks for taking the time to leave us a review. We are always looking at our prices to stay competitive, even when our prices are changing weekly from our suppliers. Hope to see you again soon!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:28.523669",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 38,
            "reviewer_url": "https://www.google.com/maps/contrib/103676742342863762873/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcm9paDZnRRAB",
            "reviewer_name": "Lee Parks",
            "rating": 5,
            "review_text": "Aquariums West is a fantastic consumer experience.The store is respectfully laid out and equally respectful are their staff and management.It doesnt matter if youre in the store or on the phone, they give you their utmost attention.Im  more or less a little house bound and these people go out of their way to appease my every aquatic need in always having my orders ready for pickup telling me their opinions on what is good or not for my aquarium.Their Plant stock is amazing and quality of fish selection as well, they also have most of your needs for the aquarium experience.OH did I mention just how beautiful these peoples spirits are?Give it a shot ...youll love it as much as I do. Splish splash enjoy your summer",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:28.527068",
            "response_from_owner_text": "Hi Lee, You are so amazing!  Thanks for leaving such a fabulous review.  All the staff love helping you!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:28.527068",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117350927122075545535/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVNklMQ3lnRRAB",
            "reviewer_name": "Jack Bondy",
            "rating": 5,
            "review_text": "Best place to go for purchasing fish, plants, and supplies. I have purchased multiple plants, shrimp and x-ray Tetras that were in excellent health, so good in fact that I now have multiple xray fry swimming in my tank. Significant difference in quality compared to larger department stores. They have a vast variety of fish available and often have new types in stock. The store can get quite busy and at times it can be difficult to get an employees attention but it is worth the wait due to their knowledge in aquarium keeping.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:28.529794",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/105871426525894470942/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMHRqVDBRRRAB",
            "reviewer_name": "L G",
            "rating": 5,
            "review_text": "Was in today to get a setup for a fluval Betta tank. As always there was fantastic customer service and they saw to any questions and requests I had.   An extra star for this great shop :)",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:28.532192",
            "response_from_owner_text": "Hi LG, We really appreciate you leaving us a 5 star review.  I hope you love your new Betta tank!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:28.532192",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104515882638300079676/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3a3N2V0lREAE",
            "reviewer_name": "Dory B",
            "rating": 5,
            "review_text": "I have been a customer now for 8 months and have been treated very well by ALL staff.  I do not find the owner rude in the least as others have (rudely) stated, but rather perhaps a bit shy.  She seemingly loves her business and I have found that she really tries her best to make my experience a positive one. If the prices are higher, so be it.  Rent in this area is super high and everyone needs to make a living.  I dont mind paying a bit extra for the service and time that each and every staff member patiently takes with me.  I support LOCAL business over chains.  Any time I have had issues with any products, they have also been very understanding. I have had a very positive experience that keeps me coming back and would not hesitate to recommend this store to friends.",
            "published_at": "10 years ago",
            "published_at_date": "2013-11-22 01:14:28.535150",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108388400332660825520/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeU0yRzZnRRAB",
            "reviewer_name": "C M",
            "rating": 5,
            "review_text": "One of my favourite local pet stores. A must for any aquarium hobbyist. They have a wide range of great products from hard scapes, equipment, etc. Fish selection has been a bit lack luster the last 3-4 times Ive stopped by but regardless the staff are very knowledgeable and friendly. Best planted display tanks locally. Walking in here always keeps me inspired.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 01:14:28.537408",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101985377916671932220/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dTVyR2pnRRAB",
            "reviewer_name": "bluemartian9",
            "rating": 5,
            "review_text": "Absolutely the best LFS in the city. Wide selection of tanks and livestock, both fresh and saltwater. Id like to add that its almost impossible to find reefing supplies in this city, but they have them here. A selection of coral and saltwater fish, as well as a tank dedicated for selling some wicked live rock. (Mine came with a snail and a couple starfish). Staff are terrific and knowledgeable. I came in a couple days later after my setup for help with a noisy pump. I had sediment in it, and seeing I was in a hurry and that I didnt know what I was doing they cleaned it for me real quick. Showed me what I needed every step of the way. They have a few REALLY well established and beautiful reef tanks for display. That way you can feel confident they know what theyre doing.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 01:14:28.539561",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106720273126788507807/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcjREaExBEAE",
            "reviewer_name": "Maggie Tsai",
            "rating": 5,
            "review_text": "Great place to get all kinds of fish and fish supplies. They have both freshwater and saltwater. There are also small animals and reptiles available, although their main focus is fish. They definitely offer a bigger variety than big box pet stores. Sometimes it is difficult to buy the fish I am looking for, as the store is so popular. Their prices tend to be a bit on the high side, but offer deals if you buy more fish, which evens out the cost. The staff are quite knowledgable and helpful. They have no parking lot, so you have to park on the street. Finally, you should definitely check out some of their setups. They are quite beautifully aquascaped and clearly done by someone who knows what theyre doing.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:28.541690",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 32,
            "total_number_of_photos_by_reviewer": 67,
            "reviewer_url": "https://www.google.com/maps/contrib/113211631842676048541/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMk1maDRBRRAB",
            "reviewer_name": "Arash Tabarestani",
            "rating": 5,
            "review_text": "Very friendly and knowledgeable staff, nice collection of fish and aquariums, Jeannie the owner is very knowledgeable and nice, you will get the best customer support experience here, I got my first saltwater tank here , the light ballast burned after few months and I was very upset , I went to the store and told them what happened, Jeannie contacted the vendor and got a replacement for me super fast. Highly recommended",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 01:14:29.157012",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 41,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110103233266290481528/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeXAyREdREAE",
            "reviewer_name": "Andrew W",
            "rating": 5,
            "review_text": "Nice place to look for new fish and aquarium equipment. It s expensive but they always have the best quality products to buy to care for your fish. The fish they have in stock are really nice looking and healthy too. Very clean and well maintained store. Staff are knowledgeable too.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-22 01:14:29.160001",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112175935714087592340/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bXItV1dnEAE",
            "reviewer_name": "Cory Dueck",
            "rating": 5,
            "review_text": "Almost as soon as I placed my order I received confirmation that my hard to find aquarium mosses had been shipped! It arrived the very next day, expertly packaged with obvious care. I have been looking online for months without success and here I could have had it in a matter of 24 hrs if I had first checked with Aquariums West!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:14:29.163158",
            "response_from_owner_text": "Hi Cory, You are a dream customer!  Thank you so much for leaving a 5 star review.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:14:29.163158",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104518289267398057391/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdzY3aXpRRRAB",
            "reviewer_name": "Clayton Tomanek",
            "rating": 5,
            "review_text": "These people know there aquarium stuff. Nice guys to talk to and the only place my son or I will deal with. Beautifully looked after tanks in store, not a run of the mill bunch of species and how much they can sell you. Quality, definitely recommend.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:29.166505",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108307451915005381069/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwekk3aVV3EAE",
            "reviewer_name": "H",
            "rating": 5,
            "review_text": "Extremely good customer service! You guys should have a tip option in the paying machine, those were the best employees Ive seen so far. Many thanks to the tall guy that has an aquarium immitating the current of a river in his home. He guide me through the whole process of buying my first aquarium",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:14:29.169090",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/101461486612344938227/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeG92eWRREAE",
            "reviewer_name": "Carlos Escobar",
            "rating": 5,
            "review_text": "Wide variety of supplies and knowledgeable staff",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:14:29.171788",
            "response_from_owner_text": "Hi Carlos, We always love to hear that you have found the staff to be knowledgeable!  Thanks for the 5 stars.",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:14:29.171788",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116902579044001090220/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzaGRIdW13RRAB",
            "reviewer_name": "E A",
            "rating": 5,
            "review_text": "Best pet store Ive shopped at. Amazing staff, very knowledgeable, and really know how to look after fish. I bought a lot of supplies from them and they were honest and even told me what I wouldnt need (i.e. they werent just pushing to make money). They actually care about the customers and the fish. And their aquascapes are incredible.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:14:29.174591",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101471229100146972305/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyX05qOURREAE",
            "reviewer_name": "griffin pope",
            "rating": 5,
            "review_text": "I love this place! I go at least once every week. Very clean store, they carry lots of hardscape and plants, and the staff are very informative.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:14:29.176767",
            "response_from_owner_text": "Hi Griffin, thanks for loving the store and leaving a 5 star review. Love your name.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:14:29.176767",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100765472705001665655/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMHBfeFZ3EAE",
            "reviewer_name": "Adam Bailey",
            "rating": 5,
            "review_text": "By FAR the best place to go! Whether your are new to the fish hobby or have been in it for a while. Staff are amazing always there to help you and so knowledgeable. Any time I have an issue with my tank I call them up and they get me sorted me out. I have been to almost every other store in the lower mainland and nothing comes close to Aquariums West.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-22 01:14:29.179488",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116318323032065846496/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaWJUbWhBRRAB",
            "reviewer_name": "Fishby",
            "rating": 5,
            "review_text": "Always a fun place to go to no matter how many times Ive been there. The staff are very informative and kind to customers. Wide range of animals both rare and common that have a range in difficulty keeping. The fish are a bit pricey but the service makes up for it.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:14:29.181740",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/106074266728386293336/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}