{
    "place_id": "ChIJu6VAq8ZzhlQR04WRjQzdZ_A",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdzZyc2x3RRAB",
            "reviewer_name": "toffy concepcion",
            "rating": 5,
            "review_text": "This is an indigenous owned restaurant with traditional indigenous inspired food. It is Michelin listed. The service is wonderful they accommodated us just at closing time and theyre really friendly and share books about the tragic history of Canadian First Nations. Its poignant reading about the owners personal experience while reading through the menu. We ordered the upgrade to turn a main course into a 3 course meal. The first thing that hits you, literally in the gut, is how heavy the bannock is. Its so heavy and filling it could be a meal on its own. About the size of a large dinner roll with the weight of 7 of them. But it was surprisingly soft, natural tasting and great with butter. There was a beef and celery soup with so much shredded meat and celery it could have been a stew. Dipping bannock in it was great. We also had mushrooms and gravy on another large bannock. This was so good. The highlight was rubbed grilled salmon on wild rice. This was exceptional and we didnt finish it so we could share it with our daughter. Ice cream with berries was an excellent close. Let me not forget to mention 2 indigenous beers a vanilla porter that reminds you of a dark English beer and a Saskatoon berry that reminds you of a sour lager.",
            "published_at": "5 days ago",
            "published_at_date": "2023-11-26 02:08:36.183367",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 412,
            "total_number_of_photos_by_reviewer": 2433,
            "reviewer_url": "https://www.google.com/maps/contrib/114933547240385128551/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ0tLMHpnRRAB",
            "reviewer_name": "Foodie Vancouver",
            "rating": 5,
            "review_text": "The service we experienced was genuinely warm and hospitable, creating a positive atmosphere throughout our dining experience. The waitress who attended to us went above and beyond by offering comprehensive explanations of the menu items, which added a layer of understanding and appreciation to our choices. Among the various dishes we sampled, the preparation of both the salmon and the meat options showcased a commendable level of skill and attention to detail. The salmon was expertly cooked to retain its moisture and flavor, while the meat dishes displayed a balance of tenderness and succulence, indicating a dedication to culinary craftsmanship. A noteworthy mention goes to the cedar jelly, an item that piqued our curiosity. Upon tasting it, we were pleasantly surprised by its distinctive and unparalleled flavor profile. The novelty of the cedar jelly adds a sense of adventure to the dining experience, making it a must-try for those open to exploring unique tastes. In summary, the warm and informative service, coupled with the skillful preparation of dishes like salmon and meat, provided a satisfying dining experience. For those seeking an intriguing and distinctive flavor encounter, the cedar jelly stands as a testament to the innovative offerings of the establishment.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:08:36.187001",
            "response_from_owner_text": "Thank you for the review!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:36.187001",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 146,
            "total_number_of_photos_by_reviewer": 619,
            "reviewer_url": "https://www.google.com/maps/contrib/106886474788291212647/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa09QS3J3RRAB",
            "reviewer_name": "William Lin",
            "rating": 5,
            "review_text": "If you Google Salmon Restaurant Vancouver you will surely be recommended to come here. I love the storytelling about the indigenous background, as well as the dining experience. Small Restaurant, so booking online is a must. The waitress recommended the Salmon Sampler and we also ordered the Fish & Rice Wild Sockeye and also the Mushroom Risotto. The kids really loved the Game Sausage Dinner - Elk. The flavours are so unique, it was amazing.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:36.190488",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 519,
            "total_number_of_photos_by_reviewer": 3311,
            "reviewer_url": "https://www.google.com/maps/contrib/100537437524494981031/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab2VuZDNnRRAB",
            "reviewer_name": "Dana Sullivan",
            "rating": 5,
            "review_text": "Im not the first to say this, but I definitely recommend making a reservation because the place is so small. A friend and I wanted to try but werent sure on the timing of when wed be ready and so didnt make a reservation for Sunday, and we got really lucky - we called ahead and first they said they had room on the patio only, but then shortly after we arrived theyd had a cancellation so we did get a table inside. During the few minutes we were on the patio, though, they wanted to make sure we were comfortable and brought me a blanket since I was cold. But it was nice to sit inside to see all the art they have up. To warm up, I got a wild rice tea (which is a caffeine-free infusion, not technically a tea), which was surprisingly rich-tasting. If you like genmaicha, this was a similar idea without the tea. For my meal, I had their vegetarian risotto, which rotates and was butternut squash on that day. My meal included a piece of bannock which they brought out first, which was like a cross between a dinner roll and rich biscuit and very good. Sometimes I find risotto boring, but this one was fantastic, with the rich earthy flavours of the risotto complimented by the seasoned roasted vegetables it was topped with. My friend was a fan of her salmon burger too, and said the bannock as a bun made it interesting and different. I tried one of her sweet potato fries and really liked it - more interesting than regular fries for sure. To finish, we ordered a blueberry bread pudding. I really like bread pudding but my friend had never tried it, but we both enjoyed it! The texture of the bannock in bread pudding was a little different but worked well! My meal came to $57 after tip and tax, but it was well worth it for the nice experience I had (and I left full), and I would definitely recommend this restaurant to both foodies and people looking to get a taste of Indigenous culture.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:36.192990",
            "response_from_owner_text": "Thanks for the detailed review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:36.192990",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 463,
            "total_number_of_photos_by_reviewer": 878,
            "reviewer_url": "https://www.google.com/maps/contrib/100301382381587630782/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKc2MybnR3RRAB",
            "reviewer_name": "Cindy Shelberg",
            "rating": 5,
            "review_text": "Our first meal in Vancouver BC was memorable and delicious. We started with salmon 3 ways and fell in love with all of the various flavors. Next up was the Bison Pot Roast and Sockeye Fish & Rice entrees . Both were delightful and tasty. Bannock and the jelly were so good!  Service was pleasant and cheerful. Highly recommend this restaurant.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:36.196337",
            "response_from_owner_text": "Thanks!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:36.196337",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 36,
            "total_number_of_photos_by_reviewer": 69,
            "reviewer_url": "https://www.google.com/maps/contrib/111505530762779629826/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcFBLbGl3RRAB",
            "reviewer_name": "K2 Holiday",
            "rating": 5,
            "review_text": "Wow! This place is truly a gem!! We loved everything about the Bistro! The atmosphere was beautiful, the service was great considering how busy the restaurant was. The food! Honestly speechless of the presentation and of course the taste! Each plate was mesmerizing and beautifully done! 10/10!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:36.199201",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 22,
            "reviewer_url": "https://www.google.com/maps/contrib/113811484033653321690/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNzhiQXh3RRAB",
            "reviewer_name": "Lauren Domb",
            "rating": 5,
            "review_text": "The quality of food is excellent and the prices are reasonable too. We really enjoyed hearing the introduction from Crystal and Brigitte was really warm and funny. Such a fantastic meal and would highly recommend. Photos: salmon sampler, bannock and butter, bison pot roast and smoked sablefish. Everything was so delicious!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:08:36.202131",
            "response_from_owner_text": "Thank you for the review!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:36.202131",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/102158874863908977812/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMC0zZmJ3EAE",
            "reviewer_name": "Shan",
            "rating": 5,
            "review_text": "Came here after lunch at Granville Island Public Market, because we were keen to try some indigenous cuisine during our short stay in Canada. We were not left disappointed and rather wished we had extra room to try more of Salmon n Bannock s offerings. The bison bone marrow was just exquisite and paired so well with their bannock crackers. They have a rotating game sausage - we had the elk red wine (appetizer portion) which was very tasty as was the sage blueberries it came with. Their traditional bannock was also very good. Popular with the locals, I would also recommend it to visitors with an interest in trying indigenous cuisine within reach of downtown Vancouver.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:08:36.205040",
            "response_from_owner_text": "Thank you for the excellent and thorough review, Shan! We hope youll visit us again!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-06-01 02:08:36.205040",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 45,
            "total_number_of_photos_by_reviewer": 120,
            "reviewer_url": "https://www.google.com/maps/contrib/116505576418673206207/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM3NUWlZ3EAE",
            "reviewer_name": "Jaela Rogers",
            "rating": 5,
            "review_text": "You need to eat here. Food was some of the best I ve tried in Vancouver. Beautiful indigenous art with great service. We will be coming back for sure. Try the smoke sablefish and bison pot roast!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:36.207497",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/104310844292949317505/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSX2F2Y1RREAE",
            "reviewer_name": "Chris Charles",
            "rating": 5,
            "review_text": "Fantastic fantastic fantastic place!! Extremely unique Indigenous cuisine in Vancouver.  The bison pot roast was simply melt-in-your-mouth morsels of delicious 24 hour-cooked meaty love, nestled in between a beautiful mash, seasonal veg, and gravy. Huge portion size   you won t be hungry and you can t go wrong. I VERY HIGHLY recommend this for a main.  My partner got the elk steak & shrimp special with mash and seasonal veggies, which was also fantastic.  Loved the buttery grilled shrimp; the elk steak was tender, delicious, well seasoned, amazing!   With a 3-salmon sampler appetizer you ll leave stuffed to the brim.   Service was wonderful and I think the female server picked us both up ;).  (Joke!).  Quite a few business dinners go here.  This place is just great great great.  Making a reservation is smart; it s a small intimate space and is always full.  Will be back for sure.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:08:36.209764",
            "response_from_owner_text": "You certainly have a way with words, Chris! Thanks for such a descriptive review of your experience! We love it!",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-05-01 02:08:36.209764",
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 60,
            "total_number_of_photos_by_reviewer": 351,
            "reviewer_url": "https://www.google.com/maps/contrib/104659270262531903760/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaHF1UTZBRRAB",
            "reviewer_name": "Eric Muellejans",
            "rating": 5,
            "review_text": "Been a long time since I have been to a place that hits the triple crown for dining 1. Food 2. Ambiance 3. Host & staff Every dish that came out was incredible! The samples are a must and the bannock is crispy, thick yet light and us ordering more. We had to beg the waitress to bring the menu back for another round. Blueberries were incredible! Sage came out often and stole the show. Then each cut of meat was so well done and respected! The wine and beer selection was great! Dreamcatcher wine and the Honey lager - knocked our socks off. The ambiance has a host of art and they have beautiful plastic dividers with indigenous Salmon art engravings (I believe from the Nuxalk Nation)! Music is great with all indigenous artists some  Tribe Called Red  mixed in too. Inez is an incredible hostess and story teller! She takes on not only the role of an owner but someone who advocates for indigenous cuisine from coast to coast. An entrepreneur, an educator and an inspiration - truly an incredible individual. Her staff were incredibly knowledgeable and enthusiastic with all the food and were a delight to chat with! I will be back and then come back again and probably come back for dessert. Easily some of the best food I have had in Canada. Stutwiintulhcw ula knicilh ats ( thank you for the food  in Nuxalk spoken by the Nuxalk people) What we ordered - salmon & game meat sampler - Mushroom bannock - Bannock & jam & butter - Bison marrow - Salmon and Rice - Cream Brulee (with Sage - must order)",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:08:36.998149",
            "response_from_owner_text": "Wowza ! Thank you for your visit .. It was awesome chatting and thank you for taking the time to review us  & special thank you for the Nuxalk words So very kind and thoughtful..",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-07-01 02:08:36.998149",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/105520215288016586162/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbnFfRV9RRRAB",
            "reviewer_name": "Vyan Vu",
            "rating": 5,
            "review_text": "Had a wonderful time here! The service was very quick and our waitress was amazing. We got the toasted mushroom on bannock for an appetizer, salmon n rice and bison pot roast for mains - all of which were so flavourful paired with the best veggies! For drinks; the blackcherry cider was to die for and the haywire beer was also amazing! I would recommend!!! It was a little busy by 6 (on a tuesday!) so book a reservation if you can",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:08:37.000701",
            "response_from_owner_text": "Thanks for the 5-star review! Were so glad to hear you had a wonderful time, we do our best to give our guest an incredible and homey experience!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-06-01 02:08:37.000701",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 237,
            "total_number_of_photos_by_reviewer": 401,
            "reviewer_url": "https://www.google.com/maps/contrib/100574308430721345103/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaEliMDR3RRAB",
            "reviewer_name": "Mehul Vora",
            "rating": 5,
            "review_text": "Youre in Canada and you want a (modern) taste of indigenous First Nations cuisine ? You do not miss Salmon n Bannock. The food is just amazing !!! The Bannock (comes with every main) is wonderful - fluffy with a crust and comes out steaming. We mainly gorged ourselves on the appetizers: 1. Pemmicon mousse - delicious , berry flavoured goodness. 2. Salmon 3 ways - that ceviche and smoked salmon mousse were out of this world ! 3. Mushrooms on bannock with bison gravy - my personal favourite. The shrooms were really tasty, there was a variety and the gravy on the Bannock was amazing. 4. Game sampler - elk carpaccio (wow !!), Elk salami and venison pate (creamy and gamey!). 5. Sablefish (Mains) - I didnt eat this but those who did were raving about it and the sauce. There was also a cedar jelly that blew my mind (I bought two jars). Its a little expensive but worth every penny. I will 100% be back. Parking: On top of the Toys-R-Us (Diamond parking) Kid-friendliness: Not very kid friendly. Too constrained and only had one high-chair which was much too large for our 8 month old",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:37.002432",
            "response_from_owner_text": "Thank you for the review!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:37.002432",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 618,
            "total_number_of_photos_by_reviewer": 1122,
            "reviewer_url": "https://www.google.com/maps/contrib/104166147466347028623/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURac3VfakVREAE",
            "reviewer_name": "N",
            "rating": 5,
            "review_text": "Fantastic food, drink and service! The ambiance is excellent   I saw beautiful indigenous art there as well! I tried salmon sampler, Mushrooms on Toasted Bannock, Bison Bone Marrow. For the main, I tried Bison Pot Roast, Smoked Sablefish, Fiss n Rice and elk steak! Parking: Its behind this building",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:37.004901",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 17,
            "reviewer_url": "https://www.google.com/maps/contrib/117625788401949453713/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwai12YkdBEAE",
            "reviewer_name": "Angela Luo",
            "rating": 5,
            "review_text": "I loved popping in to this Indigenous-owned gem of a restaurant for a late lunch/early supper. The sweetgrass hand sanitizer was a nice touch, also enjoyed flipping through the autobiographical picture book created by the owner that shared some of her story figuring out her identity as a sixties scoop kid. I liked the bannock with cedar jelly to start. Salmon and rice was both healthy and delicious, and the cocktail I had also hit the spot.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:08:37.006683",
            "response_from_owner_text": "Thanks for the review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:37.006683",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/116438194582995934741/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dmQ3QVlBEAE",
            "reviewer_name": "Cecilia Wang",
            "rating": 5,
            "review_text": "Feeling grateful that I got to dine at an indigenous restaurant in Canada / Turtle Island. I walked in after an appointment nearby and managed to get a table. To be honest I ve never spent so much money on one meal by myself before, but so worth it. I had the salmon and wild rice, and a bison soup. The cedar jam served with bread was so tasty. The service was stellar.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:08:37.008503",
            "response_from_owner_text": "Thanks Cecilia!",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-07-01 02:08:37.008503",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 14,
            "reviewer_url": "https://www.google.com/maps/contrib/113857374409214328297/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwZ2NYb1hREAE",
            "reviewer_name": "Regina Fugat",
            "rating": 5,
            "review_text": "As visitors to Vancouver, we were very keen to learn about Canadas indiginous cultures, and I did a little research on where to eat wild salmon; Salmon nBamnock came up as a top recommendation. Promptly, we made a reservation and scored a table. The place is small and intimate. This restaurant especializes in the traditional cuisine of Canada, and they primarily serve foods based on a mixture of wild game, foraged foods, and farmed produce. I learned that each region of Canada has its own First Nations and Inuit people and they use their local resources,  and unique food preparation techniques. Salmon n  Bannock showcases First Nations cuisine using fresh and certified organic ingredients. We were told the staff are members of the Nupalk, Haida Gwaii, Blackfoot, and Wet suwet en nations. The food was amazing, as was the BC wine (from First Nations people, of course!). A truly enjoyable experience.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:08:37.010085",
            "response_from_owner_text": "Thank you for the review! We are glad you learned new things and enjoyed your time with us.",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:37.010085",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 450,
            "total_number_of_photos_by_reviewer": 10441,
            "reviewer_url": "https://www.google.com/maps/contrib/100337974012364151770/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ2YyeW1BRRAB",
            "reviewer_name": "DIANNE E",
            "rating": 5,
            "review_text": "Took my friend for her 70th birthday the other night with another friend and my daughter. We all had the salmon sample and the bison. It was absolutely delicious. Have had it before and highly recommend. I am sure everything on the menu would be outstanding. The ambience and energy is so warm and welcoming. As are all the staff. They went over and above, making my friends birthday so special. Thank you.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-24 02:08:37.012162",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 34,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/103246001333830017741/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNUktcXVBRRAB",
            "reviewer_name": "Christi Balaki",
            "rating": 5,
            "review_text": "Absolutely incredible restaurant - the food is incredibly delicious and really special. The prices are also very reasonable for the quality of the food that you get. We got the Salmon Sampler, the Bison pot roast, and the Bannock. Everything was super tasty especially the salmon sampler which was our favorite dish. We also had a couple of wines which were quite tasty as well. Overall, excellent place!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:37.013918",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 325,
            "total_number_of_photos_by_reviewer": 1564,
            "reviewer_url": "https://www.google.com/maps/contrib/114422551583028080541/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dTgtUHJBRRAB",
            "reviewer_name": "Rishi Mistry",
            "rating": 5,
            "review_text": "True to most reviewers  experiences, Salmon n  Bannock exceeded expectations. This small restaurant has big heart and you ll feel it as soon as you walk in the door. I was seated and served by Brigitte, who walked me through the menu, the land acknowledgment, and the owner s history. I started with the salmon sampler, which featured a bbq salmon mousse, salmon ceviche, and candied salmon with toast pints. Each one was so unique in flavor - unlike any preparations of salmon I ve had before. Brigitte steered me toward the sablefish for an entree. It was so light and flaky. The caper cream sauce was perfect. They were out of the polenta so mine was served with lovely mashed potatoes and veggies. The meal ended with a complimentary refreshing ice pop. Like others have said, the service alone is worth a visit. Salmon n  Bannock is not to be missed if you re wanting to honor and experience indigenous food from these lands.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:08:37.015535",
            "response_from_owner_text": "Were so glad you enjoyed your time with us!",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-07-01 02:08:37.015535",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 54,
            "total_number_of_photos_by_reviewer": 128,
            "reviewer_url": "https://www.google.com/maps/contrib/110956076164123586716/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaV8tMnB3RRAB",
            "reviewer_name": "inspiringfoodie",
            "rating": 5,
            "review_text": "Im embarrassed to say I waited 13 years to finally visit, but better late than never right?! We came here for DOV 2022. The meal was fabulous, the ambiance was wonderful, the indigenous artwork gorgeous & the hospitality was extremely warm, inviting & friendly. If you havent had the privilege of dining at this fine establishment, please do yourself a favour & go. It will be an evening you wont soon forget. They also have a new location YVR Airport! So excited to try it soon! Any chance of getting a location in Surrey?! @inspiringfoodie",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:08:37.676207",
            "response_from_owner_text": "Glad you had a wonderful time and a wonderful meal! We hope to see you at YVR for more wonderful experiences with us. A location in Surrey is not currently on our roadmap, but never say never. :)",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 02:08:37.676207",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 230,
            "total_number_of_photos_by_reviewer": 381,
            "reviewer_url": "https://www.google.com/maps/contrib/116418817907936078275/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSZ1pQRHpBRRAB",
            "reviewer_name": "Cat S",
            "rating": 5,
            "review_text": "What a cute little restaurant with some tasty and unique food options! It is a MUST GO for anyone visiting Vancouver. I recommend the salmon and wild rice & any of the appetizers which were delicious (I had the bannock with mushroom and blueberries and bison gravy soooo good!). The food was very fresh and the service was great. If its still available, get the haywire beer, so good! Tastes like strawberries.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:08:37.680520",
            "response_from_owner_text": "Thanks, Cat! You MUST come back! :)",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-06-01 02:08:37.680520",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 243,
            "total_number_of_photos_by_reviewer": 281,
            "reviewer_url": "https://www.google.com/maps/contrib/113468043567010516766/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NUtEMWt3RRAB",
            "reviewer_name": "Scott Gardner",
            "rating": 5,
            "review_text": "Wow, what an amazing dinner. The food was unique and amazing. Filled with subtle bursts of flavour. My fiance became a Canadian Citizen. What better place to go? Nowhere else.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:08:37.683425",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 628,
            "total_number_of_photos_by_reviewer": 1523,
            "reviewer_url": "https://www.google.com/maps/contrib/115650111550905290171/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbC0tTTNnRRAB",
            "reviewer_name": "Stephen Ragell",
            "rating": 5,
            "review_text": "If youre looking for a unique and memorable dining experience in Vancouver, this is it! The restaurant is conveniently located on Broadway and has a wide variety of Indigenous dishes. Our pick of the night would have to be the Bison Pot Roast although our game sausage appetiser and the Fish n Rice were also very good! If youre looking to get the Bison Pot Roast I would recommend getting in early, it is very popular and they were sold out of it pretty quickly! The restaurant was super busy for a weeknight, due in part to the Healing Our Spirit Worldwide conference of Indigenous health care leaders and professionals taking place in Vancouver at the time and there were diners from all over the world (ourselves included!) coming to taste the food. Overall a really good experience and one I would definitely recommend.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-17 02:08:37.686823",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 53,
            "total_number_of_photos_by_reviewer": 726,
            "reviewer_url": "https://www.google.com/maps/contrib/108429653866905803381/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTc0wtd3dBRRAB",
            "reviewer_name": "Abdul-Razak Adam",
            "rating": 5,
            "review_text": "I had an extraordinary experience trying something truly unique and authentic for the first time at this restaurant. The owner and employees were incredibly friendly, and their passion and interest in food, culture, and travels were evident, making the whole dining experience even more special. The best part was that everything had a natural taste, unlike the spicy foods I usually eat. Experiencing the genuine flavors was a delightful change for me. I highly recommend giving this restaurant a try, as it offers a remarkable and different culinary experience that you wont want to miss out on.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:37.689818",
            "response_from_owner_text": "Glad you liked it! We try our best to honour the ingredients. Theres already so much work and passion in the products before they come to our kitchen. The kitchen crew really puts their hearts into the food too. Hope to see you again soon.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:08:37.689818",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 50,
            "total_number_of_photos_by_reviewer": 318,
            "reviewer_url": "https://www.google.com/maps/contrib/100651217206236347215/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCamV5N2xBRRAB",
            "reviewer_name": "Denny Hui",
            "rating": 5,
            "review_text": "Tried a new spot for New Years dinner with the family. Wanted to try First Nations cuisine after remembering that one restaurant opened at the airport. Found Salmon n Bannock online. Only restaurant thats indigenous owned and operated. Place is small boutique restaurant thats clean with glass dividers  that added to the overall decor. Lots of arts on the wall that are available to buy if you wanted I believe. Staff is very friendly. Our waitress was from Cranbrook and very helpful with our orders. Food was fantastic and very filling. Especially the Bison Roast. Its actually enough for 2 people. We started with 2 appies,  Salmon and Game samplers. The oak jam that comes with the dish is very delicious. Food overall, I can go into details about the food but will instead say great flavor and presentation! This is a restaurant that everyone should try. You wont be disappointed.",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:08:37.692709",
            "response_from_owner_text": "Hi Denny, Thanks for a great review! We look forward to feeding you again soon!",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 02:08:37.692709",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 149,
            "total_number_of_photos_by_reviewer": 1359,
            "reviewer_url": "https://www.google.com/maps/contrib/117223317977698900129/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobU5tWTBRRRAB",
            "reviewer_name": "Victoria Chuong",
            "rating": 5,
            "review_text": "My husband and I were visiting Vancouver for the first time and we were lucky to snag a reservation last minute. The team at S nB are awesome, very friendly and personable with all the guests. We really enjoyed the fare of local wine and indigenous foods, very comforting for the snowy weekend. I made sure to get a jar of cedar jelly as a memento. Highlights --- Salmon sampler, venison sausage, and bison pot roast! Tip: dont spoil your appetite with too much bannock, its so yummy but very filling hehe.",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:08:37.695748",
            "response_from_owner_text": "Hi Victoria, Were so glad you managed to snag a reservation last minute on your visit. We hope youll come back to visit this city and us again someday!",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 02:08:37.695748",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 36,
            "total_number_of_photos_by_reviewer": 65,
            "reviewer_url": "https://www.google.com/maps/contrib/106322888096469382272/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoekpIdTd3RRAB",
            "reviewer_name": "Brandon Hansen",
            "rating": 5,
            "review_text": "Great atmosphere and a fantastic intentional food experience. Prices were on point for the experience and quality of food. The seasonal game sausage had salal berries and it was an amazing combination. Salmon sampler was beautiful too. The bannock for the salmon burger was a bit thick and made it very difficult to eat. The cedar jelly for sale was a great call, was happy to buy some for home. Would return again! (PS make sure to reserve a table! Limited/intimate dining area).",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:08:37.698367",
            "response_from_owner_text": "Thanks for the great review! We hope you enjoy the Cedar Jam, and that well see you again soon! Please feel free to let us know next time if something is not up to taste.",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 02:08:37.698367",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 150,
            "total_number_of_photos_by_reviewer": 127,
            "reviewer_url": "https://www.google.com/maps/contrib/103858726891861744024/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlc3JpQWtnRRAB",
            "reviewer_name": "KTown Karen",
            "rating": 5,
            "review_text": "If you re in Vancouver, definitely check out Salmon n  Bannock on Broadway! Absolutely delicious Indigenous cuisine, amazing feed your spirit menu and beautiful ambiance. Indigenous owned wineries on the wine list, wines pair well with the food. Definitely will be back when I m back in town. Thank you for the amazing evening.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:37.700874",
            "response_from_owner_text": "The meal is only as good as the people you share it with. Thank you for sharing your kind words.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:08:37.700874",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 33,
            "total_number_of_photos_by_reviewer": 88,
            "reviewer_url": "https://www.google.com/maps/contrib/116892525126102070070/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbTd2LTVBRRAB",
            "reviewer_name": "Rachel Sweeney",
            "rating": 5,
            "review_text": "One of the best meals Ive had for a while! We got there at 3:30pm as we didnt have a reservation and we got seated very quickly. We got the meat taster, bison and fish meals. Everything had such a great taste combination. Two drinks as well were excellent. A lot of thought has gone into the menu and service. The only problem was I didnt have enough space to eat more things! Ill need to come back again soon.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:08:37.703225",
            "response_from_owner_text": "Thanks for the review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:37.703225",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 100,
            "total_number_of_photos_by_reviewer": 397,
            "reviewer_url": "https://www.google.com/maps/contrib/116783396323295852472/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eHIydnRnRRAB",
            "reviewer_name": "Annica Howe",
            "rating": 5,
            "review_text": "The people here are doing something amazing! Every morsel has been thoughtfully  crafted using modern methods and the highlights of a multitude of signature flavours like game, cedar, and bison. It tasted like the feeling of coming home on a cold fall night. I loved that everybody here took time to share details about what was on each plate and what the Salmon n Bannock hoped to offer its visitors. You aim to build connections and really deliver a unique platform for kindling them. Thank you!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:38.267821",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/107101333966932826669/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcThiQVhBEAE",
            "reviewer_name": "Melanie",
            "rating": 5,
            "review_text": "Visiting from out of town and was recommended to come here and I am not disappointed. Such friendly staff and a small intimate environment made the experience so enjoyable. The food was great and gave me the chance to try a cuisine that I have never had before. I will definitely come back here if I m ever back in town!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:38.270867",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 5,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 42,
            "reviewer_url": "https://www.google.com/maps/contrib/102551581828289467763/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcGNITDV3RRAB",
            "reviewer_name": "Grace Fong",
            "rating": 5,
            "review_text": "Absolutely unique place - Indigenous Food you wont find anywhere else. The food is of the highest quality and all local with unique flavor combinations. We had the bison pot roast, the salmon and rice, and a new dish - butter poached black cod! The bannock is soft and warm and fresh. The server is also incredibly nice, knowledgeable, and you can see how much she cares about every detail.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:38.273862",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 202,
            "total_number_of_photos_by_reviewer": 6416,
            "reviewer_url": "https://www.google.com/maps/contrib/110243338829877433432/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPZ19lSE5REAE",
            "reviewer_name": "John Shaw",
            "rating": 5,
            "review_text": "What an absolute gem of a restaurant!  My partner and I arrived without reservations, and they were fortunately able to squeeze us in (pro tip: make reservations as it is an intimate dining space!). We opted for a cocktail and various appetizers to try a bit of everything.  The food and plating was top notch - every ingredient was treated with respect and could easily stand on its own, but was very harmonious when eaten together.  There is clear thought and love poured into each plate. Service was also wonderful.  Our server, Jeremy, was so attentive, polite and welcoming and they took the time to explain all of the dishes as well as give recommendations on personal and fan favourites. Easily one of my favourite and most memorable dining experiences of the year so far!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:38.276497",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/102040700142370270039/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwd0tmdlh3EAE",
            "reviewer_name": "Abigail Kahl",
            "rating": 5,
            "review_text": "Dinning at Salmon and Bannock was a great experience!  The food was delicious, especially the mushrooms on bannock and the bison pot roast.  The service was excellent, and the owner even took the time to stop at each table and share her story with us.  But on top of the food and the service, eating at the restaurant was an opportunity to sample a culinary tradition that is under-represented and under-appreciated.  If you like good food, and new experiences, I cannot recommend Salmon and Bannock highly enough.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:08:38.279178",
            "response_from_owner_text": "Thank you for the review!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:38.279178",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115758744249999988264/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVemZpR1lBEAE",
            "reviewer_name": "Breana Smith",
            "rating": 5,
            "review_text": "First time learning about bannock and having bannock and I loved it! The owner is an amazing person with a great story to tell. The food is great! The food is made to order pretty much which lengthens the wait a little bit but it s not too bad. Just letting you know in case you think you ll be in and out. Stay a whole, look at the great artwork on the walls and just enjoy the hospitality and great flavors that s offered.",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 02:08:38.281979",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 307,
            "total_number_of_photos_by_reviewer": 392,
            "reviewer_url": "https://www.google.com/maps/contrib/109074606558705021226/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa2JqZzBRRRAB",
            "reviewer_name": "Janice St.Helene",
            "rating": 5,
            "review_text": "Excellent food - we had the bison pot roast, sable fish, venison sausages and mushrooms on bannock. Also tried some great wine from Apricus Cellars and beer from Locality Brewing. The service was great. It was very busy so took a little longer to get our food. Well worth the wait!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:08:38.284309",
            "response_from_owner_text": "Fantastic! Thanks for the review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:38.284309",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110739464477235080734/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNheG9XLWl3RRAB",
            "reviewer_name": "Leo Poon",
            "rating": 5,
            "review_text": "Superb food quality, reasonable pricing, friendly staff! First time trying bannock and wild rice, and the right amount of seasoning just makes your happy <3   sockeye salmon is fresh and well seared. Cedar jam is a must try,  syrup / wine like flavour thats not over sweetening, and just melt in your mouth. Over size biscuit, this is the dream come true moment LOL. ( I always wonder why high tea dont make their biscuit bigger, and here we go!)",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:38.287557",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 371,
            "total_number_of_photos_by_reviewer": 6703,
            "reviewer_url": "https://www.google.com/maps/contrib/100700810041700501941/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyby0tc0h3EAE",
            "reviewer_name": "Madeleine King",
            "rating": 5,
            "review_text": "A glorious feast for the tastebuds and all the senses! This cozy, classy spot is filled with indigenous art and music and features a fully authentic indigenous menu with locally sourced ingredients (yes, even the wine list!). Service is impeccable and the fare is upscale elegant and delicious. We had toasted bannock with mushrooms as an opener, and elk sausage / wild caught salmon fiss and rice for the main. Sage-infused blueberries featured prominently and highlighted the game and bright local veg perfectly. Perfect unique spot for a date. Will visit again!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:38.289819",
            "response_from_owner_text": "Hi Madeleine! Thank you for the detailed review, we appreciate you and hope to see you again one day.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:08:38.289819",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 55,
            "total_number_of_photos_by_reviewer": 124,
            "reviewer_url": "https://www.google.com/maps/contrib/101208662970777929266/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSejVmSm53RRAB",
            "reviewer_name": "Chi T",
            "rating": 5,
            "review_text": "I loved it . The restaurant is small and it was quiet until a large party arrived. Then it was quite loud. I was happy that we arrived early so that we could relax, talk and enjoy our meal. The service is extraordinary. You cant help but like the servers. They are so nice.  The food is incredible. My friend had the bone marrow with crackers. She said it was a very generous piece which she enjoyed. We both had the salmon burger on a Bannock bun. We ordered the fries as our side. They were hand cut freshly fried sweet potatoes. Yumm. Instead of ketchup, we were given a small container of lemon aoili, which was heavenly. The Bannock is addictive.  It is a thick dense bun, and I could eat it all the time.  In fact, i amcraving one now. This restaurant is definitely worth trying. Please make sure you make reservations.  You will probably need it.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:08:38.292235",
            "response_from_owner_text": "Thank you for the 5 star review! Well have some Bannock waiting for you whenever youre ready for more!",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-05-01 02:08:38.292235",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 210,
            "total_number_of_photos_by_reviewer": 30,
            "reviewer_url": "https://www.google.com/maps/contrib/104915457975120114015/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhcnVuTW5nRRAB",
            "reviewer_name": "Mina",
            "rating": 5,
            "review_text": "A very nice First Nation restaurant. We all loved our meals. Very plain yet perfectly prepared. I hope we had more restaurants of this kind in the city. Our waitress was super friendly and very patient with our questions. The salmon was fantastic. But, the bison meal was absolutely phenomenal! And, the bannock was so delicious. Did I explain clearly how much I loved our meal there?",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:38.850431",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 337,
            "total_number_of_photos_by_reviewer": 3614,
            "reviewer_url": "https://www.google.com/maps/contrib/109991494711956019281/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURab1BHVFFBEAE",
            "reviewer_name": "Karen Neff",
            "rating": 5,
            "review_text": "We had the game charcuterie plate and the elk steak special. The Bannock bread was warm and fresh; our elk steaks were overdone (we asked for medium-rare, they came out well-done) but still tender, well-seasoned, and delicious with the peppercorn gravy. Service was a little slow but very friendly, as our server offered us complimentary freezies at the end of the meal. Overall, a wonderful experience.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:38.853574",
            "response_from_owner_text": "Thanks for the review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:38.853574",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 67,
            "total_number_of_photos_by_reviewer": 18,
            "reviewer_url": "https://www.google.com/maps/contrib/104213005928374819191/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaThfWFNnEAE",
            "reviewer_name": "Asha Virdee",
            "rating": 5,
            "review_text": "Visiting from Toronto and knew I had to visit this establishment. The food was amazing! Dishes were unique and delicious. You can tell this business values sourcing fresh and local food. The restaurant manager and staff were lovely to chat with. I will be back as soon as I can.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:38.857207",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/113808997554194675710/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwc1puVnhnRRAB",
            "reviewer_name": "Ariel Russ",
            "rating": 5,
            "review_text": "Loved our experience there! Incredible (huge) piece of salmon and wild rice. Also enjoyed the game platter appetizer to try flavors we ve never had before. Such attentive service and so grateful we were learning more about their culture. Highly recommend! Can t wait to eat more at their airport outpost.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:08:38.860235",
            "response_from_owner_text": "Thank you for the review!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:38.860235",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 52,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/112895041056938396777/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxX0lLMElREAE",
            "reviewer_name": "John Tino",
            "rating": 5,
            "review_text": "Great place! Amazing experience! We shared the sausage for our appetizer. It was packed with and extremely moist. It was served on top of greens and frozen blueberries infused with sage. The bison pot roast was tasty and so tender, you can cut it with a spoon.  The kelp  cabbage  rolls was amazing. Both served with bannock. Make you have the bannock with the cedar jelly. The cedar jelly is out of this world. Exceptional service. I highly recommend this place.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:38.864306",
            "response_from_owner_text": "Sounds like you had a great meal. Im glad you tried some of our top hits. Time to try the others now...",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:08:38.864306",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 262,
            "total_number_of_photos_by_reviewer": 256,
            "reviewer_url": "https://www.google.com/maps/contrib/117958452438492175742/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNUpINXNRRRAB",
            "reviewer_name": "Carolina Arai",
            "rating": 5,
            "review_text": "We were very lucky to try the Peppercorn Brie Steak Bites! They were brand new on the menu. This appetizer is AMAAAAAZING! The steak bites melt like butter in your mouth! The hints of thyme and the Brie are so delicious! We paired this plate with the Salmon mousse and the Mushrooms and toasted bannock (make sure to add the bacon because it is delicious!) I totally recommend this place! The server was delightful and she took the time to share with us recommendations for the cedar jelly that we bought to go.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:38.867246",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 13,
            "reviewer_url": "https://www.google.com/maps/contrib/116054716686289174328/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadWRtV05BEAE",
            "reviewer_name": "Bill H",
            "rating": 5,
            "review_text": "I had the Bannock with butter and jam appetizer which was very good.  For the main course I had the Bison Pot Roast which was absolutely amazing.  Chock full of flavor and melt in your mouth! This place is a must visit for anyone interested in great food.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:38.869668",
            "response_from_owner_text": "Thanks for the great review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:38.869668",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 33,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/115097317611414123864/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NGVyajV3RRAB",
            "reviewer_name": "Vanessa Pinto",
            "rating": 5,
            "review_text": "Amazing food quality and service! One of our meals was vegan and they were very knowledgeable and accommodating, and went through items that were vegan or could be modified on the menu. We had the pemmican, bison, bannock taco (made vegan), upside down cake and sorbet. Everything was perfect. Even better, the staff were so friendly and personable it made for a wonderfully personal experience. 10/10 would go back! Thanks for the great night.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:38.872561",
            "response_from_owner_text": "Were thrilled that you loved it. You were such a pleasant table to talk to. Thanks for your lovely words. See you again soon  .",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:08:38.872561",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 30,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/112517323682922211322/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNHJDbnpRRRAB",
            "reviewer_name": "Aditri Bhagirath",
            "rating": 5,
            "review_text": "We got the mushrooms on bannock, salmon sampler, bison bone marrow, and bison pot roast. The bison pot roast was the star of the night- perfectly cooked, tender and juicy, complemented by the potatoes and bison gravy (indeed good enough to drink from a wine glass, as advertised). Mushrooms on bannock was our favorite appetizer. We loved the bannock and couldn t get enough of it. Didn t like the salmon sampler as much, probably a personal preference. Highly recommend this gem!",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:08:38.875159",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 27,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/113588327407986632136/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdjR2OUVREAE",
            "reviewer_name": "Lorraine Daniels",
            "rating": 5,
            "review_text": "I certainly was not disappointed. The food was so delicious! I loved the salmon mousse especially. I loved hearing the indigenous music and seeing the art on the wall. The Covid separations were not only practical, but with the indigenous art etched on them was functionality with an artistic flair. So beautiful and such a wonderful idea! Two thumbs up and a thousand stars! The staff was so friendly and made amazing recommendations. The sage-infused salmon was very flavourful",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:38.877588",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 25,
            "reviewer_url": "https://www.google.com/maps/contrib/102869061157127026987/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOW9lNEhBEAE",
            "reviewer_name": "Alana Hardy",
            "rating": 5,
            "review_text": "The meal and service was excellent. My dining companion and I had such trouble deciding what to order because it all sounded incredible. We settled on the mushrooms on bannock and charcuterie plate to start. The mushrooms were amazing, and while the charcuterie plate was interesting with its cured game meats, it was a little ho-hum. I ordered the vegetarian risotto, which was flavourful and delicious. My friend had the game sausage dinner and reported that it was fantastic. We didnt have room for dessert, but the offerings sounded tasty. We loved that all the wines and beers came from Indigenous wineries and breweries. What a wonderful experience! My one quibble was that our mains arrived before we were finished our starters.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:08:39.433367",
            "response_from_owner_text": "Thank you for the review!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:39.433367",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 56,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/108816165792374834955/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMjctY2lBRRAB",
            "reviewer_name": "Ashley G",
            "rating": 5,
            "review_text": "I was here about a month ago with some friends, and I m still telling people how amazing the elk steak on special was. And the bannock is just like what they make back home! It s a beautiful restaurant with a lovely team and gorgeous food. The salmon platter was stunning too, there s some very fine technique and work here and I can t wait to go back!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:39.437460",
            "response_from_owner_text": "Aww, so great to hear this. Thank you!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:39.437460",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103650976892348109840/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldkxHaWZBEAE",
            "reviewer_name": "Debby D",
            "rating": 5,
            "review_text": "A friend wanted to do dinner and I suggested we tried this spot. We went and the experience (service, food, ambiance, presentation) superceded my expectations. We had reservations and the very polite, gentlemanly manager seated us promptly. Ordered the salmon sampler, great appetizer. My favorite of the trio was the candied salmon, surprise. We received our delicious Bannock. Hey Bannock...where have you been all my life? It was made with usual basic bread ingredients but the taste was warm and texture was soft chewy. My red snapper and my friends pot roast arrived within reasonable time and I was blown away by the beautiful presentation. Vegetables were steamed but long enough to bring out its vibrant colors, love it!!! I would definitely come back and will make sure my friends try this spot. Great job!!! There needs to be more indigenous restaurants!!!! Vegetarian options: Salad Dietary restrictions: They have gluten free Bannock Parking: Park on top of Toys r Us",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:39.440530",
            "response_from_owner_text": "We agree. There needs to be more restaurants like ours. Tasting Indigenous can be an eye opener. Were happy that you loved it all.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:08:39.440530",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 149,
            "total_number_of_photos_by_reviewer": 81,
            "reviewer_url": "https://www.google.com/maps/contrib/109680466045145062714/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdV9hTjVRRRAB",
            "reviewer_name": "Jason Rupke",
            "rating": 5,
            "review_text": "What a neat place. Was just waking around looking for something to eat on a layover and found this gem. Staff were super friendly, the place is decked out with costal Indigenous art, and best of all is to food! I got the mackerel cake, which was on the pricy side but oh so good. Its clear that they put love into their dishes and really care about the diners. I will definitely eat here again next time Im in Van.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:39.443871",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/105099914161933891920/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQya0xEaDFRRRAB",
            "reviewer_name": "Kerri F",
            "rating": 5,
            "review_text": "I cannot say enough good things about this restaurant. From the owner to the staff to the amazing food; it was just the most amazing night all the way around!! They made it extra special because it was my birthday and sang happy birthday and gifted me rhubarb upside down cake which was amazing. The ambience it is just like going home and FYI the gravy; yes you could drink it from a wine glass it was that good. I had the roast bison (pictured) which you didnt need a knife to cut as it was so tender it fell off my fork.  My sister had salmon with Ojibwe rice which tastes so good and the soup and the mushroom on fried bannock was simply delicious. Again, I cannot say enough good things about this restaurant. I will be a repeat customer. I am going to eat my way through every single item they have on the list",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:39.446263",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 48,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/105605600261274251336/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc2FIbUxnEAE",
            "reviewer_name": "Sarah Wolff",
            "rating": 5,
            "review_text": "We LOVED this place! The food and service were incredible, and it was really unique to be educated about indigenous food and culture through our dinner. Additionally, all of the employees were indigenous and put forth a great amount of care and authenticity into their service. We d highly recommend the locally brewed honey ale and the bison bone marrow.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:39.448525",
            "response_from_owner_text": "LOVED having you!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:39.448525",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105697239084479887520/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ajRHejJnRRAB",
            "reviewer_name": "Kendra W",
            "rating": 5,
            "review_text": "Salmon & Bannock is an excellent choice for a high quality dinner out, whether you re a local or tourist. I had the feature, Sable fish in a herb butter, and it was incredible. The bannock and dessert was excellent as well. I ve already booked them for a corporate function too!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:39.451637",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 33,
            "total_number_of_photos_by_reviewer": 44,
            "reviewer_url": "https://www.google.com/maps/contrib/101397581297567551652/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbmZxamRBEAE",
            "reviewer_name": "Tyson Nguyen",
            "rating": 5,
            "review_text": "Easily of our favourite restaurants in Vancouver. If you want to have a taste of the indigenous cuisine, this is the place to go. The food had such a wow factor, and the service, atmosphere everything was on point. Definitely would recommend!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:39.454169",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 17,
            "reviewer_url": "https://www.google.com/maps/contrib/101117156719662204378/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeV9EQXp3RRAB",
            "reviewer_name": "cat9554",
            "rating": 5,
            "review_text": "This place was sooo yummy and beautiful. Definitely my top places to enjoy in Vancouver. We ordered the mushrooms on toasted bannock that have a beautiful gravy drizzled over it and some sage infused blueberry sauce. We also had the game sausage with that same sauce and sausage honestly doesn t get better than that. Then for dinner we had the bison dinner, and that was amazing as well. I really like the way they do their mash. Don t forget to order wine as well, you won t get a better tasting wine anywhere else in the city, it s perfectly dry and flavourful with hints of oakiness. It s the cab franc-merlot called hee-heetelkin red. For desert we had the boozy sundae which is also the best! Maple liquor drizzled over ice cream with fresh berries and their famous blueberry sauce. Oh and their soup! Yes very good soup there.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:39.456930",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/116968895164095772780/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbS1IUjR3RRAB",
            "reviewer_name": "Nixie Knox",
            "rating": 5,
            "review_text": "I m allergic or sensitive to most common foods so its hard to enjoy a meal out. Tonight we discovered this place for an early birthday celebration. What a Godsend!  Gluten free bannocks crisp on the outside, fluffy on the inside with delicious jams. Amazing Game Sampler. Bison pot roast you could cut with your fork. Sundae with sage infused blueberries and the most amazing maple whiskey on top. Service was great!  They explained the cultural connections with the food. We sampled the Sea Lion which is like a combination of crispy brisket and smoked salmon. The only thing we weren t crazy about was the smoked salmon flatbread. It was dry. Could have used some capers Or sauerkraut or something to moisten and brighten the taste. Can t wait to go back!",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 02:08:39.459613",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 75,
            "total_number_of_photos_by_reviewer": 42,
            "reviewer_url": "https://www.google.com/maps/contrib/103959631311701575763/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtZ01xRzd3RRAB",
            "reviewer_name": "Manuel Crepin",
            "rating": 5,
            "review_text": "Fantastic soul food, surprised its the only native restaurant in Vancouver. Would highly recommend a visit, the food, atmosphere, and service are all great.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:40.004119",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 56,
            "total_number_of_photos_by_reviewer": 38,
            "reviewer_url": "https://www.google.com/maps/contrib/107530293843478334682/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPM1pYenV3RRAB",
            "reviewer_name": "Darrell Lau",
            "rating": 5,
            "review_text": "Amazing place to experience indigenous culture paired with their amazing food. Amazing service and friendly staff, and delicious fresh local ingredients. I feel this is a place everyone should experience at least once",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:40.008641",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": 20,
            "reviewer_url": "https://www.google.com/maps/contrib/106694057234687938131/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNlBXSGxRRRAB",
            "reviewer_name": "cjd randoms",
            "rating": 5,
            "review_text": "Ive driven by this place so many times and I cant begin to explain how happy I was with my first experience here. If youve seen my other reviews, ambience and service are just as important to me than the actual food - the overall experience here was excellent. Darnell, the manager, was very warm and welcoming which goes a long way for bringing customers back. I know Ill be going back and would highly recommend this place to anyone looking for a excellent dining experience. Servers were personable, punctual, knowledgeable, and certainly made me feel right at home with their warm-homie hospitality. Now, the food - ridiculously good. Ive never had Indigenous cuisine before and I can confidently say that this was one of the best dining experiences Ive ever had. Servers and manager demonstrated a thorough knowledge of their dishes and their ingredients. The first bite I took into my appetizer which was the Three sisters and cuz Bannok - wow... A great combination of flavour and texture (must try). I also tried the bison meetballs and the whole dish with all its ingredients is truly a match made in heaven. For my main dish, I had the elk Wellington with smashed brussel sprouts. Again, a great combination of flavour (the mustard added a great element of flavour to the elk Wellington) and texture and the mash added the perfect touch to compliment the rest of the dish. Thank you for a wonderful dining experience and I hope to see you soon!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:40.011766",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 64,
            "total_number_of_photos_by_reviewer": 69,
            "reviewer_url": "https://www.google.com/maps/contrib/101082844003385204246/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeHV5QWJBEAE",
            "reviewer_name": "Katrina Haug",
            "rating": 5,
            "review_text": "Incredible atmosphere and food! Highly recommend anyone planning a trip to Vancouver makes a point of coming to Salmon and Bannock. The staff were great and we felt part of their family for the evening. The food was incredible and like nothing we had ever tasted before. Will talk about this meal for years to come !",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:40.014763",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/112117338989821251726/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ejR1eTl3RRAB",
            "reviewer_name": "Matt Arthur",
            "rating": 5,
            "review_text": "Had a lovely munch here last night. The traditional artwork and warm decor really sets the tone for your arrival. We ordered the game shared starter (cedar jelly was  ) along with the bison    potato and salmon barley entrees. Let s keep it short and sweet. If you re looking for a foodgasm get over to this cosy little restaurant. The food was unreal. Super tasty. Full of flavour. The bison was as soft as lamb shank and the salmon was rich. The barley was cooked in butter and tasted out of this world. The bannock was dense and warm. We had a crispier version with the starter. The manager visited our table to enlighten us with local know and personal history, which really was the cherry on top. Raving this much you d think I d been paid to leave a review. Sadly the bank balance disagrees.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:40.017559",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 57,
            "total_number_of_photos_by_reviewer": 84,
            "reviewer_url": "https://www.google.com/maps/contrib/108104276530521709872/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeDdpS0xBEAE",
            "reviewer_name": "Vishane Herath",
            "rating": 5,
            "review_text": "It was so worth it OMG this was one great experience! We went there for dinner to celebrate my partners birthday and it was the best decision we took so far on a restaurant! Even though the portion sizes might look small, they are so filling and tastes divine! We both took half of our plates home. And the Cedar jelly is out of this world! Also now Ive tried the Ojibwe wild rice, every other rice feels inferior (I know its not really rice but still!) And I grew up eating rice my whole childhood! (Being South Asian) For reference, we ordered the bison pot roast and fiss n rice. Oh I almost forgot, the salmon sampler hit all the right spots OMG I cant stress enough how happy salmon n bannock made us feel!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:40.020134",
            "response_from_owner_text": "We love the rice too! We love creating good experiences for people.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:08:40.020134",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 29,
            "total_number_of_photos_by_reviewer": 49,
            "reviewer_url": "https://www.google.com/maps/contrib/102048028013003631906/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaLXNqeVpBEAE",
            "reviewer_name": "Claire",
            "rating": 5,
            "review_text": "The best meal youll have in Vancouver! Delicious food, lovely team and a great atmosphere. Salmon n Bannock is our favourite restaurant for celebration meals and to bring guests to for the best of BC and we cant wait for our next visit! The salmon sampler and Bison potroast are not to be missed.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:40.022839",
            "response_from_owner_text": "Thanks for the review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:40.022839",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100552466558113731808/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocnJIV1RBEAE",
            "reviewer_name": "Doug Johnson",
            "rating": 5,
            "review_text": "This place is full of joy and good food. We had the sablefish and sausage (elk) and started with Candied salmon and mushrooms. I could literally just sit and eat 6 orders of candied salmon and feel like I was in heaven.",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:08:40.026105",
            "response_from_owner_text": "Thanks for the review! It was a joy having you!",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 02:08:40.026105",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 68,
            "total_number_of_photos_by_reviewer": 35,
            "reviewer_url": "https://www.google.com/maps/contrib/114445882108777753657/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDeGI3RG9BRRAB",
            "reviewer_name": "stan cook",
            "rating": 5,
            "review_text": "I Love this Restaurant. Definitely a cool experience, the Food was Amazing. It was a 3 dish meal. I had the salmon with Elk and Mash potato and fresh greens, that dish was so tasty and filling. Came with the salad that was really good. The desert was   pie and ice cream, and the price $$$ was decent well worth it. The Infusion of modern and Traditional food. On top of this great meal, they also have Beautiful First Nation Art that you can purchase ,also along with the gift shop that has alot of amazing pieces.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:08:40.028848",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 196,
            "total_number_of_photos_by_reviewer": 2611,
            "reviewer_url": "https://www.google.com/maps/contrib/111239961629278097292/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNVBUSU9REAE",
            "reviewer_name": "Gerry Keane",
            "rating": 5,
            "review_text": "Amazing meal. Our servers were friendly, well-informed about the menu but the bison pot roast... To die for! Loved every minute we were there. Its on the expensive side but you certainly get what you pay for.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:40.031021",
            "response_from_owner_text": "Thanks for the review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:40.031021",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115805495710705649538/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabzlpazdBRRAB",
            "reviewer_name": "Corina P",
            "rating": 5,
            "review_text": "An awesome dining experience. Roast bison is my favourite, but everything is amazing. Be sure to make a reservation to avoid disappointment. Highly recommend to everyone,  and most especially to our visitors from abroad. Food",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:40.606977",
            "response_from_owner_text": "Thanks for the review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:40.606977",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 194,
            "total_number_of_photos_by_reviewer": 160,
            "reviewer_url": "https://www.google.com/maps/contrib/113390268584806066561/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybk82M093EAE",
            "reviewer_name": "Adam Luijkx",
            "rating": 5,
            "review_text": "What can I say that hasnt been said? Fantastic food worth every penny and SO flavorful. I had the Roast which was amazing! So tender that you can cut through it so easily. Bannock is amazing. Service was super friendly and helpful! Everyone we talked to was awesome! Will 100% be back",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:40.609588",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 22,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/108936398482164189381/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMTVlNHRBRRAB",
            "reviewer_name": "Courtney Jones",
            "rating": 5,
            "review_text": "This place was amazing. We tried the game plate, smoked salmon flatbread, and the open faced Bison sandwich. Everything was amazing, but the highlights of the night were definitely the cedar jelly and the smoked salmon flatbread. The people were also super helpful and explained some of the dishes on the menu. One thing to keep in mind is the seating is limited, so you will want to make a reservation. I highly recommend this place.",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 02:08:40.612124",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/109176817490293428856/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOThHRklnEAE",
            "reviewer_name": "John",
            "rating": 5,
            "review_text": "Wow! Blown away on how good it was. I had the bison soup as an app and then the bison pot roast. They were both so good. Service was great too. If I ever end up in Vancouver again, it will be in my list of things to do.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:40.615063",
            "response_from_owner_text": "The soups are always amazing. Our kitchen staff do an amazing job bringing our traditional flavour to the modern tables. If youre back in town, well have a table for you (make a reso!!)",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:08:40.615063",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 76,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/102003848262603814724/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaDQzZGRREAE",
            "reviewer_name": "RJ Nundy",
            "rating": 5,
            "review_text": "11/10 Experience. Staff was joyful and knowledgeable, explained the choices and details very well... and ohh the meal.. thoughtful and presented dishes with generous portions. Mix of flavours without the pretentiousness. Great value for price. Ask for Brigitte.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:40.617566",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 32,
            "total_number_of_photos_by_reviewer": 19,
            "reviewer_url": "https://www.google.com/maps/contrib/104479982012065366929/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NmFMVHp3RRAB",
            "reviewer_name": "Alessia Avola",
            "rating": 5,
            "review_text": "We (table for 2) shared the candied salmon, bannock with cedar jelly, wild mushroom risotto with salmon, and dessert, and everything was delicious. Great atmosphere, very cozy, and the staff were really welcoming and helpful. I would definitely come back, and would recommend this place to others!",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:08:40.619909",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108603584480450400770/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNDlLanV3RRAB",
            "reviewer_name": "Jer Baum",
            "rating": 5,
            "review_text": "We had an absolutely amazing time. The service was so very welcoming. The delicious food warmed our hearts and made our intimate date night so memorable. The Bison dish we shared melted in our mouths and we will definitely be back to try it again.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:40.621977",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 299,
            "total_number_of_photos_by_reviewer": 287,
            "reviewer_url": "https://www.google.com/maps/contrib/113422321436232442949/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURab09QMDhBRRAB",
            "reviewer_name": "Veronika Paukkunen",
            "rating": 5,
            "review_text": "The food was amazing especially the bannock, candied salmon and bison pot roast. The people were very kind and accommodating. I highly recommend. Dietary restrictions: they made me gf bannock and it was incredible and came with the best tasting jam and butter too",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:40.624054",
            "response_from_owner_text": "Thanks for the review! We are so glad you loved your experience with us.",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:40.624054",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111147880244364089245/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNUlLNmZBEAE",
            "reviewer_name": "Meg B.",
            "rating": 5,
            "review_text": "We recently had a special event at this restaurant and it was amazing.   The owner and staff were fantastic and the food blew us away.   You will not be disappointed!   They offer beautiful and unique dishes.   Highly recommend ! Dietary restrictions: They offered both gluten-free and vegetarian options that were delicious",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:40.626643",
            "response_from_owner_text": "Thank you for the review!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:40.626643",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117826575877530643799/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbEk3OUpnEAE",
            "reviewer_name": "Nicole S",
            "rating": 5,
            "review_text": "Have been here twice and its always delicious. Recently went for dine out with a few friends and the food and service were both awesome. Love the fresh bannock - especially with a side of cedar jelly!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:40.629641",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 35,
            "total_number_of_photos_by_reviewer": 22,
            "reviewer_url": "https://www.google.com/maps/contrib/106040906643715677300/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OGRTVm5RRRAB",
            "reviewer_name": "Sara BONYADI",
            "rating": 5,
            "review_text": "A real treasure to find a modern indigenous restaurant in Vancouver with high quality ingredients and great friendly service. Also the best bannock weve tried!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:41.198384",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 56,
            "total_number_of_photos_by_reviewer": 121,
            "reviewer_url": "https://www.google.com/maps/contrib/103349286139872476853/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpeUx2dzlRRRAB",
            "reviewer_name": "Brandi C",
            "rating": 5,
            "review_text": "We have been to Salmon and Bannock a couple times now and never disappoint. It is a good idea to plan ahead and make rezos as the diningroom was small to start with, now with covid even less seating. They are Vancouvers only Indigenous owned and operated restaurant. Using traditional ingredients and authentic flavours to create wonderful and delicious modern dishes. All Game Meats are Organic and Free Range.  From the land to your table. Seafood sourced of the BC coast:) The service is amazing and do a great job of explaining what makes each dish special. Mmmm so good   If you have people visiting from out of town and want to share some authentic indigenous cuisine go to Salmon & Bannock!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:08:41.202216",
            "response_from_owner_text": "Its wonderful you enjoyed it all! We make a great date night spot too",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:08:41.202216",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 69,
            "total_number_of_photos_by_reviewer": 60,
            "reviewer_url": "https://www.google.com/maps/contrib/113162329144660962505/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDa0syN2xBRRAB",
            "reviewer_name": "Sam V",
            "rating": 5,
            "review_text": "Amazing amazing first experience with indigenous cuisine! Darnell, the manager, served us and made sure we had a perfect and memorable experience. The quality of the ingredients was outstanding and the dishes themselves were incredibly well executed. We had the bison pot roast, the mushrooms over bannock and the game sausage. They were each so amazing. The sausage was perfectly seared and the seasoning was perfect. The bannock was such a unique type of bread that paired perfect with the gravy/mushrooms. The pot roast was so tender and juicy and all the seasonal vegetables were perfectly seasoned and cooked. We learned about indigenous culture and had a great meal! A perfect date night   Can t wait to go back! In terms of COVID procedures, they replaced the table cloths and had the tables set with 2m of distance between them.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:08:41.206202",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 59,
            "total_number_of_photos_by_reviewer": 59,
            "reviewer_url": "https://www.google.com/maps/contrib/116738588395362769193/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTaXFhR0VREAE",
            "reviewer_name": "Dakshin Gunawardana",
            "rating": 5,
            "review_text": "Came here with my wife for our annual Christmas date! Ordered the Pemican appy, Bison pot roast, Salmon & Ojibway rice and boozy Sundae for dessert! The house made bannock was included as part of entres. The food was fabulous! The Pemican was very flavourful. The bison pot roast was very tender and fall off the fork, the salmon was cooked to perfection! The cedar jelly that came with the bannock was literally like tasting a cedar tree!! Our bill came to $120(tax incl) including two glasses of wine and the portions including drinks is very worth the price! Such an awesome experience trying indigenous cusine! Would definitely go back as well as recommend to anyone who likes to try different types cusines! My only minor suggestion for improvement is their email display name, currently says SNB and looks like a junk email at first glance. Maybe Salmon n Bannock Restaurant would be more informative.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:41.209924",
            "response_from_owner_text": "Thank you for the suggestion. Im happy that you enjoyed your meal. We hope to see you again soon!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:08:41.209924",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/118066731785884311542/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5c0tHWlp3EAE",
            "reviewer_name": "Selina A.",
            "rating": 5,
            "review_text": "Hidden jewel with wonderful food, wonderful people! The mushroom on toast appy was absolute heaven, the bison pot roast so tender you could use a spoon, and the elk steak basically melts in your mouth. The bannock was soft and buttery, and the cedar jelly - unforgettable. Definitely coming back.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:41.213479",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/108353197854764163379/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5OTZYNXZnRRAB",
            "reviewer_name": "judy h",
            "rating": 5,
            "review_text": "Love love love this place and the vibes that come with it. Always come back. The flavors coming from the kitchen are one of a kind and the team is extremely talented.  (We loved it so much i forgot to take pictures of the rest of the meals!) For appies we had 3 amazing wild salmon dips, wild bison dip, mushroom and gravy infused bannock, blueberry & sage infused preserved sausage, candied salmon, and bannock crackers A must try for anyone in or coming to Vancouver!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:41.216535",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 15,
            "reviewer_url": "https://www.google.com/maps/contrib/108245203769396333942/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyX1BiV25RRRAB",
            "reviewer_name": "Emma W",
            "rating": 5,
            "review_text": "So so so good! The atmosphere, the service, and most of all the food. I can t stop raving about my experience here. I ate here with a group and wasn t sure how it would be as a vegetarian, but the risotto was out of this world and the wine was divine. Can t wait to visit again next time I m in town.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:41.219402",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/109618125536159626449/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1azktTU5REAE",
            "reviewer_name": "Amber McSwain",
            "rating": 5,
            "review_text": "What an experience! The salmon platter is a MUST! The food is soooo delicious, lovely staff and great atmosphere. Definitely will be coming back!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:08:41.222269",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100895105209413406520/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxM1kzdnRRRRAB",
            "reviewer_name": "Shelby B",
            "rating": 5,
            "review_text": "Honestly amazing. I had the charcuterie entree with pemmican mousse, the bison pot roast and a glass of red for dessert. Bridgette was my server and took amazing care of me. I would and AM definitely recommending this place to everyone and anyone who can listen. The only word I have to describe is: incredible.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:41.225444",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/102326591320961542211/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOGM2cVpnEAE",
            "reviewer_name": "Marc",
            "rating": 5,
            "review_text": "First Class Dining We were finally able to get a table in this very busy and popular restaurant. We decided to spend additional $15 and made our dinner a three (3) course deluxe meal. The restaurant only uses top of the line quality products and you will notice. The flavours are amazing. Service is excellent as well. Highly recommended.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:08:41.227841",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 293,
            "total_number_of_photos_by_reviewer": 671,
            "reviewer_url": "https://www.google.com/maps/contrib/100816664089644473449/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeW9DZWJREAE",
            "reviewer_name": "Ayesha M",
            "rating": 5,
            "review_text": "Had a very nice dinner here with my family. The service was great, the staff were very friendly, and the food was amazing! I will be coming here whenever I visit Vancouver. Highly recommend. :)",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:08:41.782802",
            "response_from_owner_text": "Thanks for the review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 02:08:41.782802",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114462100325654627085/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcmJ5VDJ3RRAB",
            "reviewer_name": "Suzanne",
            "rating": 5,
            "review_text": "Absolutely loved this fabulous unique indigenous food in Vancouver. Bison, elk, wild caught salmon, cedar jelly, bannock bread, great staff explained all the ingredients and traditional styles...delicious, authentic!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:08:41.786395",
            "response_from_owner_text": "Thank you!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:08:41.786395",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105104505217458245383/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeUtxZTFBRRAB",
            "reviewer_name": "Yumi Nishad Rahman",
            "rating": 5,
            "review_text": "Took my sweet friend in Sept 2019. Had an outstanding time. The food was unique and delicious. We paired with local wine. The service was friendly and helpful. Cant wait to go back.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:08:41.790204",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 54,
            "total_number_of_photos_by_reviewer": 50,
            "reviewer_url": "https://www.google.com/maps/contrib/100140185683778674731/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxemJHVHJnRRAB",
            "reviewer_name": "Farah M",
            "rating": 5,
            "review_text": "Really enjoyed the food, the ambiance, and the warm and friendly staff! My husband and I eat halal (essentially pescatarian and no alcohol) , and they were so understanding and explained all the different options available to us. We had the salmon sampler, the Bannock taco, and the kelp cabbage rolls, all of which were delicious and beautifully presented!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:41.792433",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106691013326294910005/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNay1QMGNBEAE",
            "reviewer_name": "Barath Kumar",
            "rating": 5,
            "review_text": "Highly recommend to anyone who want to experience a real indigenous food. It s a small casual-bistro style setup, really loved the ambience. Lots of interesting native arts from local artists. I had salmon 3 ways sampler for appetizer, it was pretty tasty, served with some fresh bannock crackers. For mains, I had this 24hr slow cooked bison served with roasted vegetables and mash. The bison was to die for, really tender and flavourful! There re many other dishes in the menu sounded good but I chose the bison and it was pretty DELICIOUS. The staffs are very friendly and knowledgeable, made the whole experience GREAT!! Good luck to salmon n  bannock and will definitely come back soon!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:08:41.794704",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/108893669929776548165/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpaHRmMXlBRRAB",
            "reviewer_name": "Sofia Favila",
            "rating": 5,
            "review_text": "My favorite place when Im in Vancouver! The friendliest staff anywhere Ive been to, the cuisine is AMAZING! Definitely try the mushroom on bannock and the cedar jelly. My husband and I celebrated our wedding dinner there (the only place where he has tried a risotto that he likes) and the staff honoured us with a traditional ceremony, we couldnt have asked for more, they give their 110% in all they do, and my heart, soul and belly always feel full after dining there!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:41.796579",
            "response_from_owner_text": "Im so happy you enjoyed the meal. That day marks a new beginning for you both. We wish you the warmth and protection in life. Whenever you need to feed your spirit, you know where we are.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:08:41.796579",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 22,
            "total_number_of_photos_by_reviewer": 22,
            "reviewer_url": "https://www.google.com/maps/contrib/106318225823425678804/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLcnVpb05BEAE",
            "reviewer_name": "Jiameng Lan",
            "rating": 5,
            "review_text": "I love here, from the food, people to the decoration. Asha is professional. Everything here is warm! Bison meat ball is chewy, with smoke cheese inside. Cedar jelly is a must-try. Its very unique and paired with the fluffy buttery bannock. The Elk Wellington has crispy pastry layer and a little bit smoky flavour. Im totally full after the Wellington, but dessert is moist and fluffy, just cant stop finishing it. Definitely will come back to try the candied salmon! HY CH QA!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:41.798411",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 63,
            "reviewer_url": "https://www.google.com/maps/contrib/101374199345618644091/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhM0lPejV3RRAB",
            "reviewer_name": "Rachelle",
            "rating": 5,
            "review_text": "I thoroughly enjoyed Salmon n Bannock! The food was delicious (open-faced bison sandwich and coleslaw photo attached), the atmosphere was awesome and the service was exceptional. Ive heard many great things about this restaurant and I can see what all the hype was about. Will definitely be returning again soon. Thank you!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:41.800004",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 39,
            "total_number_of_photos_by_reviewer": 22,
            "reviewer_url": "https://www.google.com/maps/contrib/104817925882824703117/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLV82bVpnEAE",
            "reviewer_name": "Hanna",
            "rating": 5,
            "review_text": "Stayed in Vancouver for a week and this was by far the best meal! I have celiac disease and they had a ton of gluten free options, including the bannock. The bannock is incredible, as well as the sausage and salmon.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:08:41.803791",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/100458296422017024330/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaDVXRmVnEAE",
            "reviewer_name": "Karl Castillo",
            "rating": 5,
            "review_text": "Reservations are definitely recommended but they accommodated us which was great. Our server Bridgette was knowledgeable with the menu and gave us a nice overview of the menu with recommendations. Food: The food we got was the Bison pot roast with mashed potatoes and maple green beans topped with bison gravy as well as a smoked wild salmon burger on bannock with a side of sweet potato medallions and aioli. The roast also came with warm soft bannock with cedar jelly and butter on the side. The roast was incredibly tender and wasnt gamey. The beans were a nice compliment with its sweetness to the savouryness of the meat. The salmon burger was nice but the best part was the potato medallions. The seasoning of the potato was enough that it didnt need to be dipped in the aioli. We also got to bring home whatever was left of our cedar jelly. Atmosphere: The restaurant was filled but not overly with art and pictures that made the atmosphere inviting, homey and relaxing. There was music but the music wasnt loud which is great as you can have conversations with your party. The manager came by to see how we were doing and we were able to ask about their food and how their cedar jelly comes from white cedars from Quebec. Overall the experience was excellent and we will definitely come back to try out their other dishes.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:08:41.806822",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 96,
            "total_number_of_photos_by_reviewer": 343,
            "reviewer_url": "https://www.google.com/maps/contrib/113301808085159804268/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}