{
    "place_id": "ChIJB_FlAGJ1hlQRjhsWnTXWogU",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab0tEYnF3RRAB",
            "reviewer_name": "firstt3nor",
            "rating": 5,
            "review_text": "Aprils Aquarium has become a mecca for the planted Aquarium hobby. I cant  say enough good things. They regularly order unique and interesting fish. Their team is surprisingly knowledgeable. The experience has improved since the two locations merged. Having all the live stock in one location is convenient. Ive been very happy with aquarium coop products, and the wide selection of hardscape. They stand by their product warranties. Lastly, Aprils aquarium treats their fish with great care. They score big points on quality. The fish they sell are well fed and healthier than Im used too. I havent had any issues with diseases. They are the only store I know of that quarantines all of their fish before selling it.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:15:18.619869",
            "response_from_owner_text": "Thank-you for your very kind sentiments and your very valuable 5 stars we really do appreciate it. On the quarantine , we are very sure some do but not for 7-10 days as we do , this has proven a dramatic and significant reduction in customer issues / complaints and concerns , which is obviously prudent to a successful business for many reasons. We are delighted you recognized this as a benefit to the customer , healthy fish / happy customer / happy lLFS win win win. Thanks for all your support and of course we hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:18.619869",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/111363507779113022217/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdXItV2JBEAE",
            "reviewer_name": "Soraya Frede",
            "rating": 5,
            "review_text": "Aprils Aquarium has always been super helpful and amazing when I have shopped in store and online. Its a great environment to go and shop around for any of your aquarium needs and they have a HUGE selection of fish and supplies. This past week I have been sick in bed and there was a short noticed scheduled power outage and Aprils delivered a battery operated air pump to me same day! I am so grateful to have such an amazing local fish store that cares so much! And they have online shopping for people that are not in driving distance! Highly recommend!!! Thanks for your fantastic service :)",
            "published_at": "5 days ago",
            "published_at_date": "2023-11-17 01:15:18.622248",
            "response_from_owner_text": "Soraya, what a great and perfect review of our overall offerings, thank-you very much for all your support and commitment to our small business and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "4 days ago",
            "response_from_owner_date": "2023-11-18 01:15:18.622248",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/108793944112118831410/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNS1DZE13EAE",
            "reviewer_name": "Lily Chong",
            "rating": 5,
            "review_text": "This is an incredible aquarium store, highly recommend! Over the last few months Ive been building a 55 gallon aquarium for my 21-year old Red Eared Slider. Every employee there is really knowledgeable about aquarium care. Although I wasnt there to buy fish, the principles are all pretty much the same for my turtle, and I was able to get all the necessary decorations, chemicals, and materials to make the perfect home for my turtle. I also ordered my aquarium stand from them at a great price compared to other stores, and they hand-delivered it to me within the week! I felt particularly grateful for that, because I did not have the strength to carry that item myself, and I was already a bit stressed about that. They took the worry right out of my hands. Not to mention...it was free! I also had one of the employees teach me about improving the flora in my aquarium, and advised me on some good decorations that would not just be pretty, but support the health of the tank. Since Ive done the recommendations, my tank is healthier than it has ever been, and it requires less maintenance compared to before. Every time I go into the store I learn a bunch of new things! I always enjoy going to Aprils Aquarium. Not just because its fun to look at the fishes and browse the goods, but because the service is truly top notch. I highly recommend it for all your aquarium needs! Thank you!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:18.624335",
            "response_from_owner_text": "Lily, I do really honestly dont know were to start. This review is absolutely outstanding , out the gate we cannot thank-you enough for such a detailed / in depth and in a word PERFECT review. Top Notch Incredible Highly recommended  these statements make us very happy to know we are on the right track and meeting our objectives and your fine comments just underline our efforts are worthwhile. We cannot thank-you enough for all your support this just amazing review and of course we hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:18.624335",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 17,
            "reviewer_url": "https://www.google.com/maps/contrib/113544552398996190066/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaajczQ2JBEAE",
            "reviewer_name": "carolyn garthe",
            "rating": 5,
            "review_text": "Love ordering from Aprils!  Always an easy and pleasant experience. Fish are healthy, fast shipping and reasonably priced for overnight, super quick to answer messages and good communication. Repeat and happy customer with cute little baby pea puffers.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:18.626525",
            "response_from_owner_text": "Carolyn , what a great review, we  cannot thank-you enough for all your support and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:18.626525",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/106508304489986326240/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MEk2NkhREAE",
            "reviewer_name": "Wendy Brassard",
            "rating": 5,
            "review_text": "Although not my first time purchasing from Aprils it was my first time receiving a shipment. The fish arrived happy and healthy. I cant say enough about Aprils Aquarium. Darrin and the staff are knowledgeable and care about their stock and it shows. They have a really good variety of fish, are very helpful and the store is a treat to visit. Huge bins of hardscape will keep you there for hours if youre not careful. Highly recommend them. This shipment I got a bunch of these cuties. Love them!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:15:18.628310",
            "response_from_owner_text": "Wendy , we cannot thank-you enough what a wonderful thought out review and very much appreciated. Cheers for all the kind words of encouragement and of course we hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:15:18.628310",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/100425647727640459316/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN2VQdE9nEAE",
            "reviewer_name": "Ken",
            "rating": 5,
            "review_text": "April s Aquarium is our go-to place for all our aquatic needs. We were impressed by their variety of fish when we visited their Vancouver location. The owner Darrin is very knowledgeable and friendly, and he always answers our emails promptly. We have ordered several deliveries from them since our first visit, and we are very happy with the quality of the fish. They arrive healthy and lively, and they have adapted well to our aquarium.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:18.630096",
            "response_from_owner_text": "Ken , thank you very much for your candid and excellent review of our overall offerings. We appreciate it very much as it does help us along on our journey. Your valuable business is also not unrecognized and we look forward to being of service and again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:18.630096",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 15,
            "reviewer_url": "https://www.google.com/maps/contrib/110140967619327441447/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseEw3ZEx3EAE",
            "reviewer_name": "Paulina Pedrero Miranda",
            "rating": 5,
            "review_text": "The BEST aquarium in town, very assorted, the staff is very wise and friendly, all my plants, fishes and shrimps are from here!, if you are looking something different and cool, this is the place!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:15:18.631925",
            "response_from_owner_text": "Paulina, thank-you very very much for the lovely comments and your excellent review . Hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-15 01:15:18.631925",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 114,
            "total_number_of_photos_by_reviewer": 418,
            "reviewer_url": "https://www.google.com/maps/contrib/108624088905627547078/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbTd2WEJBEAE",
            "reviewer_name": "Christopher Read",
            "rating": 5,
            "review_text": "Best freshwater fish store in the lower mainland hands down their prices are very down-to-earth they are also a retail partner with aquarium co-op for aquarium supplies. Super knowledgeable staff, very friendly even the owner gos above and beyond for friendliness! The whole team is just absolutely wonderful super knowledgeable and very. Theres a pretty cool points system there that if you get enough points youre eligible to get an aquarium, definitely a huge bonus! Huge selection of fish and supplies, prices are the same youll find anywhere else beating the competitors!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:15:18.633938",
            "response_from_owner_text": "Chris, this is a fantastic review and we cannot thank -you enough. This is what we are striving for every day and no doubt about it we really do appreciate it. Thanks also for all business and of course the magnificent photos you posted here we are great at everything freshwater aquariums photographers we are not :-)  Thanks for all your support and we hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:15:18.633938",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 92,
            "total_number_of_photos_by_reviewer": 25,
            "reviewer_url": "https://www.google.com/maps/contrib/102230937588277105812/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcGZlWjVRRRAB",
            "reviewer_name": "Tess Slamen",
            "rating": 5,
            "review_text": "My favourite fish store is definitely my favourite place to get livestock that is healthy and lasts a long time. Each fish or shrimp I get from the store always colours up so beautifully. There is never a time I ve been disappointed. The tanks they sell also are incredibly inexpensive with the add ons. I d highly advise you to shop here as other stores have not had as wonderful as a turn out as Aprils! Be sure to say hi to the friendly staff and wonderful crew.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:15:18.635815",
            "response_from_owner_text": "Thanks Tess for the amazing review we really do appreciate it. Your support of our small business for many years has not gone unnoticed and we thank-you very much. Hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-15 01:15:18.635815",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116363615059605395364/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSekxIRFhnEAE",
            "reviewer_name": "Sapphir",
            "rating": 5,
            "review_text": "So glad I was able to purchase almost everything I needed for my tank at April s Aquarium. I like that I can order online and pick up or have items delivered as well. Staff are helpful and give advice about fish. Can be a bit fast paced as well but still an amazing one stop shop. Not all available plants are on the website so do pop in for a look. You ll leave refreshed. I also love that their livestock have mandatory quarantine before sales! This greatly reduces the chances of the customer getting a sick fish. They re very passionate about fish keeping and offer excellent advice. If you re a beginner and don t know where to start, start here.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:15:18.637585",
            "response_from_owner_text": "Thank-you very much for the fantastic review, we appreciate it very very much and of course your valuable business.  Hope we can support you further in our great hobby @yourlocalfishstore",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:15:18.637585",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/117360507124836516136/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseXFYdVBREAE",
            "reviewer_name": "Amber Jason Beaven",
            "rating": 5,
            "review_text": "Love this place! So much selection with excellent customer service. If you haven t been here before, the place is huge. It s basically a warehouse with the cash and storefront at the front where you can find chemicals, food, plants etc. Further back, there are rows upon rows of aquariums to browse. Even further back, they have beautifully aquascaped display tanks designed by Aquarium Co-op (they have partnership with them). These tanks are works of art! The times I ve been there, they ve had calming piano music playing. The atmosphere in the store is peaceful, kind, and friendly, and all the staff I ve spoken with so far seem like true fish nerds and are very knowledgeable. Highly recommended checking this place out if you haven t yet!",
            "published_at": "6 days ago",
            "published_at_date": "2023-11-16 01:15:19.255536",
            "response_from_owner_text": "Amber, what a fantastic review , thank-you for taking the time to provide all your lovely comments and of course the 5 stars. We really do appreciate all the support and of course we hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "5 days ago",
            "response_from_owner_date": "2023-11-17 01:15:19.255536",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103824353788290795038/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OV9HU0V3EAE",
            "reviewer_name": "Bruce Pan",
            "rating": 5,
            "review_text": "This is the best aquarium store I have ever been to. I have to mention that Jacob really impressed me with his professionalism and willingness to help. I could feel that he tried everything he could to assist me in figuring out every single detail to build my fish tank from scratch. I must say its a must-visit place! By the way, the quality of the fish they sell is incredible! This store is very responsible. If their fish ever show signs of being unhealthy, they would rather keep them in their own tank and nurse them back to health instead of sneakily selling them to customers. I love this place!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:15:19.259331",
            "response_from_owner_text": "Hi Bruce, this indeed a very flattering review but very much appreciated. The best aquarium store  we cannot say enough thanks for your support and words of encouragement. Hope to see you again very soon Bruce @yourlocalfishstore. cheers",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:15:19.259331",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/112685545999191399828/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4LWZqSGpBRRAB",
            "reviewer_name": "Marissa Bourke",
            "rating": 5,
            "review_text": "We had such a great visit! The store is welcoming, bright, and full of amazing fish and plants! The display room is inspirational and had me thinking about future aquascaping plans all day. A special thanks to Omid and Darrin for all their help and the amazing welcome we received. We will definitely be going back often.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:15:19.263255",
            "response_from_owner_text": "Marissa, Thank-you very much for the tremendous review we just love it. Your support and enthusiasm of our store is very much appreciated and we cannot thank-you enough for all the words of encouragement. Hope to see you again very soon @yourlocalfishstore. cheers",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:15:19.263255",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/105241618863144371337/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aktfdVdREAE",
            "reviewer_name": "Adria Young",
            "rating": 5,
            "review_text": "Love my new rimless aquariums! Amazing customer service and high quality products. I ve ordered aquariums, filters, plants and fish/shrimp. The second photo shows an aquarium from April s that I m dry starting Monte Carlo plants from April s (tank covered in plastic wrap). Never disappointed with April s Aquarium.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:15:19.267346",
            "response_from_owner_text": "Adria, never disappointed , now that bar is set very high to maintain - we will do our level best to keep it that way. :-) You are obviously super happy with us and thats all we aim for and can ask the rest will hopefully follow. What a great review, thanks very much for all your kind support and of course goes without saying we hope to hear from you very soon @yourlocalfishstore.  Ohh the aquariums are looking great, fantastic job, good luck with the monte so far so good. :-)",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:15:19.267346",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/113105873434104829324/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabE1lY09REAE",
            "reviewer_name": "Yvonne Lim",
            "rating": 5,
            "review_text": "I love this place. We come here every other weekend because theres always new stock of aquatics. Their aqua babies are always healthy and well looked after and now theres gorgeous display aquariums in the back section to admire. Jacob is super knowledgeable and helpful too! Thank you   (Heres a cute photo of my blue neon goby that I purchased from here)",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:19.271456",
            "response_from_owner_text": "Yvonne , we love you - what a great review thank-you so much we really do appreciate it. We are super happy your happy and of course we look forward to seeing you again very soon @yourlocalfishstore cheers Yvonne",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:19.271456",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/107645697036104944586/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNHVDMkFnEAE",
            "reviewer_name": "David Minato",
            "rating": 5,
            "review_text": "Just received my fish order of Pygmy, Julii, Adolfoi and Gold Laser Cory s from Aprils. The door to door online ordering process was straight forward and the fish arrived mid morning the following day in great shape. The store was easy to contact and follow up with any inquiries. I will definitely order again.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:19.274938",
            "response_from_owner_text": "David , thank you very much for your candid review - this was indeed the perfect trial of the entire promise to deliver - deliver the promise scenario and we are delighted it all worked out. Hope to hear from you again soon sir @yourlocalfishstore",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:19.274938",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/104864377094585129415/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a012dE9REAE",
            "reviewer_name": "Bill M",
            "rating": 5,
            "review_text": "Found Aprils quite by accident. Had been getting my fish and supplies from another store (not a big box). Went into Aprils for the first time this week. What a great store. Very clean and well organized. Staff very friendly and helpful. So nice to find a store closer to home for all my aquarium needs. Will definitely be back!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:15:19.278349",
            "response_from_owner_text": "Bill , fantastic review sir for which we are very much appreciative of . We are delighted our offerings and service are to your liking and another happy customer , looking forward to seeing you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:15:19.278349",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/100790796298680299716/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbjZqYUxBEAE",
            "reviewer_name": "Sorrel Mommi",
            "rating": 5,
            "review_text": "Im not usually one to post reviews, but i really have to for Aprils Aquarium! I first came into the store about 2 months ago after googling local vancouver fish stores and I am so grateful I got sent to Aprils! I came in as a complete beginner to the fishkeeping hobby, and I was delighted that I was able to purchase everything I needed to start up my 20g planted tank right there at the store, and what an amazing selection of plants livestock! Every single staff member I have interacted with at Aprils has gone absolutely above and beyond to help me start into the hobby. Not only are the staff incredible knowledgeable, but they are totally willing to share that knowledge with me every step of the way Even when the place is swamped, the employees are always friendly and attentive. I am also a visibly transgender individual, and I have had nothing but the best interactions with everyone at Aprils...never any weirdness or hesitancy to interact with me. I feel confident and secure knowing that I have Aprils Aquarium support and expertise in my fishkeeping journey! So so so grateful that I have such an awesome specialized Aquarium store in my neighborhood! Im looking forward to being a regular customer Thanks so much Darrin and team! See you guys soon!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:19.281711",
            "response_from_owner_text": "Thank-you Sorrel for being such a great customer and supporter of yourlocalfishstore  , you have became a regular fixture in the store and it is awesome you have taken such an interest in  our great hobby. We do know your not far from catching MTS just be rest assured we got ya when it takes hold :-) . I will pass on your very kind comments to the team they will be very happy to hear your appreciative of their efforts. Thank you for all your lovely and supportive words , and the 5 stars and look forward to seeing you tomorrow :-)",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:19.281711",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/104989575801182691228/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa1BMLXVBRRAB",
            "reviewer_name": "Rachel Zaharik",
            "rating": 5,
            "review_text": "I can t say enough good things about this shop. The absolute most welcoming, knowledgeable and kind staff imaginable. Fantastic selection, free parking (which for me is always a huge deal) and easy to find. Don t bother going anywhere else, shop here and support small local businesses. They care about your fish friends just as much as you do.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:19.284889",
            "response_from_owner_text": "Wow Rachel, how much did we pay you to say all these kind words ?  remind me please :-)  What a tremendous and fantastic review , thank-you so much for taking the time and thought we really do appreciate it and of course please come and visit us again very soon @yourlocalfishstore",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:19.284889",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/118421092636568868927/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dmFfSVBBEAE",
            "reviewer_name": "Stephen Hyatt",
            "rating": 5,
            "review_text": "A fantastic fish store with a great (and healthy!) selection of nano fish. There are lots of high quality plants, foods, and other products. Staff are very friendly, helpful, and quite knowledge. The owner, Darren, is also incredibly friendly and passionate about the business. Its a great store to support to keep the hobby going! Pictures are of my (relatively new) aquarium but of livestock from Aprils",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:15:19.287500",
            "response_from_owner_text": "Stephen, thanks very much for perfect review , cannot thank you enough for all the support its just phenomenal. We are very happy to support the hobby and of course all our current and future clients. Hope to see you again sir very soon @yourlocalfishstore cheers",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:15:19.287500",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 37,
            "total_number_of_photos_by_reviewer": 95,
            "reviewer_url": "https://www.google.com/maps/contrib/102874152034193345317/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNWZqZXZnRRAB",
            "reviewer_name": "Alicia Buck",
            "rating": 5,
            "review_text": "This place is Awesome, guys!  The selection of small and nano freshwater fish and shrimp is really impressive-- I was like a kid in a candy store!  The fish were so healthy, you can tell they really take great care of them.  Also, I was excited to see they have so much driftwood at such a reasonable price.  I bought my first fish/plants from Aprils in Burnaby months ago, and all were healthy and excellent quality, and the staff were so good at answering all my questions!  This was my first trip to the Vancouver location and it was so worth the trip!  10/10, will be back again.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:15:19.919736",
            "response_from_owner_text": "Alicia , what a fantastic review we can t thank-you enough . We are absolutely delighted you love our store and our customer service this is just reward for our continued efforts and we do really appreciate it.  With our extended hours of 7 days a week 10-6 and 9pm on Thursdays we hope to see you again very soon at the  candy store  :-) aka  @yourlocalfishstore cheers and thanks again",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:15:19.919736",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/102380945516719407681/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbUxicldBEAE",
            "reviewer_name": "Frank Tarape",
            "rating": 5,
            "review_text": "Our experience getting an aquarium for youngest son here was amazing! Darrin was incredibly knowledgable and he was awesome with our son, helping him pick out some of his favourite fish. Darrin custom built a small tank to fit our space and fish. Theyre really masters of their craft here. Ive been to other places, save yourself the time and just start here.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:15:19.923645",
            "response_from_owner_text": "Frank , we really appreciate you taking the time to provide such a great review. We are delighted Jamie is happy with our efforts and we really look forward to seeing him flourish in this fantastic hobby of ours . See you all soon for fish  . @yourlocalfishstore",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-15 01:15:19.923645",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117816702479174675992/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbXJXd2hBRRAB",
            "reviewer_name": "Jenn McD",
            "rating": 5,
            "review_text": "Incredible support from knowledgeable and friendly staff. Ive been into the store and now ordered on their Island delivery trip. A staff member followed up and made plant recommendations when I had questions. Plants and fish have been super healthy and high quality. I will order again.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 01:15:19.927207",
            "response_from_owner_text": "Jenn, Thank-you for the glowing and incredible review of our services. We cannot thank-you enough for your support and valuable business We really enjoy supporting our Island customers and hope to be back very soon. Thanks for everything and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 01:15:19.927207",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109694098174144751086/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGM2REejFnRRAB",
            "reviewer_name": "mark Devry",
            "rating": 5,
            "review_text": "Amazing customer service, and excellent inventory.  As fish keepers we all know Aquarium Co-op and to be able to purchase their items in Canada is super amazing.  Just want to say thank you for making these products available to us.  Even though they are based out of BC, I am in Ontario and still got my package in a very timely fashion.  Keep up the great work I will definitely be shopping more from your store",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 01:15:19.930723",
            "response_from_owner_text": "Mark, the thank-yous are all on us sir, without support here in Canada from our valued customers, ACO products availability here would be short lived and of course in turn the flip side is we have this outstanding review as testimony to all this support. Thank you for all kind words of encouragement and we hope to hear from you very soon @yourlocalfishstore for some  easy lights maybe :-)",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 01:15:19.930723",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/101744292704807198779/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmYtdG9RRRAB",
            "reviewer_name": "betty",
            "rating": 5,
            "review_text": "Beautiful shrimp! Shipment and local delivery are super fast! Friendly staff as well! Will be getting more plants and some fish in a couple of weeks!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:15:19.933898",
            "response_from_owner_text": "Betty , thank - you for great review. We do try our best and we are delighted your happy with our overall offering . Look forward to hearing from you soon @yourlocalfishstore",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:15:19.933898",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/117772656374124335121/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bE5peDV3RRAB",
            "reviewer_name": "Thanh Van Fehr",
            "rating": 5,
            "review_text": "I absolutely love this place! Even though I live in Edmonton, I try and buy all my supplies from them whenever I can as their prices are so reasonable and turnaround on delivery is so quick! Also, Darrin is so helpful and always has informed advice whenever I run into any issues with my tank. I m definitely a big fan of Aprils Aquarium and will be for days to come!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:15:19.937330",
            "response_from_owner_text": "Thank-you Thanh , the perfect review saying good things about the boss always helps   Appreciate all the support and of course we are already looking forward to our next order in a few days @yourlocalfishstore",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:15:19.937330",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/107646750943385345646/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaFBpTFZ3EAE",
            "reviewer_name": "John S",
            "rating": 5,
            "review_text": "I recently had the pleasure of visiting Aprils, a hidden gem nestled in metro Vancouver. This aquatic emporium is a true haven for aficionados of the aquatic realm, offering a mesmerizing array of tropical fish, shrimp, snails, and aquatic flora that left me utterly captivated. From the moment I stepped foot into Aprils, I was struck by the vivacious hues that danced through the tanks like an aquatic symphony. The kaleidoscopic variety of species showcased was a testament to the meticulous curation undertaken by the stores proprietors. Their dedication to sourcing exotic species from distant aquatic domains is evident, as evidenced by the unique assortment of freshwater creatures on display. What truly sets Aprils apart is their dedicated staff, whose expertise and passion in matters of aquatic husbandry are second to none. They tailor their advice to my specific tanks needs, ensuring a harmonious cohabitation of my newfound aquatic companions. Their sagely insights into the intricacies of maintaining a thriving aquatic ecosystem were both illuminating and indispensable. Moreover, the ambiance within Aprils is a delightful departure from the commonplace. The aquatic tableau is complemented by an ethereal soundscape, evoking the tranquil cadence of waves lapping against distant shores. The interplay of chromatic gradients and the rhythmic gurgle of well-maintained filtration systems coalesce to create an immersive aquatic sanctum. As a connoisseur of the rare and exceptional, I was thrilled to discover Aprils unparalleled selection of aquascaping merchandise. Their inventory extends beyond the ordinary, featuring a plethora of artifacts that range from the arcane to the avant-garde. These treasures enabled me to cultivate an aquatic ecosystem that is both visually pleasing and ecologically harmonious. In summary, my journey to Aprils was an experience tantamount to traversing an aquatic wonderland. Their peerless assortment of tropical fish, combined with their well informed staff and serene ambiance, renders this establishment an unmissable destination for both new aquarists and seasoned enthusiasts alike. The piscine wonders that await within Aprils are a testament to the stores dedication to providing an extraordinary aquatic experience that is, quite simply, unparalleled. Best selection, best prices, best fish store in Vancouver.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:19.940216",
            "response_from_owner_text": "John, Frankly i do not know where to start , except to say huge thank-you. What a very detailed review, when i see words like  extraordinary  unparalleled dedication  mesmerizing these alone give me goosebumps. Thanks for all your support sir and we look forward to your support @yourlocalfishstore again in the near future. Cheers John",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:19.940216",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/107627052198155185671/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcDYzblJREAE",
            "reviewer_name": "gurpinder sidhu",
            "rating": 5,
            "review_text": "The best local aquarium store. They have the best and unique fish available. They are also very knowledgeable especially if you are new in the hobby. They talk to you and treat you like family. My son loves going here.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:15:19.943251",
            "response_from_owner_text": "Gurpinder,  such a fantastic review and exactly what we strive for. Thank-you very much for all your support and you and your family are welcome anytime @yourlocalfishstore.",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-15 01:15:19.943251",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 47,
            "total_number_of_photos_by_reviewer": 56,
            "reviewer_url": "https://www.google.com/maps/contrib/112554338904804483885/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdjhualFnEAE",
            "reviewer_name": "Melissa Page",
            "rating": 5,
            "review_text": "Very happy with the service and quality of fish here. Ive been burned by several of the fish stores in my area selling sick or low quality fish. I had around 20 fish sent to me and they all arrived alive and healthy. Theyre colouring up quite nicely in my tank over this last week. I was originally getting my order shipped via courier to Victoria, but then they contacted me to let me know that around once a month they make a trip themselves to the island (Naniamo, Duncan, Victoria), and that if I wanted to wait a couple days I could skip paying the shipping fee (which was actually significantly cheaper than what I had seen from competitors in the first place). Fantastic, I bought a couple plants with the money saved, which also were healthy. In addition to the good service and quality fish I received, they also are a partner of Aquarium Co-op, which is a lovely company that focuses on education and health for fish - they have a YouTube channel as well. Ill definitely be making future purchases from Aprils Aquarium.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 01:15:19.946167",
            "response_from_owner_text": "Melissa,  This is just the perfect review.  We really do appreciate all your support and we are delighted you recognise what we do as well , that is a winning combination, as a win-win.  We strive to do our level best and we do go above and beyond and we are delighted your appreciate and recognize that and with that we always will support the hobby and our valued customers who realize and appreciate the value in a great LFS. In general the hobby is struggling due to rising costs etc, and this kind of positive reinforcement really does help us on our journey in the toughest times in retail history. Thanks for everything and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 01:15:19.946167",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/102157757329101318127/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbVoybmJREAE",
            "reviewer_name": "wendy lowe",
            "rating": 5,
            "review_text": "SOUTH VAN.LOCATION-Ive always loved Aprils Aquarium. I n to hear that their Hasting st (Burnaby) location is closing. But Im also happy that Aprils Aquarium other location,(South Van.) In Vancouver will be open 7 DAYS A WEEK now. Their Thursday hours will also be extended. Although we live in burcoquitlam, we always make the distance to go to Aprils. The owner, Darren, provides high quality customer service. They have a huge variety of nano fishes, shrimp and plants. They also have a wide selection of Aquarium Co-op supplies, which is very recognized in the aquarium world. We love going to Aprils. Highly recommend this store for all your aquarium needs. Oh, also they have a POINTS system to achieve free fish tanks. Im currently trying to configure our house for our 12th fish tank.   lol",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:15:19.948833",
            "response_from_owner_text": "Wendy, wow anyone would think i paid you to say this :-) What a great review thank-you so much. We appreciate everything you and Brent do for us and we look forward to seeing you again very soon @yourlocalfishstore.",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:15:19.948833",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/107340157100760376940/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMG91RUNBEAE",
            "reviewer_name": "Heidi Wassersleben",
            "rating": 5,
            "review_text": "I adore this store.  The staff are incredibly helpful, caring and take the time to help a very beginner fish owner with alllll the questions.  Top quality products, great prices and locally owned.  The owner is lovely too.  Support local!  These guys are great :)",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:15:20.560369",
            "response_from_owner_text": "Heidi , this could easily be a review produced by ai it s so good . Thank you so much for affording us your valuable time and your kind words it helps up for sure on our journey and we really appreciate it . Hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:15:20.560369",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107634037807947565450/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSd0tUN0RREAE",
            "reviewer_name": "Sarah T.",
            "rating": 5,
            "review_text": "It was our first time visiting April s Aquarium and we were pleased to receive such fantastic customer service!   Sadly, we don t see a lot of this these days. All the staff were really friendly and helpful especially Darrin.  He was a real kind and honest guy, very knowledgeable and gave us many helpful tips. We were originally going to purchase a used tank, but Darrin convinced us that there are risks if you don t know how old or if there were ever any issues with disease etc Fortunately they just happened to have the tank we wanted in stock, so while we ended up paying a bit more for the new tank, it was definitely worth it for the piece of mind. With Darrin s advice, he made it a super easy decision for us to purchase our first aquarium!  He also gave us many suggestions on what we can use to put together in our new aquarium.  Our little guy even received beautiful shells as a keepsake!   I m quite pleased with how it turned out!   We re definitely going to be long time customers now.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:15:20.564458",
            "response_from_owner_text": "Sarah , thank - you so much for the raving review we do really appreciate you taking the time and the thought. For beginners you have  done a fantastic job . We look forward to welcoming you    and your family back again soon @yourlocalfishstore cheers",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:15:20.564458",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/107245795475549598089/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc1lqbTVRRRAB",
            "reviewer_name": "Victoria Oko",
            "rating": 5,
            "review_text": "Very satisfied and highly recommend.  I ordered 8 fishes and 2 plants to be delivered.  My order came on time and high quality.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:20.568142",
            "response_from_owner_text": "Thanks Victoria for your kind words and 5 stars . We do try and earn your business and we are delighted your happy . Hope to hear from you very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:20.568142",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/109858557185758661962/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX01QRmxnRRAB",
            "reviewer_name": "Kea Alden",
            "rating": 5,
            "review_text": "I love this place. Ive been looking for a specialty Aquatic hobby store locally and Im so glad I found it with Aprils. The staff are always so excited to be there, and care about the fish theyre selling. Great advice, great service. Darrin is a delight. Ive been keeping fish for so many years and cant believe I was missing out on not only great deals but a great pillar of the aquarium hobby/community. Not to mention gorgeous healthy fish.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:15:20.571601",
            "response_from_owner_text": "Kea, fantastic / great / outstanding what a review cant thank you enough for this and all the support from you and your family. Come visit us again soon @yourlocalfishstore",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:15:20.571601",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/100522891222967922810/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdzh2NFZnEAE",
            "reviewer_name": "Izzy Gallant",
            "rating": 5,
            "review_text": "Absolutely above and beyond service! I placed an order for a few various things and everything was great; but I had sent an email to ask if they sell a very specific piece (nozzle) for my 9gal fluval flex and Darrin replied saying he would take it from one of their other tanks and just add it to my order free of charge, and even gave me some tips for a specific set-up. Cant recommend them enough.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:15:20.574653",
            "response_from_owner_text": "Izzy, perfect review , thank-you very much. This is what we do , above and beyond it makes a positive difference and if your happy we are happy that simple. Thanks for all your support. We hope you visit us again soon @yourlocalfishstore",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:15:20.574653",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/106235062733907407042/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacjhqWW9RRRAB",
            "reviewer_name": "Heather Mass",
            "rating": 5,
            "review_text": "Ive ordered multiple times from Aprils and they never disappoint. It is my go-to for Aquarium Co-op products in Canada and I typically load up my cart with lots of other goodies. The shipping is super fast and everything arrives in perfect condition. Cant be the selection or prices all while supporting a small business.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:20.577707",
            "response_from_owner_text": "Thank you so much Heather for the glowing and magnificent review it s the perfect antidote to a challenging morning at the store. Thanks for all your support and valuable business and goes without saying we hope to hear from you again very soon @yourlocalfishstore cheers",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:20.577707",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108088279368881952342/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMGFPZGdBRRAB",
            "reviewer_name": "Sherry Maslyk",
            "rating": 5,
            "review_text": "I was very pleased to be able to purchase Aquarium Coop items here in Canada via this store. It was so easy to do on-line. The prices were good which surprised me because of the dollar exchange from U.S. to Canadian dollars. The order was shipped via Canada post and came within a week to my mailbox! The option of ordering a $70 order and have no cost shipping is a bonus. I ll definitely stock up on my next order! Sherry from Edmonton.",
            "published_at": "3 days ago",
            "published_at_date": "2023-11-19 01:15:20.580704",
            "response_from_owner_text": "Sherry , we are very pleased you support our business and indeed very happy we ticked all the boxes for you. Thanks for the positive review and the 5 stars and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:20.580704",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116259095960227277891/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaX01UQnJ3RRAB",
            "reviewer_name": "Marc Fortin",
            "rating": 5,
            "review_text": "What can I say except for WOW. The service is amazing. Questions were answered quickly and in a friendly manner. They made me feel like part of the family. Prices are better than most places, delivery was quick and well handled. I dealt with them because I was looking for Aquarium Coop items. Now that I have tried them, they are my go-to online store for anything related to the hobby. You cant go wrong with Aprils Aquarium.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:15:20.583387",
            "response_from_owner_text": "Marc,  wow what can we say what an incredible review this is, exactly what we strive for,  we are delighted you are very happy with our overall  supply and service.  Thanks for all your valuable business , hope to hear from you again soon sir @yourlocalfishstore",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:15:20.583387",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/115062051403103730002/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1aklpZHlnRRAB",
            "reviewer_name": "Sarah Drake",
            "rating": 5,
            "review_text": "I love ordering from April s Aquarium. They are the only place to get Aquarium Co-op stuff in Canada. The shipping is fast, usually 3 to 4 days for them to ship to Ontario. One of my orders got lost in the mail and customer service was very quick to respond and fix the problem, plus they sent me a free gift with my new delivery even though it wasn t their fault. If I m ever in B.C. I will definitely make a stop to see their shop, it looks amazing from the photos I ve seen on Facebook. I highly recommend shopping at April s Aquarium!!!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:15:20.585920",
            "response_from_owner_text": "Hi Sarah , the perfect review thank you so much. We really do appreciate all your support and of course we hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:15:20.585920",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103171055114954686629/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweGZuSURREAE",
            "reviewer_name": "Jeb Agot",
            "rating": 5,
            "review_text": "All the fish came in healthy and beautiful! Had a bit of a problem with the shipping but so very thankful that Darrin called and fixed everything. Will dedinitely order again soon!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:20.588394",
            "response_from_owner_text": "Jeb, Thanks very much for the great review we really do appreciate it. Yes the shipping from Fed- Ex had a glitch which we overcame but thats life no problems only solutions right. Thanks for all your support and hope to hear from you again soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:20.588394",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/103084036662693828254/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodThueWJ3EAE",
            "reviewer_name": "Ryan J",
            "rating": 5,
            "review_text": "Excellent experience visiting April s Aquarium for the first time. Nice selection, clean tanks, and friendly staff. Our little girl also received a shell ornament on the way out! We will be back for sure!",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:15:21.227893",
            "response_from_owner_text": "Hi Ryan, thank-you for the very positive review of our services. We really do appreciate all the support and we hope to see you and your family again soon @ yourlocalfishstore.",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 01:15:21.227893",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/116254114930294806451/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbjdYNWdBRRAB",
            "reviewer_name": "Anna B.",
            "rating": 5,
            "review_text": "My dream fish has arrived on the weekend - giant betta! He is a stunner! THANK YOU! This store has the best service, great choice of healthy fish, awesome deals like buy 5 and get 1 free or any betta for free with a tank purchase... How can you say No to any of these deals?! This place is awesome! Everyone should pay them a visit",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:15:21.232395",
            "response_from_owner_text": "Anna B , we are so pleased your happy with your new   giant   boy he is stunner your 110% correct . We are also delighted about your other positive comments , it just amazing support and can t thank - you and all our customers enough. Hope to see you again soon cheers",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:15:21.232395",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/104952558549290583847/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MTRMR213RRAB",
            "reviewer_name": "Dean Wheller",
            "rating": 5,
            "review_text": "Darrin is getting serious about his Betta stock, and it shows! Great attention to detail in this store and you can really see how the new owner is bringing quality to the hobby, not just quantity like everyone else!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:15:21.236178",
            "response_from_owner_text": "Dean , thank-you for the fantastic review. Yes we are indeed expanding , and we carry more quality /fancy Bettas along with many other nice species. We do pride ourselves in quality and we are delighted your happy with our offerings. Of course we hope to see you again very soon @yourlocalfishstore. Thanks for all your support cheers",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:15:21.236178",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/102015094599316453180/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeWRTUW5nRRAB",
            "reviewer_name": "Ken Rothe",
            "rating": 5,
            "review_text": "Called randomly today looking for a replacement aquarium, and talked to the owner.  What a great dude! we had an in depth conversation about the future of the hobby, potential replacements for my tank. He offered me an incredible bundle deal as well, it was just a great and refreshing experience. I will 100% buy all my plants and all my fish from there moving forward just based on this one interaction. Cant wait to see what Aprils will be like in the near future with the new showroom.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:21.239865",
            "response_from_owner_text": "Hi Ken, Thanks for affording us your time and effort to produce a great review.  This is exactly what we strive to do , build relationships, thus trust supported by excellent customer service , do this and in due time business should follow. Thanks again for your kind words and we hope to see you soon @yourlocalfishstore",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:21.239865",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108925889956336261770/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGNHVMUkxREAE",
            "reviewer_name": "Ray L.",
            "rating": 5,
            "review_text": "First time Buyer from Aprils Aquarium and everything went without a hitch I received my package quickly and it was well packaged. I have the Aquarium Co-Op sponge filters in my tanks in 3 days from ordering to Aquariums. very pleased. Will be ordering from them again and will update this review.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 01:15:21.242916",
            "response_from_owner_text": "Ray, perfect review for which we thank-you very much for. We do value your business and support and we look forward to being of service to you again soon @yourlocalfishstore",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-11-01 01:15:21.242916",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110108744479227103180/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMV9Lb1Z3EAE",
            "reviewer_name": "Raven-Grace Jenna MacDonald-Aston",
            "rating": 5,
            "review_text": "I recently ordered tissue culture plants and fish food online at aprils  aquariums website, and I have previously bought potted aquarium plants too from these guys. Both orders I was impressed with both orders was how fast their shipping was, I recieved my orders only a couple of days after I placed the order. The quality of the plants was really fantastic, and the potted plant in particular was so healthy and lush (and has continued this in my aquarium). But the best part of ordering from aprils aquariums was their phenomenal customer service. They really went above and beyond to try and help me have a great experience, and it was so appreciated. Overall, Im really impressed with the care they put into their plants, fish and customers. Will be ordering again as soon as I can afford to do so again!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:21.246350",
            "response_from_owner_text": "Raven-Grace, thank you so much for the fantastic review we do really appreciate it. We are truly delighted you are happy with with our complete offerings of quality supplies , service and support, ticking al the boxes certainly makes us happy as well. Hope to hear from you again very soon @yourlocalfishstore cheers",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:21.246350",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111990195085633906365/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbktTNXVBRRAB",
            "reviewer_name": "Grounded Raven",
            "rating": 5,
            "review_text": "I havent been to the store yet. I asked one question last night, and the response was fast, knowledgeable, and polite. I will be definitely picking up all my equipment and fish from this store. And by reading the other reviews, Im sure they wont disappoint. Makes me even more excited about starting a new tank after 18 years of not having fish.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:21.249100",
            "response_from_owner_text": "Hi, we thnak you for considering us and your great and very pro-active review we love it. Out the gate you are happy and convinced we are the go to , a most welcome addition to the Aprils family. Cheers to you thanks again , and look forward to seeing you very soon @yourlocalfishstore.",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:21.249100",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 140,
            "total_number_of_photos_by_reviewer": 18,
            "reviewer_url": "https://www.google.com/maps/contrib/115381851601481988993/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwek1HNjV3RRAB",
            "reviewer_name": "Tasha Karpinsky",
            "rating": 5,
            "review_text": "I purchased a rimless aquarium bundle online and am thrilled and impressed with the quality and service. Darrin was very helpful, kind and attentive and even followed up to check how things were going. Will definitely be visiting again and happy to have such a wonderful local specialty fish shop!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:21.252096",
            "response_from_owner_text": "Tasha, what an outstanding review and for sure ticks all the boxes, we cannot thank-you enough.  We hope you have many many hours enjoying  your new aquarium, and please do not hesitate to get in touch if you have any questions / concerns . Looking forward to seeing you soon @yourlocalfishstore",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:21.252096",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/118194484830021906844/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMlBhSlBnEAE",
            "reviewer_name": "Alanna Elia",
            "rating": 5,
            "review_text": "Aprils Aquarium has an amazing selection of fish and fish keeping supplies. Its worth it just to go in to browse their beautiful collection. The staff are friendly and helpful, always answering questions with a smile despite being so busy.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 01:15:21.255066",
            "response_from_owner_text": "Allana, Thank-you ,Thank-you and Thank-you for all the lovely comments your 5 stars and of course your valuable business. We do try our our best and we appreciate all your support and kind words. Hope to see you again very soon @yourlocalfishtore.",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 01:15:21.255066",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113615679747930736593/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNGZtdjVnRRAB",
            "reviewer_name": "Andrew Beesley",
            "rating": 5,
            "review_text": "Beautiful store - like a free visit to the aquarium! Carries all of the Aquarium Co-Op line which I love to use for all my tanks. All livestock is quarantined for a week before they will sell it to you, so you know they care about the customers fish not just making sales. Highly recommend for all of your freshwater aquascaping needs!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:15:21.257958",
            "response_from_owner_text": "Andrew, thank you for affording us the 5 stars and your very positive comments, this helps us for sure on our journey and we do appreciate all your support for our small business.  Hope to see you again sir very soon @yourlocalfishstore",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:15:21.257958",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102425867237273019767/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc2I2d1RREAE",
            "reviewer_name": "R Oyagi",
            "rating": 5,
            "review_text": "I placed this order to get some Aquarium Co-Op items, very grateful you have hooked up with them.  Shipping across 2/3 of the country seems crazy, and though I know there are other manufacturers out there, I appreciate the Co-Op items for the fish-lover thought that goes into them.  Strange thing, the package arrived two days before expectation, but my wife was just out there and postcards to Toronto took a week and a half ---- birthday cards from here to Ottawa took two weeks.  Very happy with the entire experience with you.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:21.872469",
            "response_from_owner_text": "Thank-you so much for your outstanding and detailed review. We do try our best and we are delighted your very happy with our services. We do try our level best with what we have and as such we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:21.872469",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101100198506761672113/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa3RlLUF3EAE",
            "reviewer_name": "MB Mama",
            "rating": 5,
            "review_text": "This was my first time ordering from April s Aquariums and the service and products were outstanding! Not only did the parcel arrive shockingly quickly to Manitoba, but everything was packed with such care! My plants also arrived healthy. I m also super happy they carry Aquarium Co-op products. Personalized follow up email after I had received the purchase was also an unexpected and very nice touch. You can just tell these people really do care. Thank you for everything and I will be back!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:21.876005",
            "response_from_owner_text": "Thank - you so much for the exemplary review - we cannot thank you enough and we mean it . We do try our best and we appreciate all the support to keep us in our toes. Please do visit us again very soon @yourlocalfishstore cheers",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:21.876005",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109205821079994517964/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMGRqYVV3EAE",
            "reviewer_name": "Vajira",
            "rating": 5,
            "review_text": "I had a great experience shopping in person and ordering online. I am brand new to the hobby and Darrin gave me solid help/advice on starting my tank. I walked out of there knowing that I would always have a trusted source of information. The fish appeared to be happy and healthy in a spacious fish room. The store has lots of hardscape materials, plants, supplies and much more. I thought I would try making an online purchase and it was an easy and user friendly process. I placed my order (Aquarium Co-Op supplies) on Monday morning and received it on Wednesday! I was happily surprised by the quick turn around and will be ordering again. Looking forward to my next visit!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:21.878546",
            "response_from_owner_text": "Vajira, what a great review - this is exactly what we strive for. We quote regularly to customers just like yourself,  we have all our customers back we need you to succeed and enjoy the hobby - this happens your happy we are happy and more importantly the fish are happy , this is a win-win-win scenario and the formula to good business and warm and fuzzy vibes. Thanks for all your support / kind words / valuable business and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:21.878546",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106898010674373899505/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNEtYdl93RRAB",
            "reviewer_name": "Hailey Wilde",
            "rating": 5,
            "review_text": "I absolutely love going here to get anything fish and aquarium related, I am still new to having fish and I have probably way too many questions but everyone who works here is extremely patient and very passionate about what they do! The prices are great and their selection of products and livestock is amazing. Jacob helped me pick out some plants for my tank a couple weeks ago and he is always super knowledgeable and answers all the questions I ask:) I picked up some tetras and shrimp today and I am always super impressed by how healthy and beautiful their fish are! They had the cutest lil crabs that caught my eye as well and I might need one now! :) Thank you guys again, I will definitely be back and I appreciate all the guidance and patience !",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:21.881022",
            "response_from_owner_text": "Hailey, this is an amazing review thank-you so much for affording the time to provide us the 5 star treatment.  We are all about customer service and support and we are so delighted you have embraced this great hobby and please be cognizant we will always have your back with any challenges you may have. Thank-you for all your valued support and please come visit us again very soon @yourlocalfishstore open 7 days 10-6 and late night till  9.00pm Thursdays cheers",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:21.881022",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114936621552819671778/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNTRxVUlREAE",
            "reviewer_name": "Northside Norm",
            "rating": 5,
            "review_text": "Was looking for some Aquarium Co-Op products and found that Aprils ships them here in Canada. Started putting things in my cart and was alarmed by the shipping cost. So I stopped, then Darrin reached out by email and explained how to get to the free shipping and even helped me select different products to get the best bang for my buck. I feel like my online shopping experience had the same service as if I had walked in the store! Great job!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:21.884680",
            "response_from_owner_text": "Norm, your the man  ! sometimes technology gets in the way of positive business interactions , so we take it into our own hands and ensure every customer is at very least provided a solution to any concerns  and this occasion certainly epitomises this. We are very grateful for all your kind comments of support. We are all about retention and we are wise enough to know that trust breeds trade  and if we earn your trust you and many others will be a valuable customer for many years to come which can only be very positive for the customer ourselves and more importantly our great hobby. Hope to hear from you again very soon Norm and once again big a huge Cheers from us.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:21.884680",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 56,
            "total_number_of_photos_by_reviewer": 31,
            "reviewer_url": "https://www.google.com/maps/contrib/111432255683772437094/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMUthbVVREAE",
            "reviewer_name": "Reanna Braeker",
            "rating": 5,
            "review_text": "Went over and above. I ordered a few Aquarium co-op things and a plant on a Thursday; shortly after I ordered Darrin emailed and requested to wait till Monday to ship so that the plant wouldnt be sitting in shipping over the weekend. Very considerate; my plant arrived (along with my other items) healthy and happy :) Definitely a store that cares about getting the best outcome for their customers",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:21.887672",
            "response_from_owner_text": "Thank-you Reanna for the fantastic review, exactly what we strive for and for sure if a customer is not happy we are not happy so this kind of service is natural to us and we hope you provide us your valuable business again in the near future.  All the best and thanks again",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:21.887672",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106452066517306230249/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaThYQkJnEAE",
            "reviewer_name": "kristie wong",
            "rating": 5,
            "review_text": "Im pretty new to the hobby and this place has been a life saver: non-judgemental staff and owner, super knowledgeable and willing to listen to any question. Their items are all tried and tested community favourites alongside livestock which are some of the healthiest that Ive seen. Definitely check them out! This is the only place that Ill be getting freshwater supplies from. Store owner Darrin gave me a bag of floating plants the last time that I visited the store too. Aprils aquarium is a business worth supporting folks!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:21.890525",
            "response_from_owner_text": "Kristie, Oh my , what a fantastic , well thought out review. Thank-you so much this helps us along our journey for sure and we really appreciate your support. Hope to see you again very soon @yourlocalfishstore cheers for everything.",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:21.890525",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105916166900044237988/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OWVqNmNBEAE",
            "reviewer_name": "Karina de Souza Jensen",
            "rating": 5,
            "review_text": "My friend and I came here to get her set up with her first aquarium and betta. I came along to check it out, but let me tell you this was such a fun and fantastic experience!! The owner greeted us at the door offering some cold drinks because of the humidity, and continued to make our experience fantastic as we browsed. He was very transparent and told us what to spend more money on and what was just a cash grab. I am not a very consumption oriented person and don t always love going to stores but this was such a blast. 1000% recommend.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:15:21.893259",
            "response_from_owner_text": "Karina,  1000%  recommended   love it !  love it ! love it ! this sums it up and  honestly cannot thank-you enough for your kind words of support. Looking forward to seeing you again very soon @yourlocalfishstore cheers",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:15:21.893259",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107579949577137134996/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OWVpUnJ3RRAB",
            "reviewer_name": "Delaney",
            "rating": 5,
            "review_text": "I wish I could give more than 5 stars- the experience and customer service we had was phenomenal! There was a huge array of selection and top notch products in the store. The owner was so knowledgeable and helpful, and gave me great advice for setting up my first tank. Since I took transit there, the team offered to drive my tank home to make things easier :) if you have an aquarium or are looking into getting one, this is absolutely the place to go! I could not recommend April s Aquarium enough and we will definitely be back!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:15:21.895708",
            "response_from_owner_text": "Delaney, what a detailed and  wonderful review for which we cannot thank-you enough for. We are delighted your venturing into this great/ fascinating and truly addictive :-)  hobby, and of with that please  be cognizant we have your back with any challenges or difficulties you may have , we want you to succeed and enjoy this hobby for many years to come and with that we look forward to welcoming your to yourlocalfishstroe very soon . Thanks for all your support cheers",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:15:21.895708",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107771653614755508209/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNjctT25nRRAB",
            "reviewer_name": "Adrian Fung",
            "rating": 5,
            "review_text": "friendly and helpful store owner and employees.  Arranged special deliveries to the Okanagan region and honored DOA policies regardless of the long trek.  Provided helpful advise on compatibilities and parameters to watch for.  Great team, and happy with new additions to my tank!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:15:21.898103",
            "response_from_owner_text": "Adrian, fantastic review love it. This trip was maybe a bit of a stretch weather wise but everything worked out as it should and its great to hear it from another satisfied customer. Look forward to seeing you again maybe next time in Vancouver.  Thanks for everything again.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:15:21.898103",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 45,
            "total_number_of_photos_by_reviewer": 40,
            "reviewer_url": "https://www.google.com/maps/contrib/100245017804543168017/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOE1QRE13EAE",
            "reviewer_name": "Darlene",
            "rating": 5,
            "review_text": "Super friendly staff, very knowledgeable. The store is well stocked and organized. They have a great selection of fish and plants. If you like aquascaping, or want ideas for decorating your tank, you should check them out.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:22.521665",
            "response_from_owner_text": "Darlene, thank-you so much for the most excellent review of our overall offerings. Thank-you also for your valuable business and. it was a real pleasure to meet you and Craig we wish you both all the very best in this great hobby. and of course we hope to hear from you soon @yourlocalfishstore .Take care , cheers",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:22.521665",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117641137177712222250/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta19Hd0N3EAE",
            "reviewer_name": "D.J. MIX MASTER M",
            "rating": 5,
            "review_text": "Sad to see April s Aquarium store close in Burnaby. I hear from Darrin that there s going to be more fish tanks added to the south Vancouver location. Recently purchased a couple varieties of Ricefish and placed them outside tubs. Amazed at the quality and selection of the fish and knowledge from the staff. Keep it up!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:15:22.525587",
            "response_from_owner_text": "Thank you very very much for the amazing review. We are trying our level best and your positive comments is certainly a feel good factor . The Co-Op partnership is one made in heaven and this is only the beginning of our exciting journey together . Thank you once again and hope to see you again soon @yourlocalfishstore cheers",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:15:22.525587",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101125842369954321264/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eWJLOHpRRRAB",
            "reviewer_name": "Josh Yargeau",
            "rating": 5,
            "review_text": "Absolutely amazing store. The staff were extremely friendly, kind, and helpful. The store itself is very clean. The fish tanks look healthy and well kept. The owner even spent some time talking with the group of friends I was with and made us feel very welcome as this was our first time in the store! I will definitely be spending lots of time at Aprils in the future!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:15:22.529448",
            "response_from_owner_text": "Josh, what an amazing group. Thank-you so much for your very kind and thoughtful comments and of course your valuable business. We do try our best it what we have and its just fantastic and humbling to hear our efforts do not go unrecognised, these reviews help us along on our journey and we really do appreciate your support. Of course Josh we hope to see you and the gang again very soon @yourlocalfishstore. cheers",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:15:22.529448",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109859624375745491717/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dG9YQV9BRRAB",
            "reviewer_name": "Amanda Downey - Cracknell",
            "rating": 5,
            "review_text": "Great experience. Excellent customer service, great pricing, fast shipping. Will definitely recommend to friends.",
            "published_at": "4 weeks ago",
            "published_at_date": "2023-10-25 01:15:22.532497",
            "response_from_owner_text": "Amanda what a wonderful and perfect review thank-you very much for this and your valuable support. Hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "4 weeks ago",
            "response_from_owner_date": "2023-10-25 01:15:22.532497",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/105751764378907033148/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad2VYUHhBRRAB",
            "reviewer_name": "Colton Onushko",
            "rating": 5,
            "review_text": "Hands down the best fish / aquarium store Ive been to in the lower mainland. Ive gone to pretty much every single one from Chilliwack to Vancouver and my jaw dropped when I walked into this place, it has a lovely layout and the most amazing staff. Extremely friendly people, their products and livestock are priced fairly, they have cool/new & modern products from notable YouTube channels etc that Ive always been curious about.  No old faded boxes of junk from the 80s that never sold. They have a sandbox for you to set up aquascapes on to see how theyll fit before you purchase them with lots of rocks/logs/wood. Last but not least they have the best selection of fish Ive ever seen, housed in the most amazing BIG rimless tanks that are absolutely clean & pristine. All the fish look super healthy & happy. Well worth the 1+hr drive from Langley to check it out. Will be primarily shopping here from now on and telling everyone about this place.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:22.535836",
            "response_from_owner_text": "Holy Toledo ! What a great review Colton , cannot thank you enough for these very kind and thought out words . It is encouraging indeed to hear it first hand we are doing a good job and ticking the boxes . Thanks for all your support and hope to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:22.535836",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/112201086725565194374/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ05ITWVBEAE",
            "reviewer_name": "Matt Lynch (Lynchman250)",
            "rating": 5,
            "review_text": "Made a large purchase of lots of various items. They contacted me right away when they noticed one item wasn t to their standard and they didn t want to send me an inferior product. I was given the option to refund the item or wait for a few days to be sent a new one when it arrives. Items were all shipped the next day and I received them on time as promised. The owner personally called me to ensure everything arrived ok and that I was happy with it all, and thanked for doing business with them. Best customer service I have ever received. Made a lifetime customer out of me.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:22.538826",
            "response_from_owner_text": "Matt - we cannot thank-you enough for this truly outstanding review . We are delighted your happy with our offerings and service and of course we look forward to hearing from you soon @yourlocalfishstore",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:22.538826",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100203101351238859531/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKanNLbFZREAE",
            "reviewer_name": "R NWorthy",
            "rating": 5,
            "review_text": "10 stars. 4+ orders made fr: the end of 22 to present. (FROM BC TO NL) Each order arrived with good packaging inside, protecting fragile contents. The contents I ordered were organized to maximize space (helps to lessen shipping and more ecofriendly) but without putting breakable items at any risk. No damage, no defects, no faulty product shortly after opening. 5/5 Great job. Will add, Ive spoken with the owner a couple times now. Each time Ive been greeted with the same friendly mannerism; easy to talk with, but most importantly (to me); the open-minded & accommodating attitude was refreshing. 5/5 Great job. As a consumer in this hobby, sometimes experiencing less than helpful customer service or experiencing inadequate quality management from a business. However, Aprils Aquarium has been outstanding. Approachable, simple painless ordering&tracking, dependable. Hopefully, in the future Ill be able to order all my favorite products from Aprils Aquarium. Keep up the great work!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:22.541465",
            "response_from_owner_text": "Hi , out the gate i honestly dont think i have ever seen such a well written , well thought out review - this is absolutely just outstanding and simply we cannot thank-you enough for making the time and the effort to provide such a glowing testimonial for our small business.  Thank-you for all your support , the bar is set we just need to maintain it. :-) Hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:22.541465",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107029493571294342951/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdnVQYk1BEAE",
            "reviewer_name": "CWiens",
            "rating": 5,
            "review_text": "Aprils is my  go to  for all of my aquarium needs. There is always something new and exciting to see each time I visit, and the friendly staff have a wealth of knowledge and expertise.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:15:22.544520",
            "response_from_owner_text": "Hi Cheryl , thank- you very much for taking the time to do a review for us and of course coming to see us on many occasions . Hope to see you again soon . Cheers",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:15:22.544520",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/114481820857324064225/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGamRuekNREAE",
            "reviewer_name": "Muse Yen",
            "rating": 5,
            "review_text": "Good selection of quality products, livestocks, and plants. The staffs are friendly & knowledgeable. Having been able to place orders online has been very convenient for me.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:15:22.547367",
            "response_from_owner_text": "Muse , thank you so much for the glowing review and the 5 stars. We cannot thank-you enough for all your support to our small business and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-15 01:15:22.547367",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108114810710772218241/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNnVQc3B3RRAB",
            "reviewer_name": "Yooks",
            "rating": 5,
            "review_text": "This review should have way more than 5 stars, as I have a long list of fantastic things to say about April s Aquarium. Aprils is THE go-to place for all of your aquatics needs. They always go above and beyond with their aquatics care and maintenance, and just as importantly, their customer service. Whether it s the in-store visits or home deliveries of online orders, I am always shopping with this store because I ve never had this high level of customer experience with any other aquarium stores. I m always profound by the inventory of aquascape supplies and rare species of freshwater dwellers every time I visit their webpage and their Marine Drive location. Aprils was the reason why I got heavily into this newfound passion for fishkeeping as the young fry I was to the hobby and will always be the main part of my aquatics journey. I met the store owner, Darrin Stewart, at the shop who always engages with each and every person stopping in and I recently found out that he is always the one personally delivering my orders. This speaks a lot about how important it is to them that everyone who shops with April s is always extremely satisfied with their products and service. Thank you for taking such good care of me over the years. See you again real soon!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 01:15:22.550124",
            "response_from_owner_text": "Ohh my goodness, it sounds as if we paid you to say all these lovely things about us Yooks. We do try our level best and this kind of recognition and support is exactly what the doctor ordered and is more appreciated than you would think. Overall business in any shape or form is finding it tough these days more in particular retail and the bare facts are simple, you support us , we support you , and if things are not 100% we will do everything in our control to put right and more. All the thanks and appreciation is to our customers for their unwavering support and we will take good care of you for many years to come that is our promise. Thanks again for everything and of course we hope to see you very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 01:15:22.550124",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117552805373214409546/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOEl2UHRBRRAB",
            "reviewer_name": "cheryl long",
            "rating": 5,
            "review_text": "I highly reccommend Aprils Aquariums, they went above & beyond to make my order possible. I have been waiting a long time for access to Aquarium Co-ops products so needless to say Im thrilled. My order arrived today & I was thrilled, the plant I ordered arrived in good condition. I hope everyone will give them a try, you wont be disappointed & the owner Darren is awesome.I will be ordering again in a couple of months.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:23.214247",
            "response_from_owner_text": "Cheryl - I usually provide a detailed personal response from the heart - but with this absolutely perfect review of our services - I have only one sentence for you - You are awesome .",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:23.214247",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115114043818651142973/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa05Pa09BEAE",
            "reviewer_name": "D B",
            "rating": 5,
            "review_text": "Great conversation with owner, super clean and healthy tanks, nice diversity of fish. I appreciate that I went to get my hands on some ACO gear (without paying shipping to my Ontario home), and the staff were willing to help me without making a big sale. As a result, they ll keep my business in the future, via mail.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:23.218101",
            "response_from_owner_text": "Thank you for your fantastic candid and honest review. Thanks for coming by and it was indeed a pleasure to meet you . We would be more then happy to ship you  our offerings across to ON and look forward to hearing from you when your ready. Thanks for all your support Cheers",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:23.218101",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110372502190231876769/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcmR2UWl3RRAB",
            "reviewer_name": "Emily Rose",
            "rating": 5,
            "review_text": "My partner and I went to Aprils Aquarium as newcomers to aquascaping and were blown away by the friendliness and knowledge of Darrin and his staff at the Marine Drive location. They approached us with such intrigue to our projects and considered our budget and gave us realistic advice for which plants would work in our tanks with our fish. I got a piece of beautiful wood and lots of plants and we ended up going back for more things such as fluval stratum substrate, a filter, moss and more. The plants were in great health, and have taken well in our tanks. The store is clean and much bigger than I expected, it was a blast exploring around and looking at all the tanks of different species id never seen before. Definitely recommend Aprils Aquariums for advanced to even beginner aquascapers!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:15:23.222075",
            "response_from_owner_text": "Emily - what a fantastic review , thank you so much . We also really do appreciate your valuable business and thank you so much for this also . Please tell all your friends and family and of course we hope to see you both again very soon . Cheers to you .",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:15:23.222075",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/110959909766829645883/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacnJpeE9REAE",
            "reviewer_name": "Serena Madsen",
            "rating": 5,
            "review_text": "Aprils takes better care of their fish than any other store Ive been to! I never lose a single one when they arrive. Their stocking is great, and the Aquarium Co-Op products are fantastic to have access to!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:23.225123",
            "response_from_owner_text": "Serena, What a fantastic review, thank you ! We pride ourselves in a process that we do not sell livestock that is not healthy and we feel has longevity. We quarantine all new livestock for a minimum 7 days. This is our success for sure as we simply do not want unhappy customers and with all due respect the fish are more important to us, if they are good our customers are good, thus everyone is happy. We truly appreciate you recognizing this, as many stores do not follow our positive practises and processes.  Why ? because it costs money. Thank you for all your valuable business and support and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:23.225123",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108666359064809419663/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMGRlVndBRRAB",
            "reviewer_name": "wes man",
            "rating": 5,
            "review_text": "Love love this store!! Been awesome all around, great service and all products plants, livestock have been perfect. So nice to have such a great service in Canada. Aquarium co-op is a totally perfect touch I trust Cory threw and threw and the folks at Aprils Aquarium!! Thank you all for what you do!!!!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:23.228760",
            "response_from_owner_text": "Wes , what a beauty of a review sir. We cannot thank-you enough for all your support and long May that continue. We are delighted your happy with our offerings and service and of course we hope to hear from you soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:23.228760",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110421765950429809366/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGME9IbzdRRRAB",
            "reviewer_name": "Benjamin Nguyen",
            "rating": 5,
            "review_text": "It is my first time to order fish from this store online. I had the fish delivered to east coast yesterday. They are healthy and doing well with my other corycats. It is a pleasure to talk Darrin over the phone. I will visit  the store while I am vacation in Vancouver",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 01:15:23.231578",
            "response_from_owner_text": "Benjamin, I was indeed a pleasure helping you out with your livestock. Yes 4,000 miles is a long way and we are delighted our process of packing and heat-packs made for a successful transaction, but more importantly the fish arrived healthy and strong. We appreciate all the support, your business your fantastic review and your commitments to our great hobby in general. We hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 01:15:23.231578",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117509653361209663014/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwczh1UnBBRRAB",
            "reviewer_name": "Casey Bakker",
            "rating": 5,
            "review_text": "First time ordering my supplies on line. Everything arrived well packaged and in good condition. I used to go to the store in Bby, which was always a great experience, but with that stores closure the travel to the Van store is a little too far.  Always a good experience purchasing from Aprils, and will continue to do so albeit   online for my supplies.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:23.234761",
            "response_from_owner_text": "Thanks very much Casey, for the most splendid review of our performance. We are delighted you assisted us to find a way to still provide you quality livestock and supplies as closing Burnaby was a sore one however your continued support does not go unnoticed. Thanks for everything cheers Casey.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:23.234761",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110335305940894247078/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaHQ3T3lnRRAB",
            "reviewer_name": "GrandMassive",
            "rating": 5,
            "review_text": "I havent been to the store in person but Ive made a couple orders online. The shipping was fast and they were helpful and quick to respond to my email when I had a question. Also they carry Easy Green and Aquarium Co-Op products which is awesome.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:23.237459",
            "response_from_owner_text": "Hi,  You are awesome for providing this fantastic review and we are delighted you are happy with our offerings / service and support.  Thanks for everything and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:23.237459",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110097081595768045695/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNkl6NzB3RRAB",
            "reviewer_name": "Jason W",
            "rating": 5,
            "review_text": "Visited Aprils Aquarium a few weeks ago to get some supplies (plants, stones, food, and of course shrimp) for my 3rd tank which was also from Aprils - a 15gallon rimless tank which is just perfect. Darrin and Jacob were very helpful and friendly as always...so thank you again! Everything is in place at home now, and my little daughter is so excited to see all the colorful shrimp swimming around and thriving! Also, really glad that they are carrying a nice variety of Aquarium Co-op products now - and love the expanded selection of livestock.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:23.240165",
            "response_from_owner_text": "Hi Jason, thank-you so much for making the time and consideration to provide us a fantastic review. We are delighted you and your family are enjoying and flourishing in our great hobby together and without doubt we appreciate all your support. Please come and visit us again very soon @yourlocalfishstore.",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:23.240165",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118333708465935990424/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNVp2dm5BRRAB",
            "reviewer_name": "Pam Andrews",
            "rating": 5,
            "review_text": "Absolutely the best store for nano fish and planted tanks I have ever seen in my 25+ years in the hobby. An unbelievable assortment of exotic fish, amazing variety of hard scape supplies, and great service. So happy I found this store!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:23.242731",
            "response_from_owner_text": "Pam - wow , this review blew me over. What a fantastic testimony to our small business, we love love love it, thank-you so much.  We are SO happy you found us and so happy we tick all the boxes for you this is our goal and we are always striving to improve products , service and support so to learn we are on the right path is so awesome. Your the best and of course we hope to see you again very soon @yourlocalfishstore.  cheers",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:23.242731",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/116687089488349942658/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoZ1lUUGpnRRAB",
            "reviewer_name": "Jordan Ng",
            "rating": 5,
            "review_text": "By far one of my top choices for aquarium products and supplies! I have been happily shopping at Aprils Aquarium for well over two years and will continue to do so given the great experience everytime. The store carries a wide array of sought after aquarium brands and products in addition to offering a generous selection of popular and unique freshwater fish species that cater to both the beginner and seasoned aquarists. Additionally, the store quarrantines shipments of livestock, quite rare today, thereby going the extra mile for ensuring the health of customers own aquariums. On top of their exceptional product, Darrin and his exceptional team always provide positive service by truly putting the customers needs first! In a recent interaction at Aprils Aquarium, Darrin compassionately helped accommodate my specific needs to help setup an aquarium and thoughtfully provided item suggestions rather than being pushy. Truly shows the teams patience and compassion to supporting the aquarium industry!",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:15:23.903468",
            "response_from_owner_text": "Jordan , thank-you so much for this outstanding and well thought out review it certainly hits the spot. Our offering is expanding all the time and we are always looking for more positive synergies to compliant our current structure and with that comes more interest and enthusiasm from you the customer in our great hobby which is obviously a win- win, thus we are delighted  with your very positive and reinforcing comments. Thanks again for all your support and patronage and of course I am sure we will see you again soon @yourlocalfishstore",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 01:15:23.903468",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/102641630627497376611/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN1l6b2JREAE",
            "reviewer_name": "Isaac Mazur",
            "rating": 5,
            "review_text": "Absolute hidden gem! Such a fantastic place to go if you are thinking of starting, or wanting to continue, your fish journey. Darrin, and his staff, are incredibly kind and chalk full of good advice when it comes to designing your dream tank! Won t be going anywhere else again. I went in with my girlfriend who needed some plants for her own planted tank, and basically walked out with an entire set up for myself! My betta thanks you, Darrin.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:15:23.907160",
            "response_from_owner_text": "Issac , wow what an outstanding detailed review - thank you so much . We do try our level best and it s great to hear we are meeting our objectives. Always happy to see you both and hope to see you again soon or visit us online @yourlocalfishstore",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:15:23.907160",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/101693223486859552266/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMThYVk5nEAE",
            "reviewer_name": "matt waldner",
            "rating": 5,
            "review_text": "I finally found someone who I can take advice from with my planted tanks!! I will never buy fertilizers or plants from somewhere else other then Darrin!! Outstanding professional service! Ships fast! Quality plants! Huge plants! Healthy looking! And the list goes on and on! Keep it up Darrin!!!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:23.910667",
            "response_from_owner_text": "Thanks very much Matt for the very kind comments. We do try our level best . Thanks for all your support and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:23.910667",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/117417620624513328527/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NXZQU2F3EAE",
            "reviewer_name": "Lauren",
            "rating": 5,
            "review_text": "Best fish store in the lower mainland! I used to shop at the Burnaby location and they were great! I visited this Vancouver location a couple of weeks ago (after the two locations merged) and was blown away! The store is huge and clean and has an excellent selection of fish and supplies. I love that they carry all of the Aquarium Co-Op products -- lots of stock, too! They also have a big parking lot and parking wasnt an issue during busy hours on the weekend. The staff are all super friendly and helpful. I also spent a long time chatting with the owner to troubleshoot issues Im having with my tank. He went above and beyond to help and the suggestions he and the staff gave are working! The fish are always super healthy from here, too! I will definitely continue to be a regular--worth the extra drive even if you dont live nearby.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:15:23.914698",
            "response_from_owner_text": "Lauren , wow what a fantastic detailed review we love it . Can t thank you and all our clients for amazing support. This review ticks all the boxes and we do really appreciate it . Thanks for your continued support and of course we hope to see you again very soon @ yourlocalfishstore cheers",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:15:23.914698",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103604931453266452493/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MFltclJnEAE",
            "reviewer_name": "Jack Wisse",
            "rating": 5,
            "review_text": "First time ordering livestock from Aprils . They shipped packages as promised. They arrived in excellent condition. Great detail to packages. Any questions I had were answered in a timely manner.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 01:15:23.919263",
            "response_from_owner_text": "Jack,  thank-you for your very valuable business and your most excellent review. We hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-11-01 01:15:23.919263",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/110871954546616826121/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MTdLdXJRRRAB",
            "reviewer_name": "Harry Zhang",
            "rating": 5,
            "review_text": "This Aquarium store is really the only one I go to, Ive got nothing but positive things to say about the staff who works there and the variety of generally everything they have! Everyone there works so hard to keep everything in order and most importantly prioritizes customer needs with warm smiles on their faces. For instance, Jacob would eagerly go out of his way and search through the whole tank to pick out the best apistogrammas for me because I wanted the best parents for my breeding project. Everyone there gives a friendly and welcoming atmosphere, you have to pay them a visit!!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:15:23.925394",
            "response_from_owner_text": "Hi Harry,  what a great and detailed review we cannot thank-you enough for all the very positive comments. We appareicvate all your support and dedication to the hobby and of course your valuable business. Hope to see you again very soon @yourlocalfishstore cheers  to you Harry.",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:15:23.925394",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100464262444826735589/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMFpXTllBEAE",
            "reviewer_name": "Brian Nater",
            "rating": 5,
            "review_text": ":O absolutely stunning store! Fantastic prices, super healthy and unique fish, so many great employees that all know their stuff!!! Just picked up a giant box full of driftwood for a bargain! I could spend hours in this store!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:23.929868",
            "response_from_owner_text": "Brian, this is an absolute belter ( as they say in Scotland) just what the doctor ordered and we are delighted your happy with our overall package. Hope to see you again very soon sir @ yourlocalfishstore and thanks again for all your support.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:23.929868",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116579111811327592350/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MzdYM1FnEAE",
            "reviewer_name": "Klara Huszti",
            "rating": 5,
            "review_text": "I go to this place for all my fish hobby needs since they opened here. They treat me like a friend and family. Any question I had they were answering patiently. I like just walk around and look at the set ups in the tanks at front. So much so that I wanted to set up a cube tank. Today when I told they they gave me one free evendough I didnt have enough points yet. Today I mentioned that my drift wood too long and I wasnt able to cut it, rightaway they told me to bring it in and they will cut it for me. Thank you. Just made my week. Lol Thank you so much for making me so happy. This is a great way to keep your costumers happy and keep coming back Now a couple of years went buy. My opinion  didnt change. They are still very nice to every one  treating you like family. The store is better now. Display tanks are amazing. So much so that I copied their style. The fish supply is endless. Plenty of plants to make your tanks georgous. I think I can say this place is the best in town for all you needs.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:23.933810",
            "response_from_owner_text": "Klara , thanks very much for the great review we appreciate it very much and we hope to see you again very soon.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:15:23.933810",
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 59,
            "total_number_of_photos_by_reviewer": 374,
            "reviewer_url": "https://www.google.com/maps/contrib/108438677706527354161/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc01lY2NREAE",
            "reviewer_name": "Frank Berkin",
            "rating": 5,
            "review_text": "Ordered online Aug 6.Darrin emailed to let me know the next day was a stat holiday, and would ship Tuesday, which was happened. Recd in 2 days, Vancouver, BC to Kitchener, ON. Everything as ordered. Competitive prices,  #1 super service, and great that they have Aquarium Co-op products.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:23.937083",
            "response_from_owner_text": "Frank - what a review sir - exactly what we strive for and we really appreciate your feedback and of course your valuable support.  Delighted to be of service and support sir and of course we hope to hear from you again very soon @yourlocalfishstore cheers Frank",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:23.937083",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115213250378843487799/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGejg2RzFBRRAB",
            "reviewer_name": "Barry Cherneske",
            "rating": 5,
            "review_text": "Excellent product line with good stock. Shipping is fast and well packaged. The customer service is nothing short of outstanding!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:15:23.942378",
            "response_from_owner_text": "Barry   Outstanding  we will take that sir ! All day long ! Thank-you for your continued support and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-15 01:15:23.942378",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103340779238415106259/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c2M3aU13EAE",
            "reviewer_name": "Jeff Kaufman",
            "rating": 5,
            "review_text": "I placed my first order with April s Aquarium. I must say the process was seamless. Access in Canada to Aquarium Co-Op products is fantastic. -Easy order and payment processing. - delivered well before expected date. - personalized email from the owner checking if I was satisfied with products and service. Don t hesitate to order from this company. They have service nailed down tight. Looking forward to my next order.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:15:25.398952",
            "response_from_owner_text": "Thanks Jeff - what a great review can t thank - you enough, this helps us in our journey for sure and rubber stamps all our efforts are worthwhile and thus rewarding.  Thanks for your continued support and of course we hope to hear from you soon @yourlocalfishstore",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:15:25.398952",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111872852366102989401/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcG9IbG1RRRAB",
            "reviewer_name": "maia toska",
            "rating": 5,
            "review_text": "Great shop! The tissues cultures I ordered shipped fast and are in great condition. Will be shopping here again :)",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 01:15:25.402819",
            "response_from_owner_text": "Maia, Thank-you very much for making the time to provide a top notch review of our services. We really do value your business and support and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 01:15:25.402819",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110529153694052365186/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaM2ZDQUJREAE",
            "reviewer_name": "Free Man",
            "rating": 5,
            "review_text": "Great online service.  They have good prices and they went above and beyond to make sure my order arrived promptly and correct.  I will definitely be ordering from here again  : )",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:15:25.406417",
            "response_from_owner_text": "Thank-you sir for the very kind and rewarding review we do appreciate it very much. Please visit us again soon online or even better in person , if you are ever in Vancouver pop by and say hi we are very close to the Airport. Thanks for all your support, cheers  yourlocalfishstore",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:15:25.406417",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 74,
            "total_number_of_photos_by_reviewer": 22,
            "reviewer_url": "https://www.google.com/maps/contrib/109764016508166040160/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM0kybXB3RRAB",
            "reviewer_name": "Ron Santico",
            "rating": 5,
            "review_text": "Good customer service and knowledge. Its an added comfort to know that staff are knowledgeable with the livestock they offer. Ive only been in the hobby for a few months and very likely Ill be doing more business here.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:15:25.409901",
            "response_from_owner_text": "Hi Ron, Thank-you for your excellent review and your kind words. We hope of course to see you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:15:25.409901",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105240845964266174805/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKakpiRGxRRRAB",
            "reviewer_name": "Lisa Powley",
            "rating": 5,
            "review_text": "Recently ordered plants. Healthy and happy. Have placed orders in the past, and look forward to many future orders.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:15:25.412846",
            "response_from_owner_text": "Lisa, thank-you so much for the 5 stars and your support. We are delighted you are happy with our services and of course we hope to hear from you again soon @yourlocalfishstore",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:25.412846",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/103659212675239329597/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbzgtUzlnRRAB",
            "reviewer_name": "Jessica Willens",
            "rating": 5,
            "review_text": "Amazing store with a lot of options for nano aquariums.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:25.415804",
            "response_from_owner_text": "Thanks Jessica for the fantastic review we do try our best and we are delighted with your valued comments . Thanks for all your support and hope to see you again very soon @yourlocalfishstore cheers",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:25.415804",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 225,
            "total_number_of_photos_by_reviewer": 1615,
            "reviewer_url": "https://www.google.com/maps/contrib/109716470805171574844/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOWRUS3hRRRAB",
            "reviewer_name": "Kaitlyn Thurstan",
            "rating": 5,
            "review_text": "Purchased some plants, shrimp and substrate as apart of the delivery order to west Kelowna! Everything is absolutely amazing and the whole process was very smooth and saved me having to drive farther (40+) minutes or even to Aprils Aquarium which is a 3hr drive from me! I only had to drive about 5 minutes which is always nice to have this option and all the items they carry in a more local setting. Attached is a picture of all the plants, shrimp and substrate that was purchased!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:15:25.418856",
            "response_from_owner_text": "Kaitlyn - we are delighted you are happy with the service and quality of our livestock it s what we drive for and your very positive review just enforces that. Hope to see you again on our next road trip. If your ever in Vancouver we are near YVR so pop in say hello. Cheers and thanks again .",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:15:25.418856",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/103050898073010072443/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN2R1VzFRRRAB",
            "reviewer_name": "Derrick Whittet (Wintersdark)",
            "rating": 5,
            "review_text": "Fantastic experience, availability of products hard to find here in Canada (aquarium co-op products particularly), super fast shipping and good prices.  Ill definitely shop here again!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:15:25.421467",
            "response_from_owner_text": "Thanks Derrick for the fantastic review sir. Yes we are the sole retail partner in Canada for Aquarium Co-Op Premium Products, so no problems now on availability for you.  We pride ourselves in customer service and that includes fast shipping / fair pricing and of course  any issues or concerns we have you covered. Thanks for all your supprt and of course we hope to hear from you again very soon @yourlocalfishstore",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:15:25.421467",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 128,
            "total_number_of_photos_by_reviewer": 49,
            "reviewer_url": "https://www.google.com/maps/contrib/107450791902333484939/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKanRDd3hBRRAB",
            "reviewer_name": "Sheesha",
            "rating": 5,
            "review_text": "My first experience buying fish online. I visited the old Burnaby location under previous management and had mixed reviews. I am a dedicated loach keeper (since 2013) and saw dwarf chain loaches available in Vancouver. Incredibly good communication.Ordered online and couldnt sign in.  And then a Scottish man showed up at my house asking if I had a snail problem. So much more polite than asking if I have a loach problem.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:15:25.424351",
            "response_from_owner_text": "Hi Shessa, Thank-you so much for the glowing review. We do try our best and glad you are happy about  our overall offering. Yes on the snail problem :-) of course chainloaches are infamous for eating ramshorn snails etc. so thought that was why you were buying them having a loach problem is also good you know were we are :-) Thanks for all your support and hope to hear from you soon @yourlocalfishstore. cheers",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:15:25.424351",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111116172155964346986/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4X3RPTjRnRRAB",
            "reviewer_name": "Thanh Van Fehr",
            "rating": 5,
            "review_text": "Fantastic establishment with great customer service! Darrin was so friendly and super helpful and patient with all my questions. They have a great selection of products and I was able to get all the supplies I needed and it was shipped to me in Edmonton so quickly, which I greatly appreciated! I ll definitely make sure to come back for any of my aquarium needs. :)",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:15:25.426912",
            "response_from_owner_text": "Thanh, fantastic, great ,super helpful, patient , great, quickly . Wow so many positive adjectives we just love it , thank you so much for the fantastic review and of course your valuable business. Hope to hear from you again soon Thanh @yourlocalfishstore   cheers",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:15:25.426912",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109419115529596007164/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}