{
    "place_id": "ChIJhcthA192hlQRk5xaAAH7RTg",
    "reviews": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MHRLeEJ3EAE",
            "reviewer_name": "Michelle Grodecki",
            "rating": 5,
            "review_text": "I was impressed with the hotel from the moment I entered the door. The staff was extremely friendly and helpful. The little touches left in my room as a welcome made me feel like my business was appreciated. A nice breakfast brunch was included in the stay which was a nice addition.  The only criticism Id give was the room was marketed as top floor city view and my window literally looked out onto the roof. Not much of a city view however the room itself was quite nice. Lots of great amenities near by including a very large shopping mall and the metro station. Nearby activities: Many restaurants and shopping. Safety: Doors are locked to the hotel at all times.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:39.218201",
            "response_from_owner_text": "Dear Michelle Grodecki, Thank you for choosing us, we appreciate your positive feedback about we did to welcome you and our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Michelle Grodecki. Scott J General Manager",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-25 05:07:39.218201",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 165,
            "total_number_of_photos_by_reviewer": 88,
            "reviewer_url": "https://www.google.com/maps/contrib/110066947087302463113/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGemJLaVhREAE",
            "reviewer_name": "Tina Dolor",
            "rating": 5,
            "review_text": "Reading those past reviews of unhappy customers makes me think they were in the wrong hotel. My family and I booked a room but at the last minute had unexpected guests coming with us. Brandon at the front desk was very pleasant to remind the hotel policy  that we cant be all in the same room. He offered we get another room at the lowest discounted price he could give us. I also got the first room with the extra pillows as I requested weeks ahead. Holiday Inn is the best property for me!",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-04 05:07:39.220877",
            "response_from_owner_text": "Dear Tina Dolor, We really appreciate the time dedicated and thank you for all the feedback and comments on your last stay. Great to hear that you found our staff friendly and helpful and now we know that we are not the only ones who loves Brandon. He is so nice, right? We are glad to hear that we could make such as good experience for you and you enjoy your stay as a result. We look forward to your next visit Tina Dolor. Scott J General Manager",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-11-04 05:07:39.220877",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103430277802414976246/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMDlmRFl3EAE",
            "reviewer_name": "Francis S",
            "rating": 5,
            "review_text": "Looks recently renovated so it s clean and modern. Super friendly people at the front desk, housekeeping and breakfast area on the second floor. Quick note on the light switches, there s one in the room that s really hard to find and it controls the lighting above the bed - see the uploaded picture for a tiny black switch next to the wall power outlets. Free parking underground is great and easy to access using the hotel elevators. If you get there late evening, you will need your hotel key card to open the gates. It s also part of a shopping mall so you have access to lots of food options. Looking forward to a return trip!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-25 05:07:39.223358",
            "response_from_owner_text": "Dear Francis S, Thank you for all the feedback and comments on your recent stay. Great to hear that you were able to get around easily, you found our staff friendly and helpful and you enjoyed your stay very much. We look forward to your next visit Francis S. Scott J General Manager",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-25 05:07:39.223358",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 235,
            "total_number_of_photos_by_reviewer": 219,
            "reviewer_url": "https://www.google.com/maps/contrib/102076226617465185330/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdkxLOHJ3RRAB",
            "reviewer_name": "Ivan Veljkovic",
            "rating": 5,
            "review_text": "This is one of the best Holiday Inns in Canada, with a central location, fantastic staff (Anja is a superstar!), safe underground parking and a great open space pool. Breakfast is decent too, and the kitchen staff is also amazing, especially considering how difficult it is to please everyone during breakfast time when the hotel is the busiest. Walkability: Short walk to shopping centre and metro town sky train station.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-25 05:07:39.225880",
            "response_from_owner_text": "Dear Ivan Veljkovic, We really appreciate the time dedicated by and thank you for all the feedback and comments on your last stay. Great to hear that you found our staff friendly and helpful and now we know that we are not the only ones who loves Anja. She is so nice, right? We are glad to hear that we could make such as good experience for you and you enjoy your stay as a result. We look forward to your next visit Ivan Veljkovic. Scott J General Manager",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-25 05:07:39.225880",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 165,
            "total_number_of_photos_by_reviewer": 368,
            "reviewer_url": "https://www.google.com/maps/contrib/108419879462656844562/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcUtDbDJBRRAB",
            "reviewer_name": "BIll McN",
            "rating": 5,
            "review_text": "Holiday Inn Express has come a long way from the first one I stayed in many years ago. Room was large, quiet and king size bed was very comfortable. Breakfast choice was expansive and very tasty. LRT station is across the street with easy access and large mall is all around. If you are coming to Burnaby this is the place to stay.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-25 05:07:39.228379",
            "response_from_owner_text": "Dear BIll McN, Thank you for all the feedback and comments on your recent stay. Great to hear that you were able to get around easily, you found our staff friendly and helpful and you enjoyed your stay very much. We look forward to your next visit BIll McN. Scott J General Manager",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-25 05:07:39.228379",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100799818641087557166/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadDZfVFZ3EAE",
            "reviewer_name": "Boris",
            "rating": 5,
            "review_text": "We liked it a lot, very friendly & accomodating staff, we stayed there for a few days to visit Vancouver and its surroundings. The pool is small but its pretty neat to be in the middle of metrotown. And the sky train is litteral accross the street. The price wasnt OK though, we booked kinda last minute but it was a little too expensive nevertheless...",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-25 05:07:39.230640",
            "response_from_owner_text": "Dear Boris, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Boris. Scott J General Manager",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-25 05:07:39.230640",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 65,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/114798836129570826228/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeEpuZEdREAE",
            "reviewer_name": "Warrant",
            "rating": 5,
            "review_text": "Reminds me very much of the hotels in Tokyo, very central and close to everything you could ever want or need as a traveler. Every ethnic type of food is a few minutes walk, rapid transit outside the front door, breakfast included (really good selection), very walkable with a massive city park within blocks, no need to drive for anything Rooms: Clean and quiet depending on the side of the hotel you are on since one side faces the elevated rail line transit station. Train traffic is constant and does produce considerable noise for some people Nearby activities: Central park has a rubberized soft surface trail around most of its circumference making it idea for running, many trails for cycling. Swimming pool in hotel. Safety: Very central location, lots of street lighting, lots of people about, friendly people about, low volume of homelessness visible Walkability: 10 minutes walk to Central Park (220 acres of forest, ponds, mini golf, trails, kids park) 2 minutes walk to over 300 stores in Metrotown Mall 1 - 5 minutes will get you to at least 50 restaurants Food & drinks: The whole area is very Asian food centric, however you can get great Italian (Trattoria Burnaby) Westcoast (Earls, Cactus Club)",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-25 05:07:39.233022",
            "response_from_owner_text": "Dear Warrant, Thank you for your comment on your last stay. Great to hear that you enjoyed your stay very much, we really like the location as well. We look forward to your next visit Warrant. Scott J General Manager",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-25 05:07:39.233022",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 434,
            "total_number_of_photos_by_reviewer": 58,
            "reviewer_url": "https://www.google.com/maps/contrib/110789599615331268742/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOC1pd21RRRAB",
            "reviewer_name": "Kedar Apte",
            "rating": 5,
            "review_text": "Awesome hospitality Really nice rooms , I booked non smoking Very good staff, Good complementary breakfast, no need to go out for breakfast. Perfect location.... I rented car but you dont have to ... Skytrain and bus service are  just across the street. Buy daily pass and njoy any public ride for $11 a day. Highly recommend this place for family vacation.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-25 05:07:39.235616",
            "response_from_owner_text": "Dear Kedar Apte, Thank you for all the feedback and comments on your recent stay. Great to hear that you were able to get around easily, you found our staff friendly and helpful and you enjoyed your stay very much. We look forward to your next visit Kedar Apte. Scott J General Manager",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-25 05:07:39.235616",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109826940459555955895/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGemFIdmJBEAE",
            "reviewer_name": "Neil Sharma",
            "rating": 5,
            "review_text": "Very clean and great service. Breakfast is nice. Location is perfect right at the mall. Everything is nearby",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-04 05:07:39.238744",
            "response_from_owner_text": "Dear Neil Sharma, Thank you for your comment on your last stay. Great to hear that you like our cleaning standards, breakfast and you enjoyed your stay very much, we really like the location as well. We look forward to your next visit Neil Sharma. Scott J General Manager",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-11-04 05:07:39.238744",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 663,
            "total_number_of_photos_by_reviewer": 2477,
            "reviewer_url": "https://www.google.com/maps/contrib/104600421800749976343/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cXVXb0tREAE",
            "reviewer_name": "Irene Diep",
            "rating": 5,
            "review_text": "One of the best ihg hotel experiences Ive had so far. Arrived at around 1 am due to our over delayed flight with two crying toddlers. The man checking us in was helpful and patient,  gave extra snacks - if youve ever traveled with kids, you know snacks are are king. Room was clean and had good amount of room, shower had good pressure. Location was handy, its right across the street from the skytrain (half hour train ride to CBD). Located as apart of the metro mall, right next to the crystal mall. Tim Hortons and starbucks right at entrance. Great complimentary breakfast, well staffed and good amount of room. I would definitely stay here again and reccomend it.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-25 05:07:39.242577",
            "response_from_owner_text": "Dear Irene, Thank you for all the feedback and comments on your recent stay. Great to hear that you were able to get around easily, you found our staff friendly and helpful and you enjoyed your stay very much. We look forward to your next visit Irene. Scott J General Manager",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-25 05:07:39.242577",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 70,
            "total_number_of_photos_by_reviewer": 14,
            "reviewer_url": "https://www.google.com/maps/contrib/113184316425910580968/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cWVhNW9RRRAB",
            "reviewer_name": "Lovelle Jamaca",
            "rating": 5,
            "review_text": "This hotel is close to metrotown and sky train. We enjoyed our stay here, staff were friendly and accomodating especially Michelle. Also breakfast kitchen staffs were efficient, friendly and helpful.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-25 05:07:40.017606",
            "response_from_owner_text": "Dear Lovelle Jamaca, We really appreciate the time dedicated by and thank you for all the feedback and comments on your last stay. Great to hear that you found our staff friendly and helpful and now we know that we are not the only ones who loves Michelle. She is so nice, right? We are glad to hear that we could make such as good experience for you and you enjoy your stay as a result. We look forward to your next visit Lovelle Jamaca. Scott J General Manager",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-25 05:07:40.017606",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109728248216084053779/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScmZYZ09BEAE",
            "reviewer_name": "Susan Rabb",
            "rating": 5,
            "review_text": "This is a 2 Star hotel, but Id rate it a 3+. Large, clean rooms, great water pressure in shower, quiet interior, lots of helpful staff, good security, free breakfasts, perfect location, well stocked gym, and very accessible to restaurants and stores. Will definitely be staying here again.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-25 05:07:40.020340",
            "response_from_owner_text": "Dear Susan Rabb, Thank you for your comment on your last stay. Great to hear that you had an exceptional service, amenity and our staff made a great impression for you. We look forward to your next visit Susan Rabb. Scott J General Manager",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-25 05:07:40.020340",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102462759204955370896/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaHBfcGlRRRAB",
            "reviewer_name": "Roger King",
            "rating": 5,
            "review_text": "I stayed at the hotel for four nights and absolutely loved it! It was conveniently located near everything in Metrotown, and the staff were incredibly friendly. As an IGH Platinum member, I felt really welcomed there. The rooms were spotless and felt cozy. The breakfast was delicious, although I did get a bit bored with the same food after a few days. The only downside was the late checkout; even though I requested late checkout, the system still locked me out of my room around 11am and even the staff werent able to unblock it without the master key.",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-25 05:07:40.023227",
            "response_from_owner_text": "Dear Roger King, Thank you for all the feedback, kind words and comments on your recent stay. Great to hear that you were able to get around easily, you liked our cleaning standards and you found our staff friendly and helpful and you enjoyed your stay very much. We look forward to your next visit Roger King. Scott J General Manager",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-01-25 05:07:40.023227",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/116216350286270604930/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOHRyZXVRRRAB",
            "reviewer_name": "peter due",
            "rating": 5,
            "review_text": "Very professional staff. Always treat me as a valued guest every time I visit. Service from this location is consistantly superior.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:40.025627",
            "response_from_owner_text": "Dear Peter due Thank you for your comment on your last stay. Great to hear that you had an exceptional service and that is something pretty much appreciated by you, glad to hear our staff always made a great impression for you. We look forward to your next visit Peter due Scott J General Manager",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-25 05:07:40.025627",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101252709695610032779/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOXZqQ1BREAE",
            "reviewer_name": "Melissa Helanna",
            "rating": 5,
            "review_text": "My boyfriend and I are currently staying the night here, and we absolutely love it. We live a few Cities over, and definitely will have this as our Go-to place to get away. The staff here are outstanding, and the rooms are so clean. The rooms have everything you need and more. Thanks for having us!",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-25 05:07:40.028517",
            "response_from_owner_text": "Dear Melissa Helanna, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Melissa Helanna. Scott J General Manager",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-01-25 05:07:40.028517",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116500581172030398722/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcWJydXFnRRAB",
            "reviewer_name": "Clarissa Taylor",
            "rating": 5,
            "review_text": "I stayed here with my family for about 3 nights. The location is awesome as it s connected to the mall and steps from Walmart. The train station is directly across from the hotel and there are several food options. The staff were very friendly and the rooms were clean with nice views. Breakfast was great with very accommodating staff who helped assist my husband and I in getting our toddlers in high chairs. They even went out of their way to warm milk for them. Wonderful experience!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:40.032245",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/105432618979378369052/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZzluQ19nRRAB",
            "reviewer_name": "Jeff E.",
            "rating": 5,
            "review_text": "It was a great experience. The staff at the front are very friendly and easy to deal with. Got my room quick. I just wish I was able to do an early check in. But all is good. Will definitely recommend this location. A very minor complain was the room. No windows but the quality and finish is great.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:40.034206",
            "response_from_owner_text": "Dear Jeff E, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Jeff E. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:40.034206",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 22,
            "reviewer_url": "https://www.google.com/maps/contrib/115020819082084924559/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaHBpM2d3RRAB",
            "reviewer_name": "Brindan Baskaran",
            "rating": 5,
            "review_text": "I stayed here again with my dad and the service was beyond 5-stars! Not only did they remember that I was here in September 2021, but I also received a thank you card for staying! Monica and the other staff went above and beyond! Theres really nothing to complain. There is construction on the 4th floor, but we couldnt hear anything! Really excited to see how the renovated rooms will look like. This hotel is definitely my go-to place to stay whenever I visit Vancouver :)",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:40.036843",
            "response_from_owner_text": "Dear Brindan, Thank you for the kind words.  We are pleased you chose to stay with us. Warm regards, Scott Johnson General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:40.036843",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/112430844791530754854/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaE96RzdnRRAB",
            "reviewer_name": "Jerry",
            "rating": 5,
            "review_text": "2 nt stay 3/18 and again 3/21. Special thanks to Front Desk Agent Rashani during both checkins for excellent and friendly service and assistance and also acknowledging loyalty status.  And thanks also to Branden on 1st stay and Scott on 2nd for handwritten cards and welcome snacks. Along with professional and friendly service, the property is in nice area close to mall, parks and Skytrain.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-25 05:07:40.040470",
            "response_from_owner_text": "Dear Jerry, We really appreciate the time dedicated by and thank you for all the feedback and comments on your last stay. Great to hear that you found our staff friendly and helpful and now we know that we are not the only ones who loves Roshni and Brandon. We are glad to hear that we could make such as good experience for you and you enjoy your stay as a result. We look forward to your next visit Jerry. Scott J General Manager",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-25 05:07:40.040470",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107656215703164555922/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbG95OUJBEAE",
            "reviewer_name": "Katie Q",
            "rating": 5,
            "review_text": "Staff were all polite and welcoming. The hotel is very clean..our rooms were spacious enough great selection of breakfast items. Great location as well since it s close to the mall and the skytrain.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:40.043409",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 132,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115753912589011021920/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bjVTZy1nRRAB",
            "reviewer_name": "Madison",
            "rating": 5,
            "review_text": "truly the best hotel experience hands down. A home away from home, so welcoming and absolutely beautiful. Has everything you need and want plus more. Also your in the heart of town!! everything is at your fingertips like entertainment, food, stores, night life, transportation and so much more. i never want to leave but can t wait to come back in the future.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:41.035320",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111747533502747891140/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dktqb0NREAE",
            "reviewer_name": "Arash Binesh pajou",
            "rating": 5,
            "review_text": "It was clean and good price. Great location. Also the people  that work there are great specially Jessica at the front desk was amazing. and also Seth, Neil and brandon and the managers were very helpfull and hospitable. Diffently recommand the hotel. They were all great. Also its amazing that you can stream on the tv from your phones netflix or youtube on your rooms tv.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:41.037477",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/111893912531670255159/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbWM2bGJREAE",
            "reviewer_name": "Rafid Jabir",
            "rating": 5,
            "review_text": "Centrally located, easy transportation,  very good services in the area and wonderful staff. The team is great, Kris Samdani provides excellent hospitality management and Michael at the breakfast area is very caring and meticulous. We enjoyed the stay!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:41.039975",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 19,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117610152115186618394/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhanNhRklREAE",
            "reviewer_name": "Road-Have Mercy",
            "rating": 5,
            "review_text": "Excellent staff; friendly, kind, thoughtful and professional. The building was very secure which was appreciated. Close to everything; sky train, mall, restaurants, etc. Secure underground parking for regular height vehicles. The rooms were exceptionally clean and spacious which was a nice surprise! The pool is half shaded, small but clean. This is a great place to bring kids or use as a base to downtown nightlife.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:41.043115",
            "response_from_owner_text": "Dear Road-Have Mercy, Thank you for your comment on your last stay. Great to hear that you enjoyed your stay very much, as staff we really like the location as well. We look forward to your next visit Road-Have Mercy. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:41.043115",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/109259258074978079337/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyemFfY2dnRRAB",
            "reviewer_name": "Lynette Snider",
            "rating": 5,
            "review_text": "The staff here are amazing . Both Scott and Monica went above beyond to make our stay great. From accommodating an early arrival to finding my daughter a quiet place to write her exam. They gave us maps and tips on places to go see. Great rooms, and breakfast.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:41.046227",
            "response_from_owner_text": "Dear Lynette Snider, We really appreciate your time and thank you for all the feedback and comments on your last stay. Great to hear that you found our staff friendly and helpful and now we know that we are not the only ones who loves Monica and also thank you because I got involved in your positive comment. She is so nice, right? We are glad to hear that we could make such as good experience for you and your daughter and you all enjoyed the stay as a result. We look forward to your next visit Lynette Snider. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:41.046227",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109155367283160761132/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSamV1YTB3RRAB",
            "reviewer_name": "arthur lung",
            "rating": 5,
            "review_text": "Great service, great people, only steps away from all the amenities. Great dim sum at neptune seafood palace, make a reservation or wait an hr on the weekends.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-25 05:07:41.048948",
            "response_from_owner_text": "Dear arthur lung, Thank you for your comment on your last stay. Great to hear that you enjoyed your stay very much. Just kindly remind you, neptune not belongs to out hotel property. But the food there is really nice. :) We look forward to your next visit arthur lung. Scott J General Manager",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-25 05:07:41.048948",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 262,
            "total_number_of_photos_by_reviewer": 456,
            "reviewer_url": "https://www.google.com/maps/contrib/110660360642518414394/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeTgzTUZREAE",
            "reviewer_name": "Gail McIntosh",
            "rating": 5,
            "review_text": "Once again we had a lovely stay at the Holiday Inn metrotown.  The staff is what makes the stay so enjoyable. Everyone is  welcoming, friendly and always has a pleasant greeting.  Without fail everyone will wish us a good day, ask us if we need anything etc. I think the breakfast staff is our favorite. Both Maria and Melba recognized us from previous visits and absolutely went out of their way to be sure we were well looked after.  I have a fairly severe gluten allergy and they have bent over backwards everytime time to make sure I dont go hungry and have a breakfast with no gluten! Thank you Maria and Melba. You keep us coming back! Gail McIntosh and Dennis Wilson",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:41.051831",
            "response_from_owner_text": "Dear Gail McIntosh, We really appreciate your time and thank you for all the feedback and comments on your last stay. Great to hear that you found our staff friendly and helpful and now we know that we are not the only ones who love Maria and Melba. They are so nice and kind, right? We are glad to hear that we could make such as good experience for you and you enjoyed your stay as a result. We look forward to your next visit Gail McIntosh, Maria, Melba and all of us will be happy to see you again! Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:41.051831",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 108,
            "total_number_of_photos_by_reviewer": 68,
            "reviewer_url": "https://www.google.com/maps/contrib/101820150661449713288/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOE5TS2FREAE",
            "reviewer_name": "Cher Crawford",
            "rating": 5,
            "review_text": "My favorite hotel in Van. The friendliest staff on the planet, cozy clean rooms,  continental breakfast, and its connected to skytrain, Metrotown mall by a covered walkway taken from 2nd floor of hotel. Park your car for the weekend for free in their underground parking  and enjoy the city hassle free.  We have stayed here everytime and its always a great trip.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:41.054816",
            "response_from_owner_text": "Dear Irish Blue, Thank you so much for choosing us, we really appreciate your positive feedback about our staff, hotel, location, you really covered everything about our property. We are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Irish Blue. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:41.054816",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/103929008877962227631/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdDR1R25RRRAB",
            "reviewer_name": "World News Today",
            "rating": 5,
            "review_text": "This was one of the best hotels I have stayed at. I really liked the new renovations, they were a nice fit for the location. The beds were very comfy. Room was very clean and spacious, everything that I needed was provided promptly. Staff were great. Facilities were big and spacious as well. I will definitely be coming back here the next time I come to Vancouver!",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:41.057090",
            "response_from_owner_text": "Dear Adam, Thank you for your review and for choosing our hotel. Im happy that you enjoyed your stay and Im looking forward to having you again as a guest in our hotel. Sincerely, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:41.057090",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/100771474028577794190/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNcWRfWlNREAE",
            "reviewer_name": "Robert Blatchford",
            "rating": 5,
            "review_text": "I have stayed in lots of hotels and motels in my life so far.... This place does a lot that is smart and makes sense.. Truly impressed. Far from perfect, but lots of even more expensive hotels could learn from this hotel. Located perfectly, great parking lot, go directly to your room from the parking lot once you have checked in (only with your key-card of course), easy to understand heating/cooling instructions, sturdy grab bar In the shower.... Many other things.. Located perfectly close to Sky train and shopping.. Couldnt be better.. I could go on.. But come see for yourself... Youll love the price..",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:41.059908",
            "response_from_owner_text": "Dear Robert Blatchford, Thank you for taking the time to leave a great review of the hotel. It is truly a pleasure and glad to hear you enjoyed your stay with us. Hopefully we can welcome you back again in near future and once again thank you for choosing Holiday Inn Express Metrotown for your accommodation. Regards, Scott J General Manager",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-25 05:07:41.059908",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 116,
            "total_number_of_photos_by_reviewer": 439,
            "reviewer_url": "https://www.google.com/maps/contrib/110178003565595131433/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeW8zSDFBRRAB",
            "reviewer_name": "Andrew Szeto",
            "rating": 5,
            "review_text": "Great hotel at a great price. The rooms were cleaned and updated. The facility has great amenities and staffs were very friendly and willing to help. This place has free breakfast and free parking while a lot of other hotels need to pay which is our main reason for staying here. Great overall experience.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:41.856213",
            "response_from_owner_text": "Hello Andrew, Thank you for your feedback. We are looking forward to having you with us again. Sincerely, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:41.856213",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 48,
            "total_number_of_photos_by_reviewer": 146,
            "reviewer_url": "https://www.google.com/maps/contrib/113984315635517613651/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMmVmUWV3EAE",
            "reviewer_name": "L Y",
            "rating": 5,
            "review_text": "Lots of choices of restaurants and shopping at this location, I always stay here when I visit Vancouver! Hotel is clean, staffs are very polite and helpful! Breakfast is complimentary! Rooms : 5/5",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:41.859393",
            "response_from_owner_text": "Dear L Y, Thank you for your comment on your last stay. Great to hear that you enjoyed your stay very much, as staff we really like the location as well. Thank you also for made our hotel your home every time you come back! We look forward to your next visit L Y. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:41.859393",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/111246955080865004163/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjazZIS0lREAE",
            "reviewer_name": "Elhadi Hammoutene",
            "rating": 5,
            "review_text": "Excellent service by all the staff at all time ; even exceeding expectations from personal welcome notes from Management, to calls inquiring about well-being by the day staff. Excellent hotel location with access to the Metrotown mall, as well as steps away from the train line. Much appreciated the fitness facility with the outdoor heated pool making exercising even rewarding ! Also, loved the cozy corner rooms ... and treats !",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:41.862211",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104071193714908836969/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJb1llUzlRRRAB",
            "reviewer_name": "James Chen",
            "rating": 5,
            "review_text": "Excellent hotel experience. Recently stayed for short overnight stays here twice. Location is very convenient, right next to Metrotown Centre and right across from the SkyTrain station. I have top elite status with 3 major hotel chains and usually room upgrades with IHG are very minor even as a Spire elite. However on my second stay I was lucky to be upgraded to the suite which was a nice surprise. The bed & blanket were very comfortable for a restful sleep. Bathroom clean and well maintained. The hotel has complimentary parking which is impressive for this area as other competitors in this area dont offer such. The breakfast was relatively good.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:41.867150",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 807,
            "total_number_of_photos_by_reviewer": 7056,
            "reviewer_url": "https://www.google.com/maps/contrib/113836218850872326338/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2el9INGJREAE",
            "reviewer_name": "Chester Umbalin",
            "rating": 5,
            "review_text": "Excellent location. Its connected right to the Metropolis mall. Across the street from the MTrain, but theres parking in the basement. Plenty of restaurants within walking distance. The hotel itself was clean and the staff was great! Outdoor pool and great breakfast spread.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:41.870917",
            "response_from_owner_text": "Dear Chester Umbalin, Thank you for all the feedback and comments on your last stay. Great to hear that you were able to get around easily, we also love the area as staff! We are also glad that you found ourselves friendly and helpful and you enjoy your stay very much. We look forward to your next visit Chester Umbalin. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:41.870917",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 101,
            "total_number_of_photos_by_reviewer": 92,
            "reviewer_url": "https://www.google.com/maps/contrib/107146041047165112014/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNGNlZS1nRRAB",
            "reviewer_name": "Kwangil Martin Lee",
            "rating": 5,
            "review_text": "My wife and I stayed and enjoyed at this hotel for our 12th wedding anniversary a couple of days. The location of the hotel was perfect to connect public transportations such as trains and buses including the free parking lot. Most of all, the room was quite wider and larger to stay than others ever at the same rate. In addition, all staffs were very friendly and kind too much, they made us being surprised too much because they prepared the congratulations card and a box of the sweet chocolate in my room. It was awesome to me and made our delight. It was the best choice in our trip in Vancouver. Many thanks for your concern. We will visit again soon.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:41.874353",
            "response_from_owner_text": "Dear Mr. Lee, It was a pleasure having you and your wife with us. Our staff was very happy in assisting you with your tour. We hope you have enjoyed and had a great time. We will wait for you next year! Sincerely, Scott J General Manager",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-25 05:07:41.874353",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 237,
            "total_number_of_photos_by_reviewer": 2514,
            "reviewer_url": "https://www.google.com/maps/contrib/100956043158719738215/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaWVfaFFnEAE",
            "reviewer_name": "Garrett Esau",
            "rating": 5,
            "review_text": "My recent stay at the holiday inn Express metro town was nothing less than awesome. Ive stayed here many times for to work related events and I have never been let down. This time was especially memorable as I had to travel on my birthday alone without my family. Seth at the front desk wish me a very warm happy birthday with a hand shake which was great. I went to my room and left to grab some dinner. I came back later to a platter of fresh fruits and muffins and a very nice hand written happy birthday card signed by Seth for himself and the staff at the holiday inn Express. It was very much appreciated and heart warming that some people would still go out of their way for a complete stranger to make them feel special. Thank you again Seth and the rest of the staff at the holiday inn Express metrotown. I look forward to my next stay!!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:41.877595",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 27,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/115067050300737540690/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdmN1cmpBRRAB",
            "reviewer_name": "Gordon Underwood",
            "rating": 5,
            "review_text": "We stay here regularly and have for years now felt like my review might be a bit biased because we are fond of the staff who always seem happy to see us, and eager to help us meet our accommodation needs. Seth  and many other members of their team have treated us like family and we value the kind of hospitality that leaves feeling mutually valued, and taken care of. Thanks to all the staff that have contributed to the value of our experience. Also feel quite secure here, have never had a problem with theft or vandalism, knock on wood.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:41.880056",
            "response_from_owner_text": "Dear Gordon Underwood, Thank you for taking the time to leave a great review of the hotel and our staff. It is truly a pleasure and glad to hear you enjoyed your stay with us. Hopefully we can welcome you back again in near future and once again thank you for choosing Holiday Inn Express Metrotown. Regards, Scott J General Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-25 05:07:41.880056",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 54,
            "total_number_of_photos_by_reviewer": 56,
            "reviewer_url": "https://www.google.com/maps/contrib/116463051096638588678/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOHBXbUVnEAE",
            "reviewer_name": "Caitlin Vanderlende",
            "rating": 5,
            "review_text": "The room faced out back so it was very quiet (aside from noisy neighbours). Sheets and room very clean when we arrived, breakfast selection is fantastic, location is ideal for proximity to public transportation and shopping. Only downside is that parking area is not locked or closed to public.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-25 05:07:41.882438",
            "response_from_owner_text": "Hello Caitlin, Thank you so much for your review of our hotel. I am pleased to hear you enjoyed your stay with us. Its something our staff takes great pride in, so we value your feedback. We hope you will visit us again. Sincerely, Scott J General Manager",
            "response_from_owner_ago": "7 years ago",
            "response_from_owner_date": "2016-11-25 05:07:41.882438",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115278353924011241691/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeDlMbVZnEAE",
            "reviewer_name": "Josh Kynoch",
            "rating": 5,
            "review_text": "Brought a 40+ Students school group to the hotel and the staff was amazing. Place was clean and comfortable and the location was great. Would gladly come again.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:41.885421",
            "response_from_owner_text": "Hi Josh, Thank you for the kind words.  We are all pleased that everything was great.   See you again soon. Scott Johnson General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:41.885421",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115036939012332183160/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aGVfanF3RRAB",
            "reviewer_name": "Rachel Yeh",
            "rating": 5,
            "review_text": "A hotel with nice service and excellent location!! (Just about 2 mins away from the sky train station, bus station and a big shopping center) Another plus is it s clean! Definitely recommend.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:42.693102",
            "response_from_owner_text": "Dear    , Thank you for your comment on your last stay. Great to hear that you enjoyed your stay very much, as staff we really like the location as well. We look forward to your next visit    . Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:42.693102",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 27,
            "total_number_of_photos_by_reviewer": 62,
            "reviewer_url": "https://www.google.com/maps/contrib/118288558542857396105/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncnBTaDRnRRAB",
            "reviewer_name": "Patricia Cameron",
            "rating": 5,
            "review_text": "Located at Metrotown Mall which is awesome. Super close to sky train station, making access to city centre convenient. Friendly staff. Comfortable beds. Accommodated our request promptly for extra linens. We often stay at this hotel.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:42.695875",
            "response_from_owner_text": "Dear Patricia, Thank you for staying with us again. We appreciate your loyalty and your continued trust in our hotel and our staff. Sincerely, Scott Johnson General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:42.695875",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114458607028849290234/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnZzZYbTFRRRAB",
            "reviewer_name": "Zhou YU",
            "rating": 5,
            "review_text": "Convenient location, free parking, easy access to many interesting sites. Not far away from the Central Park. Property well maintained and things are pretty new. Swimming pool and gym are fine. Breakfast options are limited, no much different from those in the U.S.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:42.699141",
            "response_from_owner_text": "Hello Zhou Yu, Thank you for this 5 star review. We are glad you could have a pleasant experience with us. We are lookimg forward to having you again. Sincerely, Scott J General Manager",
            "response_from_owner_ago": "7 years ago",
            "response_from_owner_date": "2016-11-25 05:07:42.699141",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 787,
            "total_number_of_photos_by_reviewer": 1127,
            "reviewer_url": "https://www.google.com/maps/contrib/103655459909617370802/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3aU5uUk53EAE",
            "reviewer_name": "Jacquie J",
            "rating": 5,
            "review_text": "My family and I travel and stay here monthly, comfortable rooms, floors and staff! Key access to floors, breakfast is excellent, must have coffee! Parking available and transit buses and skytrain is across the street. Shopping centre is all around, quite at nights good sleep!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:42.701552",
            "response_from_owner_text": "Thank you for the perfect rating Jacquie. It is always a pleasure to have you with us! Regards, Scott J General Manager",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-25 05:07:42.701552",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103656078684292970833/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeThQSWpRRRAB",
            "reviewer_name": "Michael Vermeersch",
            "rating": 5,
            "review_text": "Great location and friendly staff. The rooms are spacious and clean. Modern well appointed fixtures and finishes throughout.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:42.704940",
            "response_from_owner_text": "Dear Michael Vermeersch, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! Also great to hear you liked our spacious and modern rooms. We hope your next stay is just around the corner, looking forward to welcoming you back soon Michael Vermeersch. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:42.704940",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 54,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/115087422936465002906/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdllPT0FREAE",
            "reviewer_name": "C w",
            "rating": 5,
            "review_text": "I personally stayed years ago but i111ts changed.  It was nice quiet. Prices a little high for one person. I really enjoyed stay alot.  Some hairs in bed but that goes for any hotel cause of laundry.  Would have liked gift shop or restraunt pub for evenings but again it still was awesome.   For all the funny things that went wrong, and I mean alot, I would come back in heartbeat.  For me all staff were awesome, especially security man wow unreal and the front desk girl from nightshift.  Other staff w hmmm",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:42.708317",
            "response_from_owner_text": "Hi Cassie, Thank you for all this feedback. I apologize for the inconveniences you encountered. If you wish to share more with me, reach me at gm@himetrotown.ca Regards, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:42.708317",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 34,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/111350144831682461162/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MW9YRjZnRRAB",
            "reviewer_name": "Lauren Boynton",
            "rating": 5,
            "review_text": "The staff are very friendly and attentive. They always greet you when you come through the lobby. I have an ihg card with them and got upgraded to a higher floor which was nice. I did have a little issue with the T.V which I mentioned. When I came back from the conference I had a different T.V which made me very happy when it worked correctly! Also a great location if you go shopping at metrotown. I have a habit of not trying clothes on at the store, so it was extremely easy for me to jump a few steps, return, and re-shop!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:42.710640",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 50,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/110698040834356071364/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzX1AtelR3EAE",
            "reviewer_name": "John Miles",
            "rating": 5,
            "review_text": "Great service. Stayed here while working in a job for 1 week. Breaky was great. Rooms were clean. Top notch. Wish they had of not cancelled my room and made me switch hotels to the Ramada in coquitlam due to a double booking. I wont hold it against them. Place was nice. 2 blocks from jinya Raman house. Eat noodles and be happy.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:42.713437",
            "response_from_owner_text": "Dear John Miles, Thank you for taking the time to leave a great review of the hotel and we are glad to hear you enjoyed your stay with us. we sincerely hope that we can welcome you back again in near future and once again thank you for choosing Holiday Inn Express Metrotown for your accommodation. Regards, Scott J General Manager",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-25 05:07:42.713437",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 77,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106887819640616562598/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbDRfWEx3EAE",
            "reviewer_name": "Kyle Clarke",
            "rating": 5,
            "review_text": "15 second walk from Metropolis @ Metrotown, skytrain, bus system etc. Very convenient location. Friendly staff, decent rooms, and awesome free breakfast. Very good value for money. Everything was on point except for one thing....Finding something to watch on the TV in our room was nearly impossible because they do not have an interactive guide included in the Shaw Cable  business  package they subscribe to. This made watching anything on TV tedious and difficult. Please fix ASAP :) Other than that, outstanding stay! Would highly recommend.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:42.716715",
            "response_from_owner_text": "Thank you Kyle, the TV issue is already being addressed. We appreciate your feedback and hope to see you again. Regards, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:42.716715",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106084327876372954293/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaTc3Z19nRRAB",
            "reviewer_name": "Eric Reinhardt",
            "rating": 5,
            "review_text": "I cant speak for the other reviewers but one of those reviews is so far fetched and exaggerated that I am having a hard time understanding the disconnect in service. I travel weekly for Business, for the next 3 months I am in Vancouver visiting different clients within BC. I am an IHG member and have stayed in almost every property in BC. That being said, I had a great experiences at every location, but I had a superb experience at the Metro-town location. I arrived in the afternoon cranky, Lisa at the front desk didnt break a sweat, even with the pending 3rd party approval she promptly got me into a room. Upon opening the door to my room, I was greeted with the lingering stench of a smoker. A quick phone to the front desk and I found myself upgraded to the only available room left, the Executive Level. Needless to say, I was more than obliged. The hotel offers all the same amenities of Holiday Inn Suburbia Express at a convenient downtown location. The hotel is practically adjacent to the Metrotown Center and offers free valet parking, high speed internet access, and complimentary breakfast. That being said, there are a few areas of improvement: - Executive rooms should have wireless routers in the room, moving past the bed became an internet dead zone for wireless access. - The Danby refrigerators are loud: I wasnt sure if mine was on the way out, but I have noticed this problem in many other Holiday Inns as well. - Not a fan of the food choices for the continental breakfast, not a fan of free processed breakfast in general. - This is 2013, would it hurt to modernize the business areas or bedside tables with USB ports or radios to plug our USB smart phones into? I typically find most plugs are eaten up by Clunky hotel fixtures and why are desks so high but the Task chairs are like reverse booster chairs? (Also a problem in most hotels) All in all, I was very happy with this location and I am planning on staying here again this weekend and possibly next week as well.",
            "published_at": "10 years ago",
            "published_at_date": "2013-11-25 05:07:42.718891",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104934908205538338487/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoZ05uUTJBRRAB",
            "reviewer_name": "Darryl",
            "rating": 5,
            "review_text": "I was here with my girlfriend for valentines, I just wanted to make a comment on how amazing the service was during breakfast. I felt like a king.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-25 05:07:43.646163",
            "response_from_owner_text": "Dear Darrel T, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Darrel T. Scott J General Manager",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-25 05:07:43.646163",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111960634909109244953/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvbWU2cHpBRRAB",
            "reviewer_name": "Philip Marantica",
            "rating": 5,
            "review_text": "Great location in this mecca of a retail and restaurant area! Walking distance to Central Park, tons of dinner restaurants and the mall. Friendly and professional staff, clean rooms, standard HIE breakfast fare, good windows that showcase the area without the noise of busy streets.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:43.649753",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 129,
            "total_number_of_photos_by_reviewer": 49,
            "reviewer_url": "https://www.google.com/maps/contrib/111703507491293902091/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdDV5dzhBRRAB",
            "reviewer_name": "Julie Loehndorf",
            "rating": 5,
            "review_text": "Great place to stay.  Location cant be beat with Metrotown next door and Skytrain across the street.  Surrounded by good restaurants too.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:43.651881",
            "response_from_owner_text": "Dear Julie Loehndorf, Thank you for your good comments on your last stay. Great to hear that you enjoyed your stay very much, our staff really like the location as well. We look forward to your next visit Julie Loehndorf. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:43.651881",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 36,
            "total_number_of_photos_by_reviewer": 12,
            "reviewer_url": "https://www.google.com/maps/contrib/113943643065780161272/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOV9QRmdBRRAB",
            "reviewer_name": "Bluish Kornerz (bluishicicles)",
            "rating": 5,
            "review_text": "I went to an event at the holiday inn express next to metrotown because I assumed there was no parking there I parked at metrotown but in fact the parking was free for event goers as well as long as the license plate was recorded which is a bonus. Being next to metrotown would also be a bonus for the stayers as it is quite a central area and next to the hotel was a bus hub and skytrain station which is just great for out of town guests. The room where the event took place was called Fraser ballroom on the third floor. It was easy to find because right at the front are the posted events, the room the event was being held and the floor it was located at. The elevators were well kept and well lit and when the doors opened the events were posted right there again and next to it was the direction of each room. This made everything easy to find which helps the time crunch individual. Overall it was super well organized.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-25 05:07:43.654579",
            "response_from_owner_text": "Hi Bluish, Thank you so much for your review of our hotel. Our free parking for meeting attendants is definitely a plus. I am glad to hear all went well on your event. We hope you will visit us again. Sincerely, Scott J General Manager",
            "response_from_owner_ago": "7 years ago",
            "response_from_owner_date": "2016-11-25 05:07:43.654579",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 47,
            "total_number_of_photos_by_reviewer": 89,
            "reviewer_url": "https://www.google.com/maps/contrib/110629891112370542259/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnekp2eFZnEAE",
            "reviewer_name": "Jessica Williams",
            "rating": 5,
            "review_text": "Located right next to the train so it is easy to get around. The staff is so very nice!!! I checked out at 4 AM and the front desk had ready to go breakfast. Exceptional experience!",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:43.657203",
            "response_from_owner_text": "Hi Jessica, Thank you for your feedback. I will make sure to share it with our staff. Hope to see you again. Regards, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:43.657203",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 44,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/105205934976868304677/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MVlLb1pREAE",
            "reviewer_name": "Everton Marcelino Jr.",
            "rating": 5,
            "review_text": "The Hotel is pretty much what you need for a good stay. Good room service, the breakfast is okay, but dont expect something outside of the traditional American one. Id recommend it!",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:43.660316",
            "response_from_owner_text": "Thank you for the comments Everton. I hope you can stay with us again. Regards, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:43.660316",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 78,
            "total_number_of_photos_by_reviewer": 504,
            "reviewer_url": "https://www.google.com/maps/contrib/114320924882308784033/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneTlhUXFnRRAB",
            "reviewer_name": "Cameron Haley",
            "rating": 5,
            "review_text": "Awesome!! Best continental breakfast Ive been to. They have eggs, pancakes, sausage, hash browns, cereal, toast, bagels, yogurt, muffins, cinnamon buns, oatmeal, coffee, tea, orange juice, apple juice, bananas, apples, etc. Free WIFI, fridge and microwave in room. A crib was also provided for our son. Great experience for a reasonable price!!",
            "published_at": "10 years ago",
            "published_at_date": "2013-11-25 05:07:43.663667",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100473254288143327949/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvc1llNTFBRRAB",
            "reviewer_name": "Julian Gonzalez",
            "rating": 5,
            "review_text": "Stayed here in a business trip and it was perfect. All you would expect of the Holiday Inn brand. Free parking is a plus. I was working in Burnaby but its also a good option if your plan is to visit Vancouver. It is literally in front of a SkyTrain station and next to a shopping mall.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:43.667134",
            "response_from_owner_text": "Dear Julian Gonzalez, Thank you for taking the time to leave a great review of the hotel. Glad to hear you enjoyed your stay with us. Hopefully we can welcome you back again soon! Regards, Scott J General Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-25 05:07:43.667134",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 53,
            "total_number_of_photos_by_reviewer": 19,
            "reviewer_url": "https://www.google.com/maps/contrib/101385629369966180971/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dU5hZi13RRAB",
            "reviewer_name": "Trevor Coutu",
            "rating": 5,
            "review_text": "Great location next to the SkyTrain, Metrotown Mall and bus loop. The breakfast bar was included and pretty good as well. The room was nice and I enjoyed my stay.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:43.670275",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/106058853417289221619/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcE5YbWFnEAE",
            "reviewer_name": "Jerry Baldwin",
            "rating": 5,
            "review_text": "Having an awesome stay here at Holiday inn metrotown Vancouver. Many thanks to the wonderful staff for the warm hospitality and above and beyond customer service they have showed me all week. Many thanks for the exceptional customer service I have received from the moment I checked in from Pablo going above and beyond to make sure that my stay has been exceptional. Many thanks also to Seth and Alan for the awesome hospitality.I would strongly suggest anyone spending some time in the Vancouver area to  take a good look at the holiday inn metrotown , Jerry :-)",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:43.672704",
            "response_from_owner_text": "Dear Jerry Baldwin, I want to thank you for taking your time to share your feedback with regards to your recent experience at the Holiday Inn Metrotown Burnaby. Please know that we strive to make each stay as pleasant and comfortable as possible. We use feedback, such as yours, to continuously make changes to our brand to improve the guest experience. Once again, thank you for choosing Holiday Inn Express, and if I can be of assistance to you, please contact me directly at gm@himetrotown.ca Sincerely, Scott J General Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-25 05:07:43.672704",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115479374787472629538/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaFlLQlBnEAE",
            "reviewer_name": "Andrew Tan",
            "rating": 5,
            "review_text": "Clean and new. Reasonably priced. Good free cooked breakfast and free airport shuttle  with very accommodative drivers . One of the few value for money hotels in Vancouver where most hotels are very expensive",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:44.378904",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 138,
            "total_number_of_photos_by_reviewer": 44,
            "reviewer_url": "https://www.google.com/maps/contrib/106272825893986652157/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNWREM3JnRRAB",
            "reviewer_name": "Michael Wilding",
            "rating": 5,
            "review_text": "Nice secure hotel, good clean room, staff friendly, helpful. Complimentary breakfast very good. Close to transit, and shops. I have no problem highly recommending this hotel",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:44.381128",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111196349787255879369/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNDZyaVl3EAE",
            "reviewer_name": "Ryoh Murofushi",
            "rating": 5,
            "review_text": "My boss and I were stranded yesterday without a phone traveling from Japan. Walked into Holiday Inn Express and talked to Seth who called a cab for us. Though we were not staying at the Holiday Inn Seth was very kind and helped us without hesitation. Thank you Seth, the next time we come we will be sure to make a reservation. Cheers",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:44.383596",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115678496960782233473/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhd0xMWU1REAE",
            "reviewer_name": "Dan Maskell",
            "rating": 5,
            "review_text": "Nice hotel, well-maintained and in a convenient location beside Metrotown and across the street from a SkyTrain station. The included breakfast and parking are a bonus.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:44.386461",
            "response_from_owner_text": "Dear Dan Maskell, Thank you for your comment on your last stay. Great to hear that you enjoyed your stay very much, as staff we really like the location as well. We look forward to your next visit Dan Maskell. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:44.386461",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 84,
            "total_number_of_photos_by_reviewer": 1443,
            "reviewer_url": "https://www.google.com/maps/contrib/106872486810037107628/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdHJteVZ3EAE",
            "reviewer_name": "Abraham Dark Codex 11.11,11",
            "rating": 5,
            "review_text": "This place is the best to stay in Burnaby, I m doing my isolation period here, the staff is nice and friendly as well everything is very nice at the restaurant, I m a person with disability so they accommodate my needs. I will definitely stay here again",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:44.390585",
            "response_from_owner_text": "Dear Travis dark Abraham Codex,667, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Travis dark Abraham Codex,667. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:44.390585",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 301,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/114022752819805715498/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZaklDZnhRRRAB",
            "reviewer_name": "Grayson O'Brien",
            "rating": 5,
            "review_text": "Stayed with Holiday Inn for about 2 weeks and had an awesome time / experience. The staff was amazing and accommodated myself in every way, along with awesome conversations every day. Thank you very much Seth Jay Mathew Pablo (And anyone else I may have forgotten)",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:44.393243",
            "response_from_owner_text": "Dear Grayson OBrien, Thank you for taking the time to tell us about your great experience at Holiday Inn Express VANCOUVER-METROTOWN (BURNABY). Please know we use feedback, such as yours, to continuously make changes to our brand to improve the guest experience. we strive every stay as pleasant and comfortable as possible. Once again, thank you for sharing your remarkable review and hope to welcome you back near future . Sincerely, Scott J General Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-25 05:07:44.393243",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113677443140573279088/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMUxDcnh3RRAB",
            "reviewer_name": "Valerie Yeo",
            "rating": 5,
            "review_text": "My second time back at this establishment. Always love the great location of this HIE. Its practically part of the metropolis shopping mall. There is a linkway at level 2 to get across to the mall. Directly across from the skytrain station to bring you to downtown and many other places. Very convenient and it offers free parking for their guests. Friendly and helpful receptionist.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:44.395533",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 119,
            "total_number_of_photos_by_reviewer": 153,
            "reviewer_url": "https://www.google.com/maps/contrib/114865760213326881545/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJby15RXhnRRAB",
            "reviewer_name": "Allan Perez",
            "rating": 5,
            "review_text": "Great hotel with shopping mall and restaurants near by, the metro station is in front so you can avoid parking in the downtown area. Breakfast is always different per day. Will stay again when I return.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:44.397435",
            "response_from_owner_text": "Dear Allan Perez, Thank you very much for taking the time to leave a great review of the hotel and hopefully we can welcome you back near future. Sincerely, Scott J General Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-25 05:07:44.397435",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 330,
            "total_number_of_photos_by_reviewer": 398,
            "reviewer_url": "https://www.google.com/maps/contrib/100435068973121890486/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNmRHSWpBRRAB",
            "reviewer_name": "Dallas Benjamin",
            "rating": 5,
            "review_text": "The staff are awesome, the rooms are clean and did I mention the awesome staff? Our first family vacation and the staff here made it the best. A huge thank you to everyone at the holiday inn",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:44.399919",
            "response_from_owner_text": "Dear Db Cooper, Thank you for taking the time to leave a great review of the hotel and we are glad to hear you enjoyed your stay with us. we sincerely hope that we can welcome you back again in near future and once again thank you for choosing Holiday Inn Express Metrotown for your accommodation. Regards, Scott J General Manager",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-25 05:07:44.399919",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 131,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106194146631798522548/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcnRqYnBnRRAB",
            "reviewer_name": "Fei Yang",
            "rating": 5,
            "review_text": "Me and my husband stayed at Holiday Inn Express Burnaby for three nights due to the cancellation of flights. On the first night when we got stuck at the airport, we tried to call and find a hotel at 1AM. After calling 5 or 6 hotels and received either no or cold responses, I decided to call this hotel. Neil picked up the phone with an extremely kind and friendly attitude and helped us make the reservation. During the next two days, out flights got cancelled three times and we had to drag our luggages and change from one room to another. However, the warm service at the hotel made our frustrating trip feel much better. We want to say special thanks to Neil, Brendon, Seth (not sure if I spell his name correctly), and an Asian lady who also worked at the reception desk (sorry that we cannot remember her name). We definitely recommend this hotel to everyone, this is the hotel with the best service which weve experienced in North America.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:44.403210",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104734191092479154167/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbk5ycTdBRRAB",
            "reviewer_name": "Vengeance",
            "rating": 5,
            "review_text": "Great rooms! Always looking new. Staff are helpful and courteous. Locations are well placed near popular attractions.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:45.074738",
            "response_from_owner_text": "Dear Michael, Thank you for the review. Our staff and location are indeed very valuable to us. Contact us if in Burnaby again. Regards, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:45.074738",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 302,
            "total_number_of_photos_by_reviewer": 2320,
            "reviewer_url": "https://www.google.com/maps/contrib/113597927909195318368/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMGM3TTlnRRAB",
            "reviewer_name": "Angelika Hackett",
            "rating": 5,
            "review_text": "Excellent service, cleanliness, location for our 10-day stay. Will stay here again when we come to Vancouver. Appreciated free parking and delicious breakfasts!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:45.077481",
            "response_from_owner_text": "Dear Angelika Hackett, Thank you for all the feedback and comments on your recent stay. Great to hear that you were able to get around easily, you found our staff friendly and helpful and you enjoyed your stay very much. We look forward to your next visit Angelika Hackett. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:45.077481",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109492206022389106250/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDODZyTXpRRRAB",
            "reviewer_name": "Dave Bee",
            "rating": 5,
            "review_text": "Clean and very friendly staff.  Always there to make your stay easy and enjoyable.  Great location at metro town skytrain.  Go enjoy a couple of days and relax",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:45.080711",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 248,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110344234639727110069/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwMG9qVUNBEAE",
            "reviewer_name": "Steven Mar",
            "rating": 5,
            "review_text": "Nice location.  Its next to a mall with plenty of restaurants.  It is also next to a major bus hub with rail and buses. The rooms are really comfortable and clean.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:45.082870",
            "response_from_owner_text": "Dear Steven Mar, Thank you for taking the time to leave a great review of the hotel. It is truly a pleasure and glad to hear you enjoyed your stay with us. Hopefully we can welcome you back again in near future and once again thank you for choosing Holiday Inn Express Metrotown for your accommodation. Regards, Scott J General Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-25 05:07:45.082870",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 24,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/115159506691766703658/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnckpITE9nEAE",
            "reviewer_name": "Dana F",
            "rating": 5,
            "review_text": "Comfy bed, decent free breakfast, close to shopping, sky train and restaurants. Clean, staff is quite friendly. Wi-Fi is horribly slow - My only complaint.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:45.085333",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107460244325913122175/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdDlMaHJnRRAB",
            "reviewer_name": "Leanne Nakashimada",
            "rating": 5,
            "review_text": "My parents are visiting from out of town and stayed at the Holiday Inn Express at Metrotown. They were impressed with how nice and clean the rooms are and were very pleased with the quality of the included breakfast.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:45.087492",
            "response_from_owner_text": "Hi Leanne, I am so glad to hear that your parents enjoyed your stay with us! I hope your next stay and just around the corner. Call us if there is anything we can help you with. Regards, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:45.087492",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110495961408144632013/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMmRHM3FBRRAB",
            "reviewer_name": "Chelsea Vancouver",
            "rating": 5,
            "review_text": "Clean, friendly staff, and great complimentary breakfast. Great location right across from the Metrotown skytrain station and plenty of underground parking. Would recommend.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:45.090834",
            "response_from_owner_text": "Dear Chelsea Reid, Thank you for taking the time to leave a great review of the hotel and we are glad to hear you enjoyed your stay with us. we sincerely hope that we can welcome you back again in near future and once again thank you for choosing Holiday Inn Express Metrotown for your accommodation. Regards, Scott J General Manager",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-25 05:07:45.090834",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 447,
            "total_number_of_photos_by_reviewer": 1354,
            "reviewer_url": "https://www.google.com/maps/contrib/109700449365783661848/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncDhIQlF3EAE",
            "reviewer_name": "Nouri Wersheffani",
            "rating": 5,
            "review_text": "Awesome place to stay. very Clean, friendly staff,close to all attractions and most of all free parking and free breakfast. Well be back again and again....",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:45.094463",
            "response_from_owner_text": "Dear Nouri Wersheffani, Thank you for your positive review and for choosing our hotel. Im happy that you enjoyed your stay and specially that you liked our staff. Im looking forward to having you again as a guest in our hotel. Best Regards, Scott J General Manager",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-25 05:07:45.094463",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 41,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100875513253651197102/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxN0pteE5BEAE",
            "reviewer_name": "Abbas Khambatta",
            "rating": 5,
            "review_text": "Extremely warm staff and friendly reception even as we arrived past midnight. Very good location, next to the bus terminal and opposite the sky train.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:45.097011",
            "response_from_owner_text": "Dear Abbas Khambatta, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! as staff we really like the location as well. We hope your next stay is just around the corner, looking forward to welcoming you back soon Abbas Khambatta. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:45.097011",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 15,
            "reviewer_url": "https://www.google.com/maps/contrib/100677933095613060263/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb2RLUjRBRRAB",
            "reviewer_name": "Patrick Daugherty",
            "rating": 5,
            "review_text": "It was very handy.  Free underground parking. Subway right across the street. Beautiful hotel.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:45.099769",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108720955324028372442/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMya28ySFF3EAE",
            "reviewer_name": "Jose Sosa",
            "rating": 5,
            "review_text": "Great service, clean room and also wide breakfast choice and the coffee machine on the lobby area is great!!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:45.834558",
            "response_from_owner_text": "Dear Jose Sosa, Thank you for all the feedback and comments on your recent stay. Great to hear that you really liked the service received, you found our breakfast options wide and you enjoyed your stay very much. We look forward to your next visit Jose Sosa. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:45.834558",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 263,
            "total_number_of_photos_by_reviewer": 20,
            "reviewer_url": "https://www.google.com/maps/contrib/102573236118908276116/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBb3V5eW1RRRAB",
            "reviewer_name": "Ray Goodman",
            "rating": 5,
            "review_text": "Staff were friendly and helpful. Rooms were clean and comfortable. Well worth the rate. Would definitely stay again.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:45.838494",
            "response_from_owner_text": "Hello Mr. Goodman, Thanks for choosing the Holiday Inn Express Metrotown, I am glad that you liked your stay and we wish to welcome you back at any given time! Regards, Scott J General Manager",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-25 05:07:45.838494",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/108759625886530023634/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSczU3TF9nRRAB",
            "reviewer_name": "Paige Siara",
            "rating": 5,
            "review_text": "Hotel rooms are clean, spacious, and comfortable.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-25 05:07:45.841571",
            "response_from_owner_text": "Dear Paige Siara, We are very thankful for your excellent review and ratings for us. We are pleased that you like the new renovated rooms. I agree with you, the rooms felt clean, new and updated. Our location and the convenience to Sky Train is great. We are all looking forward to welcoming you again sooner. Thank you for staying with us. Kind regards, Scott J General Manager",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-25 05:07:45.841571",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 230,
            "total_number_of_photos_by_reviewer": 773,
            "reviewer_url": "https://www.google.com/maps/contrib/112663146337096942618/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbnRmZ0pREAE",
            "reviewer_name": "Bob Harris",
            "rating": 5,
            "review_text": "Great hotel and location.  Alan was very friendly and helpful.  Mall is next door as well as all transportation to get all around.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:45.844225",
            "response_from_owner_text": "Dear Bob Harris, Thank you for taking the time to leave a review of the hotel. Glad to hear you enjoyed your stay with us and hopefully we can welcome you back again. Regards, Scott J General Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-25 05:07:45.844225",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 39,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117243186571033162372/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bzg3Z3lnRRAB",
            "reviewer_name": "Allison Butterworth",
            "rating": 5,
            "review_text": "Great clean rooms and awesome amenities. All the staff were courteous, helpful and friendly!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:45.847070",
            "response_from_owner_text": "Dear Allison Butterworth, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you, and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Allison Butterworth. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:45.847070",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100929915510765374702/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndXIzQVdnEAE",
            "reviewer_name": "Swahili Falcon",
            "rating": 5,
            "review_text": "Room was very nice and cleaned well. Staff was kind and helpful. The breakfast was super!",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:45.849715",
            "response_from_owner_text": "Thank you Swahili, I am happy to hear you had a pleasant stay with us. Call us when visiting Burnaby again. Regards, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:45.849715",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110284174148582301931/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdWJyQ2hnRRAB",
            "reviewer_name": "James Warren",
            "rating": 5,
            "review_text": "Attended a Rich Dad Poor Dad seminar here, hotal stall set up nicely everything was clean and cozy. I was not hesitate to stay here.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:45.852660",
            "response_from_owner_text": "Hi James, Thank you for reviewing us. I am pleased to hear you find our facilities to your liking. Hope you can come and stay with us next time. Regards, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:45.852660",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 31,
            "total_number_of_photos_by_reviewer": 40,
            "reviewer_url": "https://www.google.com/maps/contrib/106488325215664950506/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdy16eFFREAE",
            "reviewer_name": "Kerry Hammell",
            "rating": 5,
            "review_text": "Very friendly, helpful staff. Clean, tidy room with lots of extras. Will love to stay there again!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:45.855887",
            "response_from_owner_text": "Dear Kerry Hammell, Thank you for your positive comments. I am glad to hear that you enjoyed your stay with us. We will love to welcome you back again soon. Warm Regards, Scott J General Manager",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-25 05:07:45.855887",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116429932991212602502/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteEpyaXlRRRAB",
            "reviewer_name": "Alejandra Alvarado",
            "rating": 5,
            "review_text": "Its my home around year ago at personal super friendly Im comfortable same in family thanks for you work and help me always amazing.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:45.859123",
            "response_from_owner_text": "Dear Alejandra Alvarado, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Alejandra Alvarado. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:45.859123",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100662632434462396018/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbVBUYTBBRRAB",
            "reviewer_name": "Chris Coleman (artsyheartsy)",
            "rating": 5,
            "review_text": "good beds, nice rooms, decent breakfast, great location. also allows pets on one floor",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:45.861975",
            "response_from_owner_text": "Thank you Chris, I am happy to hear you enjoyed your experience with us. We are looking forward to your next stay. Regards, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:45.861975",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106226145795367584022/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0cGV1YlZBEAE",
            "reviewer_name": "Ed Kent",
            "rating": 5,
            "review_text": "Friendly efficient staff check in was quick. Room was comfortable size and clean.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:46.544842",
            "response_from_owner_text": "Dear Ed Kent, Thank you for leaving a great review of the hotel. Your feedback is valuable to us and hopefully we can welcome you back again at the hotel near future. Regards, Scott J General Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-25 05:07:46.544842",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 34,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114213944804180105929/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvLWVfa1d3EAE",
            "reviewer_name": "Karol C",
            "rating": 5,
            "review_text": "Clean, room was modern and quiet. Great access to mall if you want to do some shopping.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:46.548438",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 63,
            "total_number_of_photos_by_reviewer": 31,
            "reviewer_url": "https://www.google.com/maps/contrib/108912835416369792782/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNaTV2UXhnRRAB",
            "reviewer_name": "Jo",
            "rating": 5,
            "review_text": "There was a hiccup with my booking, completely my fault, but they were so helpful and worked with me to get me a room. Definitely will come back!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:46.550640",
            "response_from_owner_text": "Dear Jo Yuen, Thank you for taking the time to leave a great review of the hotel. It is truly a pleasure and glad to hear you enjoyed your stay with us. Hopefully we can welcome you back again in near future and once again thank you for choosing Holiday Inn Express Metrotown for your accommodation. Regards, Scott J General Manager",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-25 05:07:46.550640",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 139,
            "reviewer_url": "https://www.google.com/maps/contrib/102720252941093353805/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnM1l5OHZ3RRAB",
            "reviewer_name": "Riley S",
            "rating": 5,
            "review_text": "Good conference room for our meeting. Although there was some construction noise, it wasnt the hotels fault",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-25 05:07:46.553983",
            "response_from_owner_text": "Hello Riley, Thank you for your review and for your understanding regarding the constructions. It is not quite yet done, however it will be an even more amazing location when the new station is ready. Regards, Scott J General Manager",
            "response_from_owner_ago": "7 years ago",
            "response_from_owner_date": "2016-11-25 05:07:46.553983",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 102,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105150300451142786803/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbVlqNjBBRRAB",
            "reviewer_name": "Yves Tolod",
            "rating": 5,
            "review_text": "Rooms and hotel are clean. Very convenient location near the mall. Good customer service.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-25 05:07:46.556919",
            "response_from_owner_text": "Hello Yves Tolod, Thank you so much for your review of our hotel. I am pleased to hear you enjoyed your stay with us. Its something our staff takes great pride in, so we value your feedback. We hope you will visit us again. Sincerely, Scott J General Manager",
            "response_from_owner_ago": "7 years ago",
            "response_from_owner_date": "2016-11-25 05:07:46.556919",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106350007160628272296/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOC0za2VnEAE",
            "reviewer_name": "Shirley Stewart",
            "rating": 5,
            "review_text": "The staff her are always super friendly, room very clean and beds are super comfortable",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:46.560385",
            "response_from_owner_text": "Dear Shirley Stewart, Thank you for choosing us, we appreciate your positive feedback about our staff, we are always trying to do our best to deliver a good experience for you and also glad to hear that you enjoyed your stay with us due to it! We hope your next stay is just around the corner, looking forward to welcoming you back soon Shirley Stewart. Scott J General Manager",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-25 05:07:46.560385",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/109402208031407070065/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReTRfTE13EAE",
            "reviewer_name": "Kimberly Yateman",
            "rating": 5,
            "review_text": "Rooms were very clean, he artwork on the wall was beautiful, and the beds comfortable!!",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:46.563768",
            "response_from_owner_text": "Dear Kimberley, Thank you for your review and for choosing our hotel. Im happy that you enjoyed your stay and Im looking forward to having you again as a guest in our hotel. Sincerely, Scott J General Manager",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-25 05:07:46.563768",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101776407705328641707/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreVpma1NBEAE",
            "reviewer_name": "Tamara Hill",
            "rating": 5,
            "review_text": "Nice and clean , Perfect place to hang out by big mall , restaurants and sky train and bus stations everything close by. We will come back again hopefully by labor day",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:46.566417",
            "response_from_owner_text": "Dear Tamara Hill, Thank you for taking the time to tell us about your experience at Holiday Inn Express VANCOUVER-METROTOWN (BURNABY). Please know that your feedback is extremely valuable to us and we use feedback, such as yours, to continuously make changes to our brand to improve the guest experience. we strive every stay as pleasant and comfortable as possible. Once again, thank you for sharing your comments and hope to welcome you back near future . Sincerely, Scott J General Manager",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-25 05:07:46.566417",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/100730625620616693010/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaV9MR093EAE",
            "reviewer_name": "Trevor Williams",
            "rating": 5,
            "review_text": "Recently refurbished. Very comfortable Noteworthy details: Attached to huge shopping Mall",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-25 05:07:46.570734",
            "response_from_owner_text": "Dear Trevor Williams, Thank you for taking the time to rate us your recent stay. Great to hear that you enjoyed your stay very much. We look forward to your next visit Trevor Williams. Scott J General Manager",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-25 05:07:46.570734",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102613151222511061844/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMDQ2bWpnRRAB",
            "reviewer_name": "Cameron Macaulay",
            "rating": 5,
            "review_text": "I thought that the rooms wouldnt be as nice as they are! The Keurig Machine is definitely a nice (and convenient) touch!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-25 05:07:46.574465",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 27,
            "total_number_of_photos_by_reviewer": 12,
            "reviewer_url": "https://www.google.com/maps/contrib/101590982320064373608/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}