{
    "place_id": "ChIJPQjn0nV3hlQRxoOaI4yIc40",
    "reviews": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbW9XNE93EAE",
            "reviewer_name": "Ahmad Ahmad",
            "rating": 5,
            "review_text": "I recently joined this gym and its been an outstanding experience. The manager is a gem. His excellent communication skills ensure that every member feels valued and heard. He genuinely cares about the facility and its clients, always striving to maintain a clean and well-equipped environment. I highly recommend this gym for its top-notch service and dedicated management.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 02:40:04.812125",
            "response_from_owner_text": "Thank you for the positive comment, Ahmad!! And well be sure to let the GM know that he is a gem! Haha",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 02:40:04.812125",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118202617526081139131/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGM09iMUlREAE",
            "reviewer_name": "Aida Esmaeilidouki",
            "rating": 5,
            "review_text": "I was initially skeptical after hearing the negative feedback, but I decided to give it a shot and see what it was all about. I was greeted by friendly staff who were genuinely interested in helping me achieve my fitness goals. They took the time to understand my needs and provided valuable advice without pushing me into any unnecessary commitments. It was evident that they genuinely cared about creating a positive and inclusive environment for all members. The equipment at this gym is also really good, with a ton of options. The cleanliness of the gym was commendable too, and I appreciated the staffs efforts in maintaining a hygienic space. One incident that really stood out to me was when I encountered a small issue with one of the machines. I approached a staff member and they walked with me to the machine right away and then told the maintenance team. I think what sets this gym apart from other places I ve been is really the positive and motivating atmosphere. The members here are friendly and supportive, creating a sense of community that is often lacking in other gyms. The trainers are approachable and always willing to offer guidance, making sure that you get the most out of your workout routine. To sum it up, despite the negative feedback, my personal experience has been nothing but positive. I encourage anyone who might have been skeptical like I was to give it a chance. You might just be pleasantly surprised, just like I was! Overall, I highly recommend Fitness World Kingsway to anyone looking for a gym that offers quality equipment, helpful staff, and a welcoming atmosphere.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 02:40:04.816249",
            "response_from_owner_text": "Thats great to hear, Aida! Thanks for sharing your feedback of our location, and so happy to hear that youre enjoying the ecosystem!",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 02:40:04.816249",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107319145470732904927/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNWZmWVVBEAE",
            "reviewer_name": "Yeongjin Byun (  )",
            "rating": 5,
            "review_text": "Love this gym. I had first experience of personal training with Parinaa here and it s the best choice I made this year. She has such a nice vibe to ease my anxiety at the gym and taught me many things in details. She s not only trains me but also motivates me with great positivity. That changed me a lot and very grateful for that. Love herrrr!!!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 02:40:04.819930",
            "response_from_owner_text": "Yessss -- love it, Yeongjin! This month is mental health awareness month here at Fitness World, which makes it even nicer to hear that youve noticed the benefits of dealing with anxiety around the gym. In our club, we try to provide the friendliest, supportive environment possble to help you achieve your goals -- so please let us know if theres ever anything else we can do for you moving forward as well :) Keep up the hard work Yeongjin!",
            "response_from_owner_ago": "a day ago",
            "response_from_owner_date": "2023-11-21 02:40:04.819930",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108918419395100893925/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOFpqWmhnRRAB",
            "reviewer_name": "Snow Helsing",
            "rating": 5,
            "review_text": "Great gym! I trained here during a business trip, felt excellent. atmosphere is motivative because 7:30AM there are quite a number of people started training. Al staffs are kind and supportive. Especially PT Emilio, he is passionate and professional, a few months after I left Vancouver, Im still training myself with what he taught me.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 02:40:04.823651",
            "response_from_owner_text": "Thanks Snow! So glad to know you enjoyed your time here at Fitness World! And we agree -- our trainers are some of the best in the industry!! Wishing you nothing but the best moving forward with your health & fitness journey!! :)",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 02:40:04.823651",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101080974312491458888/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaUtMRW5BRRAB",
            "reviewer_name": "Viraj Parab",
            "rating": 5,
            "review_text": "Great gym with amazing trainers and manager. Dan was my personal trainer and he taught many things about strength training. He was very knowledgeable and would give us tips between the sets to improve our form. Nevertheless, he would also motivate to push further which is an important aspect of being a personal trainer.  Always had a fun session with Dan.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 02:40:04.826746",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/114469124437863530939/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaC0zdUVREAE",
            "reviewer_name": "Ruby Hsieh",
            "rating": 5,
            "review_text": "A good place for improving your health and body shape, all the staff here are really friendly and willing to help you. If you are a beginner for fitness and want to try, they also have many professional trainers to help you, highly recommends:)))",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 02:40:04.829459",
            "response_from_owner_text": "Hi Ruby! Thanks for the nice comment and so glad to hear youre enjoying your time at the club! Please let us know if theres ever anything else we can do to maintain a 5-star experience as well!! :)",
            "response_from_owner_ago": "a day ago",
            "response_from_owner_date": "2023-11-21 02:40:04.829459",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111698632216926850481/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGemJyMW93RRAB",
            "reviewer_name": "mitali pathak",
            "rating": 5,
            "review_text": "I absolutely love training at this gym. The women section is the highlight of this gym, giving us a private space to train. I would also like to give parinaa, the personal trainer there, a huge shoutout. As a beginner in the gym and not knowing much on how to get started, parinaa set me up really well with a proper routine that I can follow. Not only that, I was also set up with a well laid out nutrition plan for my goals. Through her guidance, I have finally been able to make progress as I was stuck on a plateau for far too long. Whenever parinaa passes by me in the gym, she will always make sure to check in with me and asks about my progress. Always gives me new tricks and tips to follow. Her words of encouragement are really very empowering. Her energy is what is needed for beginners like us to keep coming back to the gym. The managers and the staff there are also incredible. Great team and  a great facility. 10/10",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 02:40:04.832598",
            "response_from_owner_text": "Love this!! Thanks for the positive review, Mitali :) :) We love being able to offer a safe & secluded space to our beloved female members as well -- glad to know youre appreciative and taking advantage of that private space as well! And who else could be better to train in the women-only section then our Queen of Kingsway trainer, Parinaa!? Weve had a ton of positive feedback about her ever since she joined our team -- so, not at all surprised to be reading your lovely feedback as well! Glad to know another one of our members is feeling the benefits and experiencing the results theyre looking for! Please let us know if theres ever anything else we can do for you moving forward as well, and in the meantime, well see you around the gym!! :)",
            "response_from_owner_ago": "a day ago",
            "response_from_owner_date": "2023-11-21 02:40:04.832598",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109669144367110175585/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMEp6VVlREAE",
            "reviewer_name": "aareana parvez",
            "rating": 5,
            "review_text": "Parina is one of the best trainers I have ever encountered. She not only trains me but also motivates me. I started seeing changes within a month. I feel tighter, stronger, and more confident now. Her techniques amaze me. She is one of the best trainers in town!!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 02:40:04.835511",
            "response_from_owner_text": "Thats awesome to hear Aareana! So glad to know youve had a positive experience with Parinaa! Shes definitely one of the favorite trainers in the gym! Keep up the great work with her!!",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 02:40:04.835511",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105605644436539077826/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGekluVHJRRRAB",
            "reviewer_name": "ramesh nazari",
            "rating": 5,
            "review_text": "I just read through some of these comments and feel like an unbiased review needs to be made. Yes, it s an old building. Yes, there s some old equipment. Yes, some members don t put their weights away. Yes, bathroom in womens area is permanently out of order. Yes, parking can be difficult during the peak hours after work. But, they did just open up a brand new section with like 10 squat racks. There s a bunch of new equipment that s been added. There s another bathroom 20feet away from the womans area that works perfectly fine. The showers work. The ventilation is way better than it used to be. The staff here is maybe the highlight, one of the nicest I ve ever seen and a ton of fun to banter with. The manager is always talking to members. If you just wait 5minutes for parking a stall opens up too. I think people need to have a little perspective in life and be a little less negative. It s the cheapest membership price in the entire city but they re expecting to be pampered like Equinox. That s my two cents.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 02:40:04.838534",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113254130907317152593/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX2Q3ZmdRRRAB",
            "reviewer_name": "Ajay Kumar",
            "rating": 5,
            "review_text": "I have not seen like this gym ever here and also in India. Staff is too cooperative moreover the machines, the gym area motivates me more to more hard workout. Trainers like Marcel is my favourite because he is a man with good knowledge and so cooperative to everyone with sweet smile. I suggest everyone to join this gym today because I transformed my body full to a fit person.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:40:04.840802",
            "response_from_owner_text": "Thanks for the positive review on our trainers and staff members, Ajay! We certainly try our best to treat each member like your home country -- Guest is God! Please let us know if theres ever anything else we can do for you in the future.. and well see you around the gym!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 02:40:04.840802",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107442976669740117134/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMVpQWWpRRRAB",
            "reviewer_name": "Ash Iyer",
            "rating": 5,
            "review_text": "Love this place! My personal trainer, Parinaa, was very supportive with helping me achieve my goals. She was willing to meet me where I was, and I m very grateful for her motivation!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 02:40:05.476203",
            "response_from_owner_text": "Yayyy! Parinaa and Ash for the win!! Thanks for the positive feedback, Ash! Keep crushing your goals!!",
            "response_from_owner_ago": "a day ago",
            "response_from_owner_date": "2023-11-21 02:40:05.476203",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117709699450797789389/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGamRTN213RRAB",
            "reviewer_name": "chi nguyen",
            "rating": 5,
            "review_text": "Working with Yanna has been transformative.Weve been working together for almost a year, and overall I have lost 36lbs so far. Her tailored approach, extensive knowledge, and motivational style set her apart. She adapt seamlessly, ensuring progress and a positive, inclusive atmosphere. I highly recommend Yanna for a top-notch fitness journey!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 02:40:05.480513",
            "response_from_owner_text": "36 POUNDS!? Thats AWESOME, Chi! Nicely done!! Congratulations, a lot of hard work for sure, but it sounds like its definitely paid off -- keep it up girl!!",
            "response_from_owner_ago": "a day ago",
            "response_from_owner_date": "2023-11-21 02:40:05.480513",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104692634573468066789/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdFo3LWNnEAE",
            "reviewer_name": "George",
            "rating": 5,
            "review_text": "I ve been working out here while on vacation visiting family, and this gym is much nicer than any gym I have back home in Cleveland! It s huge and has pretty much any equipment you d need. I really wish we had a gym like this back home!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:40:05.484095",
            "response_from_owner_text": "Great to hear your perspective of our club, George! Thanks for sharing your positive feedback, and wishing you nothing but the best back in Cleveland as well. Safe travels!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 02:40:05.484095",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/116829606267883624827/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c0llSWpBRRAB",
            "reviewer_name": "Kur Ye",
            "rating": 5,
            "review_text": "This Gym and its employees left a great impression on me. The facility was immaculate and equipped with state-of-the-art machines. The staff is friendly, knowledgeable, and eager to help with workout routines and nutrition. I appreciate the positive and supportive atmosphere that the gym provided, creating a sense of community among members. The trainers are highly qualified and created personalized plans tailored to my needs. Overall, I would highly recommend Fitness World to anyone looking for a great fitness facility with a top-notch staff.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:05.487652",
            "response_from_owner_text": "What a thoughtful and informative response -- thank you, Kur! Glad to know youre enjoying the facility, equipment, staff and overall community that we have here at Kingsway FW! Thank you for being a positive contributor to this space as well, and as always, please let us know if theres ever anything we can do for you!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 02:40:05.487652",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108302356315497769360/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMzdLQld3EAE",
            "reviewer_name": "Jacobo Santiago",
            "rating": 5,
            "review_text": "An amazing place! My personal coach was Marcel and got to say, if you want to become stronger and reach your goals in an effective way, go with him. Is really knowledgeable about lifting and flexibility training. A truly strongman!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 02:40:05.490923",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104627688976217933695/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNjhfLU9REAE",
            "reviewer_name": "Martin Lin",
            "rating": 5,
            "review_text": "Marcel is my personal trainer. He definitely gives me hell but hes one hell of a personal trainer with incredible knowledge and technique. Im seeing progress that I would have never seen on my own, and Im really glad to have attended his course.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:40:05.493861",
            "response_from_owner_text": "Love this, Martin! Glad to hear youre enjoying your sessions with Marcel! Hes humble.. a lot of people dont know this -- Marcel recently won a Vancouver Strong Man competition too! Wishing you nothing but the best with your training moving forward; keep crushing your workouts!!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 02:40:05.493861",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114349288590438488238/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwb2FETzN3RRAB",
            "reviewer_name": "Dee Dee Xi He Wang",
            "rating": 5,
            "review_text": "I was especially impressed with the staff. They were all very professional yet kind and welcoming. It made me feel less nervous and intimidated when I first started going to this gym.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:40:05.496914",
            "response_from_owner_text": "So glad to know that you felt welcomed and at ease here Dee Dee. Youre officially a part of our Kingsway family now, so please let us know if theres anything we can do to make you feel even more comfortable and at home!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 02:40:05.496914",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116591921763593592094/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNHBEWV9RRRAB",
            "reviewer_name": "Kiran Kaur",
            "rating": 5,
            "review_text": "Can t thank this gym enough for having PARINAA as a personal trainer. She s the best with great knowledge and sweetest smile  . Her efforts are more than mine with regular checkins, delicious diet plan she provide and positivity she transfers to you. And dances like a kid after seeing you results",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:40:05.499683",
            "response_from_owner_text": "We cant thank Parinaa enough for being a part of our team as well, Kiran! So glad to know youre enjoying your time with her! It truly is the team members that make Fitness World so great! Enjoy your time with her as you continue towards your fitness goals!!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 02:40:05.499683",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 45,
            "total_number_of_photos_by_reviewer": 28,
            "reviewer_url": "https://www.google.com/maps/contrib/108309397671863640421/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZ0tYem53RRAB",
            "reviewer_name": "Alam Khan",
            "rating": 5,
            "review_text": "I have been training with Parinaa as my personal trainer since February. I have tried many trainers before but I stuck with no one. With Parinaa, I can say it s been the best experience and continues to be. I have lost weight, gained lean muscle mass and am generally more active. She has given me knowledge on nutrition and exercise every step of the way. I have learnt so much. Her method of progressing you slowly by building a strong base is commendable. Never have I ever missed our training session. Always pretty excited for the new challenge as she makes everything interesting. 100 percent vouch for Parinaa. You will not regret it",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 02:40:05.502496",
            "response_from_owner_text": "LOVE IT! Thanks for the positive feedback with Parinaa, Alam! Parinaa has quickly become one of our best/most-beloved trainers around here! Excited to hear that youve already made progress with your weight loss & muscle gain -- keep up the hard work!!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 02:40:05.502496",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106911672108307997907/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMjVfWXFRRRAB",
            "reviewer_name": "Marvelyn Milan",
            "rating": 5,
            "review_text": "Parinaa has been an incredible personal trainer for me since August. Her dedication and expertise have helped me make significant progress towards my goals. Thanks to her guidance, Ive already reduced my body fat by 6%, which is an achievement I couldnt have reached without her support. Parinaas commitment to challenging me in each workout has pushed me to my limits and taught me valuable lessons about fitness. I couldnt be happier with the results and the journey so far. I highly recommend her as a personal trainer!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 02:40:05.504935",
            "response_from_owner_text": "Definitely one of the best reviews weve read from one of our PTs clients. Thank you for providing an in-depth and authentic review of what your experience is like when you worked with her!",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 02:40:05.504935",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115529191765687866584/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MUplUTdnRRAB",
            "reviewer_name": "Ocean wu",
            "rating": 5,
            "review_text": "I met my personal fitness trainer Emilio here, deserves all the praise in the world for his dedication, knowledge, and unwavering commitment to helping you achieve your fitness goals. With his guidance and expertise, youve made significant progress in your journey towards a healthier and happier life. Emilio has been your motivator, your coach, and your friend, always pushing you to go beyond your limits and achieve your full potential. From the very beginning, Emilio has been there for you every step of the way. He took the time to understand your goals and designed a customized fitness program that suited your needs and abilities. He has been your constant source of inspiration, always encouraging you to stay on track and never give up. With his support, you have been able to overcome challenges and obstacles that once seemed insurmountable. Emilios extensive knowledge and experience in the fitness industry have been instrumental in your success. He has helped you develop the right technique and form for every exercise, minimizing the risk of injury and maximizing the effectiveness of your workouts. He has also shared his wealth of knowledge on nutrition, helping you make healthy food choices that support your fitness goals. Emilio is not just a personal trainer but a life coach who has made a tremendous impact on your life. He has helped you develop a positive mindset, teaching you to believe in yourself and your abilities. He has been your role model, leading by example with his own healthy lifestyle choices. Emilio is more than just a personal trainer. He is a friend, a mentor, and a guide who has helped you become the best version of yourself. Your success is a testament to his dedication and expertise, and you are grateful for everything he has done for you.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.146332",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/115255142707260445081/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweWZpcGRnEAE",
            "reviewer_name": "Emman Barrameda",
            "rating": 5,
            "review_text": "MARCEL IS AN ABSOLUTE BEAST You know what they say when the big guys in the gym are usually the nicest and most supportive; this Strongman is a genuine person with big and strong values. He provides descriptive feedbacks and brings A LOT of motivation throughout exercises. Its obvious that he fosters physical and psychological incentives to help his clients maintain consistency as they work towards their goals. His personality kinda resembles Major Alex Louis Armstrong from FMA  Good vibes and great laughter!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:40:06.150732",
            "response_from_owner_text": "Yess!! Love this, Emman! Thanks for the amazing review!!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 02:40:06.150732",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 40,
            "reviewer_url": "https://www.google.com/maps/contrib/109626830470130700952/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d3VIVG5RRRAB",
            "reviewer_name": "randa w",
            "rating": 5,
            "review_text": "Had a pleasant experience here! Danila, the boy at the front desk was very accommodating to my questions and had all the answers I needed, the space was clean and had a broad array of equipment. As a beginner this gym was a very welcoming space to try out",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.154910",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105056315673260039480/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4LXNtQi1RRRAB",
            "reviewer_name": "John Zheng",
            "rating": 5,
            "review_text": "Fantastic gym, staff was great and friendly, person at the front desk, Jason was super professional. First time at this location as he showed me around the gym and different types of machines/rooms. Very clear on the different type of rates the gym had, as they re super cheap and affordable.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.158350",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111720863799567718996/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M0k3eG5RRRAB",
            "reviewer_name": "Samuel Xiao",
            "rating": 5,
            "review_text": "Fitness World fosters a friendly and supportive community. The members are diverse, and everyone is united in their commitment to a healthier lifestyle. Its refreshing to be surrounded by like-minded individuals who inspire and motivate each other to achieve their fitness goals. I always leave Fitness World feeling not only physically stronger but also mentally rejuvenated.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.161593",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103679059639783375142/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeDdudnlBRRAB",
            "reviewer_name": "Nik",
            "rating": 5,
            "review_text": "Emilio is an excellent personal trainer and helped me learn how to dial in my fitness starting from 0. Ive been training with him for the last 6 months and have made notable gains that have surprised me. hes extremely knowledgeable, helpful, and is a down-to-earth guy to top it off. have had a great experience going here in general largely because of him.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 02:40:06.164399",
            "response_from_owner_text": "Thats awesome to hear, Nik. Glad to know youre seeing results, and having fun while achieving your goals too!!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 02:40:06.164399",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117907294999416780077/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcEpMTGZnEAE",
            "reviewer_name": "Min Brian",
            "rating": 5,
            "review_text": "I highly recommend Tina, one of the trainers at this location. She is very passionate and knowledgeable about her art. Even after training for over a decade, I was still able to pick up a few nuggets from only an hour with her.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 02:40:06.167661",
            "response_from_owner_text": "Thanks, Min! We couldnt agree with you more as well! Tina has been an amazing addition to our team & culture here! Shes also one of our WORX trainers as well -- if you or anyone else is ever interested in a small group training session thats high-intensity and fun -- definitely attend her class!",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 02:40:06.167661",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104506694719246290098/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M0xhZ0J3EAE",
            "reviewer_name": "Joseph Sun",
            "rating": 5,
            "review_text": "Fitness World boasts top-of-the-line equipment that caters to all fitness levels and preferences. Whether youre into strength training, cardio, or group fitness classes, youll find everything you need to achieve your fitness goals. The gym is impeccably maintained, and the equipment is modern, ensuring a comfortable and safe workout environment.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.171295",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116108399497002782181/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M0otX0xBEAE",
            "reviewer_name": "Galina Novodvorsky",
            "rating": 5,
            "review_text": "I want to say thank you to this wonderful, convenient and affordable gym. Especially, I would like to thank my personal trainer - Kathryn (Kat) L.. She in very intuitive to individual needs and has tones of experience and knowledge in fitness and nutrition. I was new to fitness and Kat helped me to build (injury free) great stamina in short time.  THANK YOU :)",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.173855",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100013063529713980655/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c0lQR2ZBEAE",
            "reviewer_name": "Ahmad Azami",
            "rating": 5,
            "review_text": "The best gym in town. The manager is the biggest reason we decided to join this gym. His professionalism and openness towards new members is really something to admire. The machines are as good as new. The new section in the gym helps a lot regarding the amount of people that come to the gym.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.176304",
            "response_from_owner_text": "This is great! Thanks for sharing your feedback, Ahmad. Well continue to upgrade the facility wherever we can as well! Thanks again for the positive feedback and for being a part of our community!!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 02:40:06.176304",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109228090183384188230/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N3JYQXhRRRAB",
            "reviewer_name": "Nathan Bong",
            "rating": 5,
            "review_text": "Jason was great at explaining the different gym plans and provided an in depth tour of the gym when I was a new visitor. Equipment is nice and decent parking. Considering the price, a very good deal.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.830201",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/113362427762349379231/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M08zWGVREAE",
            "reviewer_name": "Rishabh Verma",
            "rating": 5,
            "review_text": "pretty great gym, has all the equipment you d need at the cheapest price you can find. all the workers are always willing to give tips and help out if you need. it gets a bit packed and messy at times, but which gym doesn t? if they repaired the sauna this would be the best gym",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.834609",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108701650414625808590/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dnNhcl93RRAB",
            "reviewer_name": "S H",
            "rating": 5,
            "review_text": "Like their women s only section.  A/C so good  Love the Normatech and the Hydromassage  Sarah was excellent in giving me a tour of the gym, answering all my questions and helping me settle in.  The friendly guy who signed me up was very patient and kind. Good team work!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 02:40:06.838438",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106835965995805753542/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdS1qTG1RRRAB",
            "reviewer_name": "Amanda Escobar (Lola789)",
            "rating": 5,
            "review_text": "I had a personal trainer, Parinaa, for several weeks. She was very personable, and fully invested in my health. Would recommend completely",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 02:40:06.841997",
            "response_from_owner_text": "Yesss! Thanks for the positive feedback on Parinaa, Amanda! :)",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-08 02:40:06.841997",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103272118194287110539/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZzlPcHZ3RRAB",
            "reviewer_name": "Steve Hawthorne",
            "rating": 5,
            "review_text": "Updating my review... I have had the privilege for about a year. This has included a period from January to June, attending 7 Worx classes a week. Never a repeat session. Had joys of working out alongside students of all abilities. Sharing encouragement as each welcomed me into their city. Through the months, Amy has been a constant presence of care and challenges. I have reached new heights under her leadership. More recently, Tina and Paarina have joined the coaching team. Fresh ideas. High creativity. Discipline. Exchange of positive energy and humor, as my body is tested and carefully broken, sculpted and rebuilt stronger and fresh. To each of my trainers, a huge thank you! I feel amazing and very grateful of my time, with you.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 02:40:06.845693",
            "response_from_owner_text": "Thank you for the in-depth and thoughtful response Steven! And we couldnt agree more with you! The WORX classes that youre describing, truly are the BEST way for someone to get an incredible workout, guided by a personal trainer, in a small group setting, without having to pay the same $ for a 1-on-1 personal training session. So glad to know that youre taking advantage of these amazing trainers and feeling the benefits of their workouts!!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 02:40:06.845693",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105414624210805868994/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNFltYnRBRRAB",
            "reviewer_name": "Brandon Chacon",
            "rating": 5,
            "review_text": "Decided to give PT instruction a shot at this location and was BLESSED with Emilio Caray. Completed an 8 week bench press program and it was BY FAR the absolute most progress I have made in such a short amount of time. 110% recommend, the results have spoken for themselves and I can safely say that Emilio s knowledge and PT experience brought my bench PR up SIGNIFICANTLY.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.849079",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107355740685035570589/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NS0tX0VBEAE",
            "reviewer_name": "Winnie Alaska",
            "rating": 5,
            "review_text": "staff is very nice! Sabrina was a great help in my new membership pass! she was very sweet and did a great job in my tour!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 02:40:06.851764",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102752369888220562804/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybHVqX01REAE",
            "reviewer_name": "Amanda Heredia",
            "rating": 5,
            "review_text": "It has been a great experience training with Fernando. He is an awesome trainer that pushes you to achieve your best. The gym is well equipped and the price is fair. The staff has been very nice accommodating my service dog during workouts.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:06.854354",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 52,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/109100454716134330943/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aGZqT3h3RRAB",
            "reviewer_name": "John Guimpol",
            "rating": 5,
            "review_text": "Great people, and awesome service. New space for the weight room was a great addition. Emily was very welcome during my first few months as a new member!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:06.857056",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100848217237191537800/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cU1ESU9BEAE",
            "reviewer_name": "jessie huang",
            "rating": 5,
            "review_text": "Andrea and the rest of the staff are amazing and very welcoming at this location. I have signed up for numerous gym memberships (elsewhere) in the past, however, I had always struggled to reach my fitness goals as I had no clue about what I was doing at the gym. However, under Andreas guidance, I had not only been able to progress rapidly but feel more confident in a short span of time. She is extremely knowledgable about fitness and diet so she is an amazing person to reach out to for any fitness inquiries. It has been amazing experience training with her!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:06.859776",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101608593681590364837/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z2JpU0NREAE",
            "reviewer_name": "Braedon G",
            "rating": 5,
            "review_text": "I started training with Amy in October as a complete gym novice, at 61, 170lbs, and basically 0 muscle. In just a few months of training I hit over 200lbs, drastically increasing my muscle mass without much increase in fat %. Amy helped me achieve something that honestly I would never have been able to do on my own in no time, and set me up to continue my fitness journey on my own with confidence. If youre new to fitness, lack confidence, or just want that extra help and accountability, I 100% recommend getting a personal trainer at Fitness World.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:07.575456",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116212744473436266231/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dU9yb1ZREAE",
            "reviewer_name": "Anna Kazimirchik (Ania)",
            "rating": 5,
            "review_text": "I love my gym!  This place is very versatile and can accommodate person with any level of fitness. Has area designated just for women and large bright space for fitness classes. That was important for me. Two large sections with weights and space for stretching. Very clean, great working hours and helpful friendly stuff. Definitely would RECOMMEND for a friend.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:07.579643",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/102691959035015976897/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdDdlNDRBRRAB",
            "reviewer_name": "N J",
            "rating": 5,
            "review_text": "Emilio Caray is an amazing coach! I use the word coach intentionally because he is far more than a personal trainer. I have been training with him for over 2 months now with the goal of feeling better in my body every day and I feel more motivated than ever. He perfectly knew how to adapt to my level as a beginner. He put together a personalized and comprehensive workout and nutritional plan for my unique goals and has inspired me to stay disciplined and accountable by making the sessions fun and empowering me to surpass myself week after week. Emilio is knowledgeable, has the required technical training experience and is overall a great human being! I loved that he never lost sight of my vision and goals, and that he is always accessible for quick question or motivational boost. I highly recommend him. Do not hesitate to contact him, he will put his professionalism and good humour at the service of your goals!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:07.583178",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 7,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/116135795876636437052/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOXZLRDVnRRAB",
            "reviewer_name": "Yueh",
            "rating": 5,
            "review_text": "The membership fee is affordable comparing to other gyms. They provide a women-only training area which attracts to me. All the staff in the gym are friendly. Special thanks to my personal trainer Hailey! She is an inspiring, knowledgeable, and fun trainer. Hailey is good at explaining the instruction to help me easily to understand and make the training process interesting. She monitors our lifestyle, nutrition, and progress closely to adjust our program accordingly. Not only she is training our physical work out but also enhancing our mental health.  I ve been training with her for over three months, and she encourage me to believe in myself and build up my confidence. if you have any questions, she will respond you quickly even not in the work hours and she will give you more feedback above your expectations. You always can trust her! And the most thrilling thing to me is now I enjoy my workout and it become one of my favorite exercises.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:07.587058",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 31,
            "total_number_of_photos_by_reviewer": 48,
            "reviewer_url": "https://www.google.com/maps/contrib/117740394705617440333/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaC1pd1FBEAE",
            "reviewer_name": "john kominakis",
            "rating": 5,
            "review_text": "I have been exercising regularly for more than 18 months now and have thoroughly enjoyed it. The gym has a pleasant atmosphere, reasonable membership fees, and a competent staff, including Justin, Julian, and Brian, whom I frequently encounter. I have a personal trainer named Fernando, who has been amazing in helping me lose 40 pounds over the course of 5 months and gained a insane amount of nuclear through nutrition and exercising",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 02:40:07.590503",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104025540254720422917/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeUlldnhRRRAB",
            "reviewer_name": "Jackie Li",
            "rating": 5,
            "review_text": "Had a mini one-on-one training session with trainer and instructor ARIKA today.  She was absolutely amazing at showing me how to use  the new equipment in what used to be the old pool area!  She was very knowledgeable, thorough and patient with her instructions. She s also very friendly and easy to talk to.  If you re looking for a personal trainer, I highly recommend Arika!  I look forward to booking more sessions with her in the future!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 02:40:07.593233",
            "response_from_owner_text": "Awesome to hear, Jackie! Thanks for the positive feedback, and we agree - Arika IS amazing!! Well see you around the gym! :)",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 02:40:07.593233",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105126355176093195260/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxNkktUWF3EAE",
            "reviewer_name": "Mitch s Kitchen",
            "rating": 5,
            "review_text": "The facility is very well maintained. The staff are very friendly. But the one that s standout the most is my trainer Cyril, I ve lost 35 lbs ever since I started. He helped me to become better version of myself. Now, I am more confident than ever.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:40:07.596258",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 5,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/102668367679193613086/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa3ZqbGxRRRAB",
            "reviewer_name": "Kylie Stansfield",
            "rating": 5,
            "review_text": "I hated the gym and I hated working out! I joined fitness world on Kingsway not knowing if Id last more than a week. I have now been going twice a week for the last couple months. The staff are amazing, the Workx classes are brilliant. Yanna is just a bundle of joy and I look forward to her class every week, Jeremy & Amy are absolutely brilliant and the staff are what make me return. Also Arika is a little gem! I did try out a different location too which had a totally different vibe, honestly if Id have gone to that location first I wouldnt have stuck with it!!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 02:40:07.598868",
            "response_from_owner_text": "Thanks for the lovely comment, Kylie. You and your husband Mark have quickly become a beloved part of our community here too!! So glad to hear that youre feeling at home with the vibes here as well!! As always, please let us know if theres anything we can do for you both!",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 02:40:07.598868",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117394898195197203799/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeS0zSDF3RRAB",
            "reviewer_name": "VN 175",
            "rating": 5,
            "review_text": "This is an awesome gym with affordable price, full of equipments for all types of exercises. Moreover, they just completed the new squat area with 6 squat racks for the squat lovers. Emilio is also a great PT who always followed up with my progress and helped me alot with my plan. Definitely recommend him to the one whos looking for not only a professional PT but also a friend",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 02:40:07.601739",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 81,
            "total_number_of_photos_by_reviewer": 36,
            "reviewer_url": "https://www.google.com/maps/contrib/101107198438234952930/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldDhXMi1BRRAB",
            "reviewer_name": "Emersen Ziffle",
            "rating": 5,
            "review_text": "I love hitting up Fitness World for my morning workout! The Staff are friendly and fun, and the trainers are tops. I was fortunate enough to train with Matt for about a year and he developed a killer workout plan that I am still crushing to this day. The people are always courteous and there is a welcoming vibe regardless of your fitness level. I really feel the positive impact this place has had on my life.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:07.604394",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108410702305628481974/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdC1iNEdREAE",
            "reviewer_name": "Stay Wove",
            "rating": 5,
            "review_text": "Great gym with friendly staff. Sarah did an amazing job of explaining the membership and touring me around the facility. She was also very professional and extremely patient with my questions. They do a good job of keeping the gym clean. Don t hesitate to come by and give this gym a try and definitely ask Sarah for the help",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.268099",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107272441192287340927/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbkxIYmdRRRAB",
            "reviewer_name": "kayleigh beaubien",
            "rating": 5,
            "review_text": "This is a great gym to come to and I would definitely recommend this location to my family and friends. The staff create a very welcoming environment and are extremely friendly. Ive specially been helped by Sarah Ana multiple times while visiting the front desk and she is the sweetest and most helpful worker, I would definitely come back to this gym because of people like Sarah Ana.",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 02:40:08.271903",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114118693883185495661/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaktteU9BEAE",
            "reviewer_name": "Ina Morales",
            "rating": 5,
            "review_text": "This gym is great and everyone is really friendly. Normally Im intimidated and lost when it comes to working out, but Ive gained so much confidence thanks to my personal trainer Michelle. Shes amazing and gets the best out of me. Ive never felt as strong and empowered as I do now, and its all thanks to Michelle :)",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.275300",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103287482413833218869/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtd19MVkNBEAE",
            "reviewer_name": "Joseph lieu",
            "rating": 5,
            "review_text": "Best fitness facility I ve ever been to. Excellent amenities, fitness classes, membership perks, fantastic staff / friendly members. Aileen at the front desk was absolutely amazing, she was warm and welcoming. This place is  located right off Kingsway next to white spot. Good gym within walking distance of restaurants. I will miss this place as I will be moving away to Bali. If I ever came back, this would be the place I would reside. Best Regards, Joseph Lieu",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.278409",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/103329482097556715180/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtZ043WnVnRRAB",
            "reviewer_name": "!SergioLuna!",
            "rating": 5,
            "review_text": "GREAT GYM! I ve going to this gym for almost a year. The gym is very comfortable with great machines. They have a big space on the second floor for stretching and other stuff. I had an issue with my account and the employee Maddie help me with it. She was very nice and solve my problem fast.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.281252",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114968934301467451779/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdTUzSUZ3EAE",
            "reviewer_name": "Mike Shishkanov",
            "rating": 5,
            "review_text": "My personal trainer Emilio was a perfect person to share and teach the way to grow muscles and gain weight (as my specific request), also, he ensured I m following my diet plan and completing all workouts assigned to me.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:08.284136",
            "response_from_owner_text": "Awesome to hear! Thanks for the positive feedback, Mike! We take pride in having some of the best trainers in BC!! Keep getting those gains!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 02:40:08.284136",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106315191902235018425/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtM3VUS1B3EAE",
            "reviewer_name": "Sarith Samarakkody",
            "rating": 5,
            "review_text": "I love this gym! It has everything you need for a complete gym. The staff here is so friendly and helpful. My personal trainer Kieran Kelly is the best. Hes really invested in helping anyone who wants to be a better version of themselves. The level of enthusiasm shown by Kieran for his clients including me is unmatchable. I managed to go from 20% body fat to 13% all thanks to his training with proper techniques.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.287074",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108731423421352257284/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MXFyVTlnRRAB",
            "reviewer_name": "James Tran",
            "rating": 5,
            "review_text": "Great gym, affordable prices. Handsome man behind the desk was very helpful during the gym tour, happy I picked this over Club16!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:08.289429",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/100593947232218136858/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyOUpiTUF3EAE",
            "reviewer_name": "Joy Sun (mysidianrabbit)",
            "rating": 5,
            "review_text": "Ive been coming to Fitness World for a little over 2 months now! I wanted to start working out and become fit for a long time, but had issues committing and also: gym anxiety. TL;DR: Fantastic gym, even greater personal trainers! I decided to get a personal trainer to hold myself accountable. Hailey K. is a fantastic PT: she not only helps me with my workouts, but also guides my nutrition. She encourages me to push myself harder, and accommodates and understands my bodys limits. Furthermore, shes available to answer my questions outside of PT hours via text message, which is incredible! I really appreciate her hard work, and her fun, positive energy. Ive made progress in both my strength and my confidence by leaps and bounds since I started training with her (and committing to the gym!). As for the gym itself, its well-maintained and the staff are all very friendly. Ive never had any issues with the equipment. I was also able to reach out to the staff for help on some of the machines. This gym is at a great location, with a supplement store right next door. Its a walk away from both the mall, and transit (bus+train).",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.292060",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109293991607505382112/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURld01xXy1nRRAB",
            "reviewer_name": "D Strutt",
            "rating": 5,
            "review_text": "Am new to this FW.  It has a terrific vibe.  The staff are welcoming and seriously helpful.  Today a staffer was helping set up a workout station for a member. Havent seen that before.  And that positive vibe has spread to the members.  Very friendly.  The gym has a number of separate areas that make it seem smaller and not so imposing.  Just a great place to work out.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.294423",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109144820169947124893/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtM00yWS1RRRAB",
            "reviewer_name": " ",
            "rating": 5,
            "review_text": "Great gym - spacious, has plenty of machines of all kinds, as well as free weight equipment. Membership prices are very affordable (as twice as less than that of GoodLife while the overall gym quality is at the same high level). There are also various group classes offered and a women-only area (cant speak of it though, as Ive never been there  ). Free guest parking is available as well (though not too big, so you might spend a while looking for a free spot during busy hours). The maximum subscription also includes the guest access option, when you can bring a friend with you for free (as many times as you want)! Plus, they offer 3 free admissions to try&see. Definitely recommend.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.946162",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": 58,
            "reviewer_url": "https://www.google.com/maps/contrib/106330986415581288023/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOU8zdU9REAE",
            "reviewer_name": "Maddie L",
            "rating": 5,
            "review_text": "I ve been coming here for about 4 months now and I ve never felt more comfortable in a gym! It s a clean and tidy gym with a great environment and employees. I decided to try out personal training and Mary is fantastic!! I m in the best shape I ve ever been. She has great knowledge on nutrition, workouts, and incredible energy. Once you tell her your goals she ll make sure you hit them and helps you strive for greatness. Fonzo, who I did my trial for personal training with, helped make such a great pairing and set me up with Mary! Their team is fantastic and makes the gym not so scary for beginners! :)",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.950274",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100461955482405388483/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZzRIN3l3RRAB",
            "reviewer_name": "Jonas Kuban",
            "rating": 5,
            "review_text": "A great gym that is clean, organized and remarkably welcoming. All of the staff are encouraging and always willing to help out with anything you may need. I highly recommend this gym, especially considering the lite price.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.953490",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104725109590113717666/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaDlhaVR3EAE",
            "reviewer_name": "Yihao Xu",
            "rating": 5,
            "review_text": "Ive been a member here for over a month now and special thank you to my personal trainer Emilio Caray! He is chill and fun to be with during training, and most importantly, I highly appreciate the program that he designed for me to help achieve my goals in athleticism. The program plans out all the exercises for each training session that are tailored to my needs and it even contains different phases as I progress over time. Over the course of a month, I have already seen significant results by following this workout program and nutrition guides: 4 pounds of muscle gain and 1.3% loss of body fat. This further motivates me to stay active and continue working hard towards my goals.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.956913",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/100279417819838234864/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ODd6TnlBRRAB",
            "reviewer_name": "Hoang Vu",
            "rating": 5,
            "review_text": "Great Gym! It is clean, well stocked and maintained. The atmosphere is very inviting, the staff, managers take time to acknowledge their gym members and make them feel welcome. The gym has a variety of equipment, including free weights, squat racks and machines.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.959951",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110440027313273293946/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScmZpZnB3RRAB",
            "reviewer_name": "Nick Valencia",
            "rating": 5,
            "review_text": "Shauna, Brian, and Jason were extremely friendly and helpful! Especially Shauna she deserves a raise! This location has really good customer service and will for sure be coming back.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 02:40:08.962848",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106906216920569619595/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c2VDeDhnRRAB",
            "reviewer_name": "Kathryn LePage",
            "rating": 5,
            "review_text": "The new add on is fantastic! Squat racks and platforms for days! Highly recommend. The staff are pretty cool too!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:08.965701",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103525326951749605435/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoa042dFZBEAE",
            "reviewer_name": "Howie Y.",
            "rating": 5,
            "review_text": "Daniel is the best personal trainer at fitness world Kingsway. He brought me from 22%bf to 17%BF in 3 months. And my strength went from 30lb for lat pull down to 60lb. And he works a lot on form.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 02:40:08.968384",
            "response_from_owner_text": "We couldnt agree with you more, Howie! So glad to hear that youre enjoying your PT experience with Dan! Keep getting those gains!",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 02:40:08.968384",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 137,
            "total_number_of_photos_by_reviewer": 1761,
            "reviewer_url": "https://www.google.com/maps/contrib/102671562532533051904/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeUpxQ2VBEAE",
            "reviewer_name": "Parav Patel",
            "rating": 5,
            "review_text": "The gym is very budget friendly. Staff members are very friendly and always welcoming to hear your problems out. Special thanks goes out to this one of the best personal trainer Fernando. If you are looking for someone who can be a friendly trainer who can boost you to achieve your fitness goals, help you out with your nutrition plans and do continuos follow ups  and get you a work out plan understanding your body properly then Fernando is the one you should get in touch for PT sessions. He not only provides you with workout plans but focuses on proper exercise positions so that you do not have any kind of injury post workout. Plus point of having him around is if you are having a bad day then he is the one who will ensure you leave the gym with a smiling face. He is flexible to help you out post gym hours too with your doubts and explains them in a very subtle easy to understand manner and always provides realistic approaches to your goals.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.971454",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114022060781367944492/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMV9MYUpBEAE",
            "reviewer_name": "Joel Valenzuela",
            "rating": 5,
            "review_text": "AMAZING GYM, AMAZING WORKOUTS! The staff here is incredibly friendly and extremely qualified! Fernando know how to push you to the limit in the best way and professional manner with your possible workouts. You will not leave disappointed! Such a family vibe as soon as you walk in the doors   I highly recommend checking this gym out.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:08.973877",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116396413797582640045/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMUl5QzlRRRAB",
            "reviewer_name": "Anna Feng",
            "rating": 5,
            "review_text": "Andrea has been a great personal trainer for me to start here! She always motivated me to come in the gym! without her I wouldnt have come as often and achieved as much as I did. She helped me with my protein intake and my meals too",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:09.601266",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108163278720154469462/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eEpYTjdRRRAB",
            "reviewer_name": "Richard Tran",
            "rating": 5,
            "review_text": "Just started my membership at this gym not to long ago. Love the environment here. The front desk staff are always so kind and welcoming. Aileen has especially been a really big help in adapting to the gym.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:09.605413",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112056010432256642541/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Z05QUUlBEAE",
            "reviewer_name": "Miguel Leon Li",
            "rating": 5,
            "review_text": "Jason at the help desk is super friendly and welcoming. Great gym, would recommend!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 02:40:09.609211",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117302935452120088993/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbzUyOVVnEAE",
            "reviewer_name": "Seung un Lee",
            "rating": 5,
            "review_text": "It has been a great experience training with Emilio. He is cool and an awesome trainer. My goal was to lose my weight and he supported me to achieve that goal. I will definitely get PT again with him. Thank you Emilio",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:09.612523",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105666078851515480709/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNUl2RGdRRRAB",
            "reviewer_name": "Dylan Amundson",
            "rating": 5,
            "review_text": "Great gym. Friendly and helpful staff. J.P is always friendly and goes out of his way to help and motivate people. Feryal and Sarah always make you feel welcome at the front desk and Janice is just the best! Highly recommended joining this gym.....if not why even bother going?",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:09.615854",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100071741921729901702/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycmFyc2RnEAE",
            "reviewer_name": "Javiera Munoz",
            "rating": 5,
            "review_text": "Im in love with this gym. Mary Liu is my personal trainer and she is amazing! I have never been consistent with the gym and now Im going 3-4 times a week. If you are looking to get into fitness, I highly recommend her, the workouts are fun.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:09.618746",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/109214635252341586629/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNla0t1U05REAE",
            "reviewer_name": "Ed",
            "rating": 5,
            "review_text": "Good training environment, equipment is legit and the staffs are extremely friendly. Kieran, Hailey, Matt, Julian and Justin are the the best supportive staffs around. Highly recommend this gym to anyone.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:09.621667",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/105860025137609298699/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtZ3VEUnVBRRAB",
            "reviewer_name": "Jasmine Kia",
            "rating": 5,
            "review_text": "The staff are always nice and helpful; the gym is  pretty clean and is a safe place for everyone. I ve been training with Hailey for a few months and she s amazing! She s a very professional coach and an inspirational person. Would 100% recommend her to all of my friends!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:09.624974",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116665054606101038446/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cnJuYmlnRRAB",
            "reviewer_name": "Treyton Chisholm",
            "rating": 5,
            "review_text": "Danila and Justin were both very helpful with me today. I highly recommend reaching out to them for any questions regarding training at the Kingsway location.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:09.628399",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101833976717191291237/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldmNmMEtnEAE",
            "reviewer_name": "Miu Miu",
            "rating": 5,
            "review_text": "Went to Fw burnaby location. Along kingsway. Friendly staff, clean equipments, staff are very helpful. I walked in the gym and i was greeted by their staff. Im just beginning my fitness journey. First time visiting this gym. I was happy i went to this location. I met one of their staff name Justin.  he gave me a tour of the facility and gave me information about their program.  I i was embarassed not knowing how to use any of the equipments but Justin made me feel comfortable, taught me the basics to start. Very knowledgeable. I would recommend this gym to friends and family.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:09.630989",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105403005856886894543/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOThlWTd3RRAB",
            "reviewer_name": "Changmei Han",
            "rating": 5,
            "review_text": "I started with Fitness World and decided to get some Personal Training with ANDREA. It was the BEST DECISION! I have tried to start the gym lots of times before and always ended up quitting, for the first time I have seen progress and have a plan so I am not wasting time in the gym anymore.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:10.287357",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105202376179008780015/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaElIY1d3EAE",
            "reviewer_name": "Diego Cardona",
            "rating": 5,
            "review_text": "Great Gym. I am 100% the parking lot is always full because non-clients park there, but that just comes to show how    incredibly positive and friendly the team is. I had never taken personal training until I signed up at fitness world Kingsway. Jodie has been with me since day one and boy is she the best personal trainer. She is definitely the best  personal trainer in this location. I used to not be able to do a single push-up, now I ca do 30 or 40 in a row, no problem",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:40:10.291744",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115020742440085653465/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bG9tUnhRRRAB",
            "reviewer_name": "Gabriela Molina",
            "rating": 5,
            "review_text": "Jeremy is the best pt, patient and kind with his clients, and Justin is excellent at front desk and amazing at costumer service, very friendly staff that are really helpful and non judgmental",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:10.294873",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107331603318289711788/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M01TODVBRRAB",
            "reviewer_name": "Fraser Picard",
            "rating": 5,
            "review_text": "Cool gym, great atmosphere, and all the staff are super helpful, Danila, Justin and Julian help me all the time!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:10.298226",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110518354636036970491/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M0pTaFFnEAE",
            "reviewer_name": "Christopher Ballard",
            "rating": 5,
            "review_text": "Been going here for a while, love the gym very spacious and there s always a pt to help out on the gym floor!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:10.301263",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/115112025049338515603/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXaXFiUkxnEAE",
            "reviewer_name": "Kavi Wickramarachchi",
            "rating": 5,
            "review_text": "I have been training with my trainer Cyril for about 4 months now and he is such an amazing trainer and very professional,knowledgeable, supportive and inspirational. Most importantly he always pushes me to go above and beyond my limits and also he keeps in touch with me to check whether I am on right track. I am glad to choose Cyril as my personal trainer and look forward to continue my fitness journey with him.Cyril is the best and I highly recommend him to anyone who needs guidance to achieve their fitness goals.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:10.304206",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108502029277918606763/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMk0tS1dnEAE",
            "reviewer_name": "Mike Estevez",
            "rating": 5,
            "review_text": "Nice fitness place. The facilities are great. I usually come early morning because later gets busy. The staff is awesome. Sarah was very kind and helpful with any inquiries.",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 02:40:10.307060",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 69,
            "total_number_of_photos_by_reviewer": 120,
            "reviewer_url": "https://www.google.com/maps/contrib/110965459709793899554/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxak5LaFNBEAE",
            "reviewer_name": "Harsangeet Singh",
            "rating": 5,
            "review_text": "Great environment, friendly staff, would 100% recommend this gym to everyone. Ive been training with Fernando for a while now and he always keeps me on track. Whether its training or nutrition, he always pushes me to my highest potential. Even the most basic exercises would seem tough to me, but looking at how far Ive come with the training makes me more excited for gym sessions. Fernando keeps me motivated at all times, he takes his time explaining the form of the exercises and keeps the workouts interesting by switching them up once every while. I am becoming more comfortable and confident with my body shape and strength, and I thank him for that!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:40:10.309889",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114250795359013161597/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxOU5fbVZREAE",
            "reviewer_name": "Judy Ban",
            "rating": 5,
            "review_text": "I ve had an excellent experience training with Kat here, I can say she s one of the best trainers I ve worked with so far! She really takes the time to get to know you and your body. My favorite aspect about working with Kat is that she tailors the program not only to my goals, but also in consideration of my physical weaknesses and my abilities. For example, we worked on improving my squat form because she noticed one of my legs have tighter tendons than the other. My form was better after day one! Kat is funny, energetic and above all super motivating! She has my absolute recommendation!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:40:10.312732",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107263680969072941709/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbXA2Y2J3EAE",
            "reviewer_name": "Mariel",
            "rating": 5,
            "review_text": "Awesome gym! Ive been training with Jodie for a few weeks now and shes always been patient with me and pushes you enough for a great workout!   Absolutely lovely staff! Friendly and easy to talk to if theres any issues that come up and i think thats what makes this gym great",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:40:10.315174",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111997570847651373892/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdGN5ekJBEAE",
            "reviewer_name": "Erik Rink",
            "rating": 5,
            "review_text": "Very well kept gym nice and clean with a wide range of equipment. The front desk lady, I think it was Sarah, was particularly helpful and friendly on my first visit there. Will be returning regularly",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:10.958764",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103151318487157058893/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dklqMG93RRAB",
            "reviewer_name": "Ashlee van Spronsen",
            "rating": 5,
            "review_text": "Gym is very nice, Danila is one of the best employees I ve ever seen!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 02:40:10.962875",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114650348301011564674/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNla092UVN3EAE",
            "reviewer_name": "Yun-Hua Tai",
            "rating": 5,
            "review_text": "Membership fee is cheap. Staff are friendly. When we register, Julian helps us a lot. And the trainers are professional. Highly recommend Hailey who is really nice and passionate. Overall is awesome!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:10.966366",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100071894386380747724/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtLWZPQkpBEAE",
            "reviewer_name": "Vrushabh Gore",
            "rating": 5,
            "review_text": "I have been training with Kieran for 3 months and simply one of the best trainers, this person checks up on you keeps you on track and helps you achieve your goals period. Although I am not a very motivated person. But over the last 3 months I see great strength improvement and just feel better about myself! Amazing place!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:10.969742",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/109803873909940570658/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlb2ZtV1NREAE",
            "reviewer_name": "Sebastien Poidevin",
            "rating": 5,
            "review_text": "This gym is incomparable the environment that the staff bring is not only kind, welcoming and interactive but also extremely comedic, supportive they truly care about your fitness. I highly recommend this gym to anyone who is looking to change their lives.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:10.973105",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111309688828244284893/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNThIb1VnEAE",
            "reviewer_name": "Alexander Stanley",
            "rating": 5,
            "review_text": "Great gym with lots of equipment and helpful staff! I was a member for 8 months and trained with Caroline. I lost 18 pounds with her help. She is amazing!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:10.976029",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 12,
            "reviewer_url": "https://www.google.com/maps/contrib/111240093734553246735/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeThlTGdRRRAB",
            "reviewer_name": "hana son",
            "rating": 5,
            "review_text": "I cannot say thank you enough to my awesome personal trainer, Hailey Kim  . During the Covid time, I gained so much weight and no exercise for years.. and without her help, I would have stayed the same. Her knowledge and her passion towards being healthy helped me so much not only to lose weight but also being healthy. Because of her, I ve got the courage to exercise,the healthy lifestyle and most importantly how to enjoy the workout!!!!! I am amazed how my body has been changed just by listening to HER. I had another personal trainer 5 years ago from different gym (not Fitness World) before I met Hailey. Not trying to compare, but I know for the fact that what I learned this time and before there are huge differences. She knows how to motivate ppl and that is super important especially if you are new to this. If you ever need a personal trainer, you should look for Hailey Kim. She is just amazing. Thank you so much Fitness World and Hailey",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:10.979107",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107298284645675800499/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybUtQdWRnEAE",
            "reviewer_name": "Jaz Rehal",
            "rating": 5,
            "review_text": "My trainer is Caroline, and shes wonderful with great customer service skills. Although I was skeptic about their services in general, I was pleasantly surprised with the overall experience and the variety of equipments. The staff is extremely friendly and accommodating.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 02:40:10.981678",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/102041393769410549800/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMm9fMnFBRRAB",
            "reviewer_name": "Abhishek Pawar",
            "rating": 5,
            "review_text": "Been training with Cyril for over a year now. Lost 25 pounds and concentrating on developing my core. He s an excellent trainer and works really hard to find an exercise that suits your body and flexibility. He continuously updated the routine which never makes gym boring. Will always motivate you and pushes you to be at your best! Great experience!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:40:10.984412",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 42,
            "total_number_of_photos_by_reviewer": 122,
            "reviewer_url": "https://www.google.com/maps/contrib/103277460841429694951/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLenA2bGZBEAE",
            "reviewer_name": "Amanda Wong",
            "rating": 5,
            "review_text": "I completed a few training sessions with Jodie and believe she is an amazing trainer. She is kind, patient and extremely knowledgeable. I can say that Jodie genuinely cares about her clients as she was able to carefully listen/answer my questions even after each session had been completed. I learned a lot from Jodie - she taught me how to do each exercise correctly with form, helped me come up with workout plans and gave me a lot of informative tips. She definitely helped push me out of my shell and I feel more confident in myself when it comes to heavier lifting now. I really enjoyed my sessions with her and definitely plan to take more with her in the future!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 02:40:10.986911",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 12,
            "reviewer_url": "https://www.google.com/maps/contrib/114898719033604078613/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}