{
    "place_id": "ChIJV1fttPdzhlQRTvWMaI4H8UQ",
    "reviews": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOXZDNEJREAE",
            "reviewer_name": "Mohammadreza Behnejad",
            "rating": 5,
            "review_text": "An amazing combination of all sort of foods from silk road. The atmosphere is great. We had a stupendous night. Variety of Persian, Afghan, Indian and middle eastern dishes. Idea of feast menu is very unique and attractive. You will get small tasting portion of every dish bottomless. The only thing I did like much was that manager was keep reminding that it is not sharable. Although we had everyone ordered at least a main course. Furniture is not super comfy but yet gives you a good feeling. Good live music. Free parking is available. Vegetarian options: Plenty of vegetarian dishes available most egg plant based Parking: Available free 2 hour covered parking for customers Kid-friendliness: Safe place Wheelchair accessibility: Grand floor access",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-10 02:06:53.189722",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 358,
            "total_number_of_photos_by_reviewer": 3077,
            "reviewer_url": "https://www.google.com/maps/contrib/107421872232324988768/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMl9qTTR3RRAB",
            "reviewer_name": "Rachana Eswarappa",
            "rating": 5,
            "review_text": "I have been here a few times and every time they am amazed by their service and food! First, you are greeted with their refreshing ginger lemon tea   The food taste, portion size and quality is just perfect! They have 5-6 dishes in both vegetarian and non-vegetarian recipes and you can get try pretty much all of them with different combinations which I think is the best way to explore their entire menu!!   The food is a fusion of Indian and Mediterranean cuisine and plated in a Nutritious way which is cherry on top! This place has a great ambiance and located is at a great location; convenient for people taking public transportation as well as driving. Street parking is available on Main Street and on side streets. They have a very friendly and welcoming staff which I feel elevates the whole experience!! Definitely, going back again!!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:06:53.192543",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 664,
            "reviewer_url": "https://www.google.com/maps/contrib/103612485179390372438/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNnY3Rjl3RRAB",
            "reviewer_name": "Adeeb Arif",
            "rating": 5,
            "review_text": "Definitely 5/5. This place is known for their Chai Feast Menu, a buffet, starting with a salad, soup, rice, boulani(aloo parhata) and 2 mains. The dishes come in small portions, you can keep ordering more of different dishes. We tried most dishes on the menu, everything tasted quite authentic and great, nothing we hated. Honestly it was great. Chai was fantastic too. The price of the Chai Feast was 33 CAD.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-17 02:06:53.195352",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 138,
            "total_number_of_photos_by_reviewer": 332,
            "reviewer_url": "https://www.google.com/maps/contrib/118439707366045419857/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsemVhS2FREAE",
            "reviewer_name": "Paulina De Cenizas",
            "rating": 5,
            "review_text": "Absolutely 10/10! Had the platter and I loved it! All the foods I got were amazing and there were great options for my cousin and his wife who are vegetarian/gluten free. Can t wait to go back. My only problem is the lack of space in my stomach to fit all the lovely food! I ll work on it before my next visit. ;)",
            "published_at": "a week ago",
            "published_at_date": "2023-11-24 02:06:53.197601",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/107309784471989695164/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdzlLWWVBEAE",
            "reviewer_name": "GC Sears",
            "rating": 5,
            "review_text": "East is East delivers a sensory experience to delight and entertain todays demanding patrons.  The popularity of this restaurant is well deserved. We were a party of five and had made reservations in advance.  It was busy and walk in dining could not be accommodated while we were there.  The restaurant is open and decorated with natural woods.  Peppered throughout the restaurant are art and curiosities in a respectful nod to eastern traditions and culture.  Everything is impeccable, tidy, and clean. Service was excellent.  Our waitress was friendly and well versed in the menu.  As I mentioned, East is East is a busy restaurant and our waitress was running to keep up.  She remained friendly and approachable throughout the meal. We also loved the live entertainment.  We started with a Vietnamese musician playing a 16 string zither.  They were followed by lively flamenco dancers.  It was fun and complimentary to the ambiance of East is East. The food was varied and delicious.  It is based primarily in middle Eastern traditions.  We had the Silk Road option, which gives unlimited small portions and you can try all the different flavors on offer.  Spices are layered and complex, with a decidedly softer tone compared to Indian cuisine in my opinion. This is a dining experience and well worth your time and effort to try.  There is a two hour dining limit and street parking can be a challenge in this area; but neither of those factors should discourage you from trying this excellent restaurant.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:53.200008",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 105,
            "total_number_of_photos_by_reviewer": 389,
            "reviewer_url": "https://www.google.com/maps/contrib/110692927671393870212/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeS12RFZBEAE",
            "reviewer_name": "Vitaly L",
            "rating": 5,
            "review_text": "Warm and relaxing atmosphere! I was impressed with the way you order your dishes. Practically you can try everything they have in small portions. Amazing idea. Smiley and courteous staff. Pillows and cussouns on seats. Delishous food. Will return with family or friends! Recommended!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:53.202587",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 219,
            "total_number_of_photos_by_reviewer": 1918,
            "reviewer_url": "https://www.google.com/maps/contrib/116924047148274954859/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaek1Qa1p3EAE",
            "reviewer_name": "Marina Bilyk",
            "rating": 5,
            "review_text": "First time with my husband we visited this beautiful place. We chose it randomly, but when we entered the restaurant we felt ourself in a fairy tale! They brought us national tea with milk and spices as a compliment. Very nice music, great service. The interior is like in a fairy tale! The girl named Manpreet is a wonderful professional. Since we didnt know the cuisine, she picked our food according to our preferences. Thank you so much Manpreet, a good restaurant depend on the delicious food and the people who work there! We will definitely return for dinner in the near future.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:53.205395",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 109,
            "reviewer_url": "https://www.google.com/maps/contrib/115262718468582827463/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNzdIR1pBEAE",
            "reviewer_name": "Iven Tse",
            "rating": 5,
            "review_text": "Just had their Feast - it may seem pricy at $33 - but oh is it ever worth it! You order a salad, a soup and two small dishes to start, and the  second order with many selections after . And third and fourth and so on . My fave was the lamb curry and the spinach paneer. The food is amazing and the service!! Erika deserves more than a cookie! Amazing, courteous and serene and pleasant and fast! Amazing!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-17 02:06:53.207833",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 83,
            "total_number_of_photos_by_reviewer": 48,
            "reviewer_url": "https://www.google.com/maps/contrib/105682553392154226614/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcnNDRW93RRAB",
            "reviewer_name": "Ive's Fotos",
            "rating": 5,
            "review_text": "The service was lovely, prompt, and very thoughtful.  The server took time to explain their sampler page, which I would definitely recommend.  To start, you choose from soup or dal,  from one of three salads, then, either hummus or baba ganoush, then, three mains from the sampler page.  Small ceramic dishes, full of deliciousness are served on a thali with a mix of both Afghan and basmati rice, and two breads, naan and boulani.  A couple of things that take the experience to the next level are that if you liked one of any of the items on your thali, you can order more... not only that, but if you want to try a different item from the sampler page, you can do just that.  The process allows you to try many or all of the flavours.  Everything was great.   The musicians that were on last night... well.. I will leave their song selection and musicianship for you to decide whether you like it or not.     Those of us who were in the restaurant clapped in their support, regardless.  Definitely check this place out! Vegetarian options: Vegetarian options available. Dietary restrictions: Lower carbohydrate items available (omitting breads, rice, and other items higher in carbohydrates, of course).",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:06:53.211200",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": 18,
            "reviewer_url": "https://www.google.com/maps/contrib/107297910352904872045/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cXNiV09REAE",
            "reviewer_name": "K (Kate)",
            "rating": 5,
            "review_text": "Amazing experience with Flamenco    night. Food is delicious, and the best chai I ever had! They charge a $5 fee for the performances but it s worth the experience! Dietary restrictions: Gluten free available.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:06:53.214031",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 77,
            "reviewer_url": "https://www.google.com/maps/contrib/108316439484601301081/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaek5QQWZREAE",
            "reviewer_name": "KoRoL777",
            "rating": 5,
            "review_text": "First time with my wife we visited this beautiful place. We chose it randomly, but when we entered the restaurant we felt ourself in a fairy tale! They brought us national tea with milk and spices as a compliment. Very nice music, great service. The interior is like in a fairy tale! The girl named Manpreet is a wonderful professional. Since we didnt know the cuisine, she picked our food according to our preferences. Thank you so much Manpreet, a good restaurant depend on the delicious food and the people who work there! We will definitely return for dinner in the near future.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:53.845178",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/102059412123985705397/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseV9hVTdBRRAB",
            "reviewer_name": "Amber Bright",
            "rating": 5,
            "review_text": "The Mystic (mushroom) soup explodes with flavour! Every dish I tried tasted vibrant. Salt rocks and live music in the room is an ambience treat. Vegetarian options: Good variety of vegetarian dishes.",
            "published_at": "4 days ago",
            "published_at_date": "2023-11-27 02:06:53.847365",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 73,
            "total_number_of_photos_by_reviewer": 221,
            "reviewer_url": "https://www.google.com/maps/contrib/116052742305758397124/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMThDX253RRAB",
            "reviewer_name": "This food",
            "rating": 5,
            "review_text": "Came here with a reservation (highly recommend to do) and we re seated on time without any waiting (6:45pm on a Friday). Service was great with attentive servers and making sure our empty bowls were removed right away so that we could order more. Our server explained what to expect with the menu. She was very kind overall. Food was delicious. Lots of flavour and spices with each spoon full. All the ingredients were fresh. The lamb and chicken were juicy and not dry. To the mango lovers - the mango chicken and the mango butternut squash. I highly recommend both and trying all the dishes. We were already full after seconds. Would definitely recommend their Eastern ecstasy dessert. The gulab jaman is soft and hits the spot for your sweet tooth. Performance - very entertaining with live performance. We must support our local artists for their entertainment!! $39 for the sample menu $5 entertainment fee for each person to support the local artist that perform $13 for the ecstasy dessert All worth the experience and price of East is East! Would highly recommend for small or large gatherings.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:06:53.849796",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 198,
            "total_number_of_photos_by_reviewer": 884,
            "reviewer_url": "https://www.google.com/maps/contrib/111378945626897872641/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdFkteHZBRRAB",
            "reviewer_name": "Tina Wu",
            "rating": 5,
            "review_text": "I visited East is East spontaneously for dinner. I went for the buffet. There was a live piano performance happening which I appreciated very much. I was in love with their lamb curries. There are many options to choose from if you pick the buffet option. I pretty much tried everything on the menu and they do a great job balancing the flavours and seasoning with each dish. Everything is unique.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:06:53.852429",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 79,
            "total_number_of_photos_by_reviewer": 75,
            "reviewer_url": "https://www.google.com/maps/contrib/105680156227809011484/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKZ1lqZzBRRRAB",
            "reviewer_name": "H Malik",
            "rating": 5,
            "review_text": "Food was amazing! Highly recommend their Chai Feast platter, so many options to choose from and every dish we tasted was delicious. Do try their dessert named Eastern Ecstacy, it was fantastic and we also enjoyed their Persian tea!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:53.855025",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/110499349814593740841/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX0l2LUZnEAE",
            "reviewer_name": "maede",
            "rating": 5,
            "review_text": "The food quality was acceptable but the atmosphere and the dance show on the weekend was AMAZING!! You should give it a try, it definitely worth it!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:53.857636",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 32,
            "total_number_of_photos_by_reviewer": 71,
            "reviewer_url": "https://www.google.com/maps/contrib/114187292827466699037/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoel9TNXpnRRAB",
            "reviewer_name": "Alex Edmont",
            "rating": 5,
            "review_text": "The ambiance was amazing. Live drummer and harp player throughout our entire dinner. The food was delicious and our waitress Jyoti was so kind and made our experience one of a kind. Service was very fast and efficient; all staff helping each other out. Was really an experience; will come again!",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:06:53.860297",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 370,
            "total_number_of_photos_by_reviewer": 1358,
            "reviewer_url": "https://www.google.com/maps/contrib/109256226568466779591/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadkpxeFJREAE",
            "reviewer_name": "Faithe Notheisz",
            "rating": 5,
            "review_text": "The ambiance is lovely, when I was there they had a woman playing harp. We did the feast and it wasnt until the servers asked about round two before we realized it was all you can eat and then proceeded to eat so much food. Lots of vegan options.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:53.862044",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 26,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/117890502512494826130/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabnZfRklBEAE",
            "reviewer_name": "Snoopy Kitchen",
            "rating": 5,
            "review_text": "Chai feast is all you can eat option if you are new to Indian/Persian food like me.  Servers are all very nice and patience to explain everything.  Various Chai tea options and all taste good. Vegetarian options: Lots of vegan choice on the menu",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:06:53.865618",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 181,
            "total_number_of_photos_by_reviewer": 767,
            "reviewer_url": "https://www.google.com/maps/contrib/103548710091204065466/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPZ2FLYzJRRRAB",
            "reviewer_name": "Anne D",
            "rating": 5,
            "review_text": "A delicious dining EXPERIENCE! Take a magic carpet ride and be transported to an exotic land..we did not expect any of this, as we stopped in casually, having neglected our bodies  needs for nourishment past noon..luckily we ended up here, it was not busy as we entered, but filled up as we sat down. Servers were efficient and polite, dressed in beautiful ethnic styles. Food was beautifully spiced. I enjoyed the eggplant & potato-cauliflower wraps, hubby had lamb curry. Chai tea was supremely hot & perfect, not too sweet. They give you a little sample while ordering, which of course, led us to ordering full cups..scrumptious! Most impressionable was the decor and ambiance with carefully thought out details, and none of it would have had the same appeal without the impeccable food.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:53.868307",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 82,
            "total_number_of_photos_by_reviewer": 145,
            "reviewer_url": "https://www.google.com/maps/contrib/109637979676681645437/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaUxiTUtREAE",
            "reviewer_name": "Ruxandra Fediuc",
            "rating": 5,
            "review_text": "Wonderful atmosphere, I really love live music! And the food is an experience.. so many flavours! I definitely recommend the feast, just go hungry and explore   Such a lovely place for a date or a night out with dear friends!",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:06:54.444052",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 91,
            "total_number_of_photos_by_reviewer": 1503,
            "reviewer_url": "https://www.google.com/maps/contrib/104899269522992568414/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNklUUzZBRRAB",
            "reviewer_name": "Sharzi BD",
            "rating": 5,
            "review_text": "Oh my God!! All foods are so delicious It s worth it to try for sure! The atmosphere is different with an amazing live music Food : 5/5",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:54.446652",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 139,
            "total_number_of_photos_by_reviewer": 790,
            "reviewer_url": "https://www.google.com/maps/contrib/102937192777021504560/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMEpENjV3RRAB",
            "reviewer_name": "Saranraj Annamalai",
            "rating": 5,
            "review_text": "Blown away by the entire experience. The ambiance was amazing, with beautiful decor and a warm atmosphere. The live instrumental music added to the cultural atmosphere and made the evening even more special. But the real standout was the food and hospitality. The dishes were all incredibly delicious and expertly prepared. My favourites in the Chai Thali were the Mango Butternut squash, Lamb curry, Mango prawns, Alu gobi with the tamarind punch and the Kheer made of Almond/Coconut milk. The staff were incredibly friendly and accommodating. They made sure we had everything we needed and went above and beyond to make our evening special. My only feedback would be the size of the tables and chair. They were too small and not comfortable, but the food experience made us forget the discomfort. Overall, it was an unforgettable dining experience and I would highly recommend this restaurant to anyone looking for delicious Indian food and top-notch hospitality in Vancouver.",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:06:54.448934",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 61,
            "total_number_of_photos_by_reviewer": 155,
            "reviewer_url": "https://www.google.com/maps/contrib/117359912892386061427/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNGVpRnpRRRAB",
            "reviewer_name": "Katya Morenets",
            "rating": 5,
            "review_text": "Absolutely fantastic place with delicious food! It is an absolute must! I have been there many-many times! They also have live music  after 7. Live spanish flamenco on Fridays and Saturdays.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:54.450882",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 33,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/106763291075990235723/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSakpTeG93RRAB",
            "reviewer_name": "Amita Sharma",
            "rating": 5,
            "review_text": "Visited this restaurant after many years and did not disappoint! The restaurant is situated on Main Street, hub of eclectic cuisine. East is East has a warm, welcoming atmosphere and ambience is perfect. Was lucky enough to listen to live music while dining. Every guest is welcomed with a steaming cup of chai which really arouses your senses. Their most popular offering is the Chai feast, a sort of tasting menu, where you choose salad, soup, cold mezze and 3 main course options served with naan, boulani and rice. Dishes are bottomless so one can taste a large variety of dishes with no restrictions.  Food is well spiced, fresh and is a pleasant fusion of Indian, Middle Eastern, Southeast Asian and Afghanistani cuisine. Plenty of vegetarian options, which is a pleasant surprise. Also tried their steaming cup of chai, with a strong ginger essence. If you are lucky enough you will also get a chance to hear live music while you dine. Great experience",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:06:54.452878",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 50,
            "total_number_of_photos_by_reviewer": 45,
            "reviewer_url": "https://www.google.com/maps/contrib/101835521088750752083/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbDdiaVp3EAE",
            "reviewer_name": "Shaan Somani",
            "rating": 5,
            "review_text": "This was, without question, my familys favorite restaurant during our recent trip to Vancouver. The silk route tasting menu offers the opportunity to order a variety of different foods, but even better, you can continue ordering new dishes even after youve finished your first round. Given the quality of the food, at only $30 USD per person, it felt like an absolute steal. My favorite dishes were the baba ghanoush, mystic soup, peas and cheese, and lamb curry.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:06:54.457120",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 433,
            "total_number_of_photos_by_reviewer": 1109,
            "reviewer_url": "https://www.google.com/maps/contrib/105034625848482990762/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1c1l6TU9BEAE",
            "reviewer_name": "Kazu Kohakura",
            "rating": 5,
            "review_text": "Set Manu was great, a large variety of curry which you can reorder. The Chai latte was also great Food : 4/5",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:06:54.459013",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 39,
            "reviewer_url": "https://www.google.com/maps/contrib/115835241244574622424/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMzlDYU13EAE",
            "reviewer_name": "Iris Chen",
            "rating": 5,
            "review_text": "The silk road feast is a must try! It comes with an unlimited amount of salads, soups, breads, rice and main dishes. You can choose as many dishes as you want (like a buffet, except its served to you) and youll want to try a lot because theyre all very good. There are vegetarian, fish and meat options. Also very cute how you are given a tiny cup of chai when you enter. The interior is absolutely beautiful with very detailed and thought out decor. There is a nice patio and even a stage where live music is performed sometimes.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:06:54.461085",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 69,
            "total_number_of_photos_by_reviewer": 39,
            "reviewer_url": "https://www.google.com/maps/contrib/104349469418576234781/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMTdXSWl3RRAB",
            "reviewer_name": "Gemma P",
            "rating": 5,
            "review_text": "Chai feast tasting was right choice to order as it s fame. Servers were kind and frequently asking us if we want to fill dishes with a new menus. Which was so fascinated to try all the different kind of eastern meals. I booked on Saturday night to see Flamingo with my husband and kids. (You can check their performance schedule on website. It s pretty good.     charges $5 per each person for entertainment fee) This place serves you chai latte for welcoming drink and I loved it and ultimately ordered other different kinds of lattes as well. ice cream dessert with indian style donut(Don t know it s name )was made with rose water. I never tasted something like this, so it was pretty unique. I visited again, few days later with my friend. This time I ordered double wraps. It was so worth the price. Salad and soup with different kinds of two wraps; was big portion for me to finish it. Anyway, I love this ethnic vibes and decent food. I would highly recommend",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:06:54.462970",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 41,
            "total_number_of_photos_by_reviewer": 124,
            "reviewer_url": "https://www.google.com/maps/contrib/102861320708135243972/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cHEyNU5BEAE",
            "reviewer_name": "Gurpreet Kaur",
            "rating": 5,
            "review_text": "Great place No complaints..  The food was really good. Live music is a big plus  heard piano and Cello playing.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:06:54.464778",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 108,
            "total_number_of_photos_by_reviewer": 72,
            "reviewer_url": "https://www.google.com/maps/contrib/103811471718738041289/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Mzlxbkl3EAE",
            "reviewer_name": "Nelson Mah",
            "rating": 5,
            "review_text": "Fun and entertaining live Spanish singing and dancing If sensitive to noise, try not to sit too close to the front of the stage. Stomps get really loud Food was good and authentic. Some audience people said it feels just like Spain",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:06:55.062136",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 461,
            "total_number_of_photos_by_reviewer": 520,
            "reviewer_url": "https://www.google.com/maps/contrib/109204681398540821958/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXN0xUSVRREAE",
            "reviewer_name": "Colette Wong",
            "rating": 5,
            "review_text": "Delicious unlimited food if you order the Chai Feast tasting menu, which allows you to try everything on their menu in small portions, which is exactly what I love to do regardless of what restaurant I go to! I personally prefer to get lots of different items and try more things, so usually that means needing to come with a group of people and sharing plates, but in this restaurant, it makes it great to be able to come to alone as well as with a group because there are so many options to try! I also loved the unique detailed decor and the whole atmosphere of the restaurant too, it was a fusion unlike anything else Id seen before, and would definitely come again! The waitress even heard it was our friends birthday after we had finished eating and paid, and gave her a free dessert to go before we left!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:55.064336",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 12,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 443,
            "reviewer_url": "https://www.google.com/maps/contrib/108720839423103551449/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcU1LY3dnRRAB",
            "reviewer_name": "Kimia Pourshaban",
            "rating": 5,
            "review_text": "My partner and I came here for date night and really enjoyed it. We are middle eastern so we are familiar with the food, and I think it s nice to be able to try little bites of different foods with the silk route feast. We felt like the food was good, and it was a nice date night experience. The live music idea is good but the particular one the night we went wasn t that great. Their service was really good, and I particularly appreciated that they would clear out empty dishes asap, as they would see them walking by. We will definitely be back. Vegetarian options: Lots of vegetarian friendly options!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:55.065988",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 34,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117674417319432973687/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bG8za2NREAE",
            "reviewer_name": "Christine L",
            "rating": 5,
            "review_text": "Food, service, ambiance 10/10. The tasting menu is great if you want to try an unlimited number of small dishes, each packed with amazing flavours. The decor is beautiful and the restaurants atmosphere is very lively. Highly recommend!",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:06:55.068196",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 37,
            "total_number_of_photos_by_reviewer": 121,
            "reviewer_url": "https://www.google.com/maps/contrib/102737491014776134355/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadE9tZjB3RRAB",
            "reviewer_name": "Krish Rengachari",
            "rating": 5,
            "review_text": "Very busy restaurant, suggest making reservations ahead. Food was very tasty and unique to Afghan, Indian and the frontier region.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:55.070301",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 263,
            "total_number_of_photos_by_reviewer": 2813,
            "reviewer_url": "https://www.google.com/maps/contrib/118270021490669060975/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycXJUVVBnEAE",
            "reviewer_name": "W Lyons",
            "rating": 5,
            "review_text": "We had a fantastic overall dining experience for a group of three on a Sunday evening. We had live music and we each participated in the Chai Feast, which I highly recommend for first time visitors. This option is ultimately an all you can eat dining experience where you can select any number of dishes from the specific Chai Feast menu. We each tried ordering at least one of everything off the menu, but were so stuffed by the end we missed our mark by a couple of dishes. The consensus of the best dishes were the mushroom and eggplant, spinach paneer, and Afghan eggplant. Lamb curry and mango prawns were also delicious. I would definitely recommend for anyone looking for a true feast and would definitely return for this menu again! Also, the Chai was SO good.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:55.072458",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 377,
            "total_number_of_photos_by_reviewer": 2352,
            "reviewer_url": "https://www.google.com/maps/contrib/107276633468875278371/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNablB5bVN3EAE",
            "reviewer_name": "Ziad Aboukhater",
            "rating": 5,
            "review_text": "Our first time here and we were delighted by the attentive service and warm hospitality. We re usually cautious with fusion cuisine but this place has found the perfect balance. Can t wait to come back and try more of it! The live performance was enjoyable but not the highlight of our visit but the cover charge was very reasonable and we were happy to pay it.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:55.074050",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 61,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/114787631267894625470/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Ni11VnZ3RRAB",
            "reviewer_name": "Mel Lai-Ho-Tong",
            "rating": 5,
            "review_text": "Lovely experience! We ordered the Chai Feast which was essentially all you can eat/taste of the various curries that have on the menu, and it includes roti, rice, soup and salad for $30. Very good value! We also ordered fresh chai tea and everyone loved their chai. The atmosphere and ambience was nice as well!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:55.075885",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 174,
            "total_number_of_photos_by_reviewer": 1240,
            "reviewer_url": "https://www.google.com/maps/contrib/114953032487410987417/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNUlDZDRRRRAB",
            "reviewer_name": "Robert Fisher",
            "rating": 5,
            "review_text": "I would just like to commend Hira. My wife and I have been coming to this place for years and the food is always great but today I want to commend the service.   Lunch was the busiest weve ever seen it. There were alot of patrons who needed to be seated and alot of food orders that needed to be brought out. Hira took charge like a pro and turned what could have become a very bad situation into one of our best experiences weve had dining here.  My wife and I truly admire how quickly she got the large crowd of people seated effortlessly and got the food orders out.  She was pleasant, classy and professional and her leadership is spot on.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-17 02:06:55.077629",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108204460424369111158/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1czQ2S0F3EAE",
            "reviewer_name": "Rawe Some",
            "rating": 5,
            "review_text": "The food is so, so amazing!  Tonight we got the tasting menu for pickup with spinach paneer, chicken masala and lamb curry: total taste explosion!  All the staff are very pleasant and fun to talk with but I specifically congratulate the cooks who should be very proud of the amazing food! Keep up the great work!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:06:55.079290",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117472904952556629388/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dGFhYzZnRRAB",
            "reviewer_name": "Ben Cheung",
            "rating": 5,
            "review_text": "Ordered chai feast for dinner to go. Originally thought it was portioned for one person, but ended up with 6 containers full of food which was definitely enough for 2. My favorite was the mystic soup (missing from the photo = too good to take home and drink it cold) and mango butternut squash. Not a big fan of spicy food, but the spice level is tolerable. The roti were awesome, they smell and taste great. Overall the feast is worth it, even at dinner pricing.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:55.635655",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 19,
            "reviewer_url": "https://www.google.com/maps/contrib/102644451949516450573/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOXJtVDRBRRAB",
            "reviewer_name": "Prab Sarah",
            "rating": 5,
            "review_text": "My whole experience here was super. I would highly recommend chai feast the samples of everything makes a whole plate and you can order as much as you want for $39 before tax the live music is no calming and chai tea masala is a must try on menu I didn t try anything from drinks but they have great options I would give it a try next time.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:55.637390",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 55,
            "total_number_of_photos_by_reviewer": 440,
            "reviewer_url": "https://www.google.com/maps/contrib/114133464009027494186/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobXBpZlpBEAE",
            "reviewer_name": "Hello OSO",
            "rating": 5,
            "review_text": "From the moment you walk in the door, you are immediately greeted with a small sample cup of hot chai or apple, lemon, ginger tea - both a bit spicy and the tastes are incredible. The ambience is welcoming - dim lighting, live music, attentive staff and decor to transport you to another country in, perhaps, another time. My husband and I both had the Feast option which allows you to try everything and anything you want and as many times as you want! Out of the twenty plus options we had, all of them were perfectly prepared and the tastes were delicate, layered and so satisfying. Hira, one of the owners, invited us when she found out it was our five year anniversary, while having her hair done at OSO Hair Salon, which I manage downtown. Once seated, she told us about the Feast concept and even switched some of our choices as she knew the items were better suited for that round of trial dishes served on a large, personalized, round tray. We felt special, as I m sure everyone did. So much so, that I treated the couple next to us, and secretly paid their bill on the way out. I really could go on for the length of a novella and once you ve been there, I m sure you will be writing your own accolades. Truly 6 out of 5 stars!",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:06:55.638874",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/105812277813429512368/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaEpXZW1BRRAB",
            "reviewer_name": "jessetalbot",
            "rating": 5,
            "review_text": "Amazing! Amazing food, the multi course dinner suggested by who I believe was the manager was a great choice, I got to sample a variety of foods that were all consistently delicious, even the mango chicken was amazing and I dont like mango the music and dancers they had as entertainment were fantastic, truly something Im glad I didnt miss! Despite being a busy time the wait staff were diligently trying to keep everything ordered and everyone happy, I waited about half an hour to get in and I am very fortunate to not have given up because it made my night! If I wasnt from out of town id go again and bring my family because that was just a highlight of my trip!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:55.640585",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/102762030373488348825/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab1pLWGZREAE",
            "reviewer_name": "Crawford Family",
            "rating": 5,
            "review_text": "Such a cool experience. We ve been twice and the food and atmosphere is perfect for a date night. I love the tasting menu! Multiple servings and I get to try everything more than once! Chai tea was also excellent. Live music was a special touch too. The se one time we went we brought kids meh probably should have left them at home",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:55.642182",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 16,
            "reviewer_url": "https://www.google.com/maps/contrib/117030679335046802177/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoN2Nuekp3EAE",
            "reviewer_name": "Sydney W",
            "rating": 5,
            "review_text": "We had a fantastic meal here! On top of the great food, there was great entertainment (dancers and music). We ordered two Chai Feasts, which was reasonably priced for the amount of food (all you can eat). This was especially good for us as we have different preferences so we could each try everything that what we want! Make sure to have reservations because it was busy!",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:06:55.644114",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 53,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/106001000464129579918/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeWFubHB3RRAB",
            "reviewer_name": "Peter Cross",
            "rating": 5,
            "review_text": "East is East. A little out of the way for us but I have wanted to come for a long time now.  Finally tonight was the night.  There were musicians playing, making for a delightful evening.  The service was a warm and authentic.  The vibe of the place is amazing and the food was completely off the charts. When we were seated we were offered tea as a welcome and that set the tone.  The staff were attentive and helpful in figuring out the offerings.  The chairs are meant for small bottoms so get a booth if you can. Well if you need to.  I have to say.  This is a must visit restaurant for Vancouver.  With outstanding vegetarian and non vegetarian dishes.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:55.645607",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 346,
            "total_number_of_photos_by_reviewer": 903,
            "reviewer_url": "https://www.google.com/maps/contrib/117370944994338381267/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNzZEMjlBRRAB",
            "reviewer_name": "Sachin Chauhan",
            "rating": 5,
            "review_text": "To begin with this is a must visit place if you are in Vancouver. East is East is a indo - Afghani resturant which unique atmosphere, amazing interior design (beautiful) , live music (one of the best thing) and mouth watering food. You have three options to order from 1. Silk Route Feast (The thali) : in this plate you get a soup , a salad , a cold meeze, 3 mains (V / NV / D) to choose from a variety of options which is served with rice and naans. 2. Eastern Roti rolls which again comes with veg and non veg option and 3. Boulani. The thali is Bang on money its unlimited and simple delicious. Now the bonus : Live music was cherry on top if you really like to hear music while amazing delicious food this is your place. IMPORTANT: reserve a table in advance as this place jam packed and if you are walkin on a busy day you might have to wait 30+ min. In all this a place you dont wanna miss if you are in town.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:06:55.647169",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 127,
            "total_number_of_photos_by_reviewer": 1118,
            "reviewer_url": "https://www.google.com/maps/contrib/118210459411514144759/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbU9xWWx3RRAB",
            "reviewer_name": "Tario Sultan",
            "rating": 5,
            "review_text": "First time trying East is East today. I have to say what a great restaurant! The food is delicious and quality; the staff is super friendly and patient. Strongly recommend their  Chai Feast  (like a buffet) where you can keep adding food on top. Plus the chai tea tastes amazing! Keep up the great food East is East, will definitely come back soon! 5 star for sure! Strongly recommended!!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:06:55.649098",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 206,
            "total_number_of_photos_by_reviewer": 2064,
            "reviewer_url": "https://www.google.com/maps/contrib/103851071967715799187/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzdFBQNVlBEAE",
            "reviewer_name": "Dark Impact",
            "rating": 5,
            "review_text": "The restaurant was cool. The chai was delicious and great. I am not sure about all these 4 stars because to be honest the service was good, the food was excellent and appetizing, and the vibe was great. It is a beautiful place to hang with someone special or a great friend. The music was not loud and you can easily carry a conversation. The vegan options were numerous and the servers were knowledgeable. The space was quaint and warm. The finishing were warm and inviting. The food was definitely eastern with a hint of fusion. Although not completely unrecognizable. The price was on the high side but within the acceptable range for what the place is.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:06:55.650756",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 102,
            "total_number_of_photos_by_reviewer": 508,
            "reviewer_url": "https://www.google.com/maps/contrib/116718341628665515230/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaak5QLXVBRRAB",
            "reviewer_name": "Shauna Gavin",
            "rating": 5,
            "review_text": "Had an absolutely stunning meal here. The food was amazing, I would recommend the chai feast as you can basically try the whole menu and you definitely won t leave hungry. Great vegan/veggie and gluten free options. Our server Jyoti was fab too!!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:56.245567",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108245994262439528600/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXb19EOW1RRRAB",
            "reviewer_name": "toffy concepcion",
            "rating": 5,
            "review_text": "This is a really great restaurant with food from India and its neighbors. They also have live music in evenings for a small fee to the entertainers.  The place has a really great vibe and the servers and the customers are a really great crowd. You can make friends instantly.  The highlight is the Chai feast where you get a salad, soup, rice, naan, chapati and a few flowing steam of taster plates of the main course. The food quality is at Vijs level but you get your whole meal for just the price of an entree. The salmon in green curry and chicken in mango curry was excellent. But even the vegetarian dishes were so good that they could make a carnivores mouth water. Eggplant and mushrooms in cashew cream and Afghan eggplant were excellent. The chai teas were excellent. It was so good and reasonable, its the first time I put a 40% tip.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:56.251037",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 412,
            "total_number_of_photos_by_reviewer": 2433,
            "reviewer_url": "https://www.google.com/maps/contrib/114933547240385128551/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbHRpRUVBEAE",
            "reviewer_name": "Mia Tarzwell",
            "rating": 5,
            "review_text": "Great food and an exciting menu. Good mix of vegetarian options. Music was uplifting and the decor was simply beautiful. Hope to go back soon!",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:06:56.253732",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 81,
            "total_number_of_photos_by_reviewer": 325,
            "reviewer_url": "https://www.google.com/maps/contrib/108073644951849138547/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX0tuVENREAE",
            "reviewer_name": "Omar Bahadshah",
            "rating": 5,
            "review_text": "5/5. When you walk in it s an immediate vibe set of a middle eastern atmosphere. Not just the decor but the music and the actual materials the place is made of.  Service is 5/5 it was my wife s birthday they came and sang happy birthday and I didn t even ask them to it was very sweet. The food is amazing and if you get the unlimited feast they bring you any items from the feast menu the salad is fresh and finely cut vegetables.  I m Afghani and the Afghan dishes I had were excellent. Have to go here",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:56.258272",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107097250124570919259/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcklfN3JBRRAB",
            "reviewer_name": "an chu",
            "rating": 5,
            "review_text": "Went here with a friend for dinner, didnt have a reservation and was able to find a seat no problem. Since I heard there was a buffet option, that was what I wanted. They offered two variations: non-vegetarian for $35 and vegetarian for $30. I got the non-vegetarian and my friend ordered the vegetarian option. You pick a soup, a salad and 2 mains. Once youre done with the food you can keep ordering more, so definitely try out the rest of the menu. My favorite was the salmon curry. The platter also came with a rice and bread which I thought were really good as well. Enjoyed the atmosphere since I was welcomed with a small cup of tea. Live music was also playing at the time I  was there. After about 3 rounds of food, I was stuffed. Really enjoyed the food and the atmosphere, will definitely come back again and try the dishes rather than another buffet.",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 02:06:56.263343",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 78,
            "total_number_of_photos_by_reviewer": 495,
            "reviewer_url": "https://www.google.com/maps/contrib/112508255490239836145/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodTZUaXB3RRAB",
            "reviewer_name": "R W",
            "rating": 5,
            "review_text": "An experience that takes you away. This restaurant features an authentic atmosphere with sights, sounds and tastes from every angle.  Youll feel like you left the country on an exotic adventure.",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:06:56.265932",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/113172250878035215732/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa3V2TnFBRRAB",
            "reviewer_name": "Javier Lavalle",
            "rating": 5,
            "review_text": "Beautiful place, even more amazing food. Its totally worth it! You should definitely come when the flamenco show is happening. I o ly wish that their drinks were as good as there food, but other than that, no complaints.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:06:56.268288",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117646898172180961943/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd3FyNXhnRRAB",
            "reviewer_name": "Lyalmah Shaiyan",
            "rating": 5,
            "review_text": "It was the most tastiest food Ive had in a while!!!! Their food is so deliciouse youll end up dreaming about it ! The ambiance of the restaurant will freshen you up! Very helpful servers! They explain the menu very well and provide great service! They also have live music, which just adds to the experience! Great place for dates, family, or work dinners.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:56.270399",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/112927795731667969695/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaFBXUllBEAE",
            "reviewer_name": "maryam farokhmehr",
            "rating": 5,
            "review_text": "A lot of options and delitios desserts. I loved my experience of tasting new things here",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:06:56.272523",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 283,
            "total_number_of_photos_by_reviewer": 490,
            "reviewer_url": "https://www.google.com/maps/contrib/118132713189529100603/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyb3BENFRREAE",
            "reviewer_name": "Jay D",
            "rating": 5,
            "review_text": "Had a great mothers day lunch. Highly recommend getting the chai tasting menu  which allows you to try many different mains for a set $30 price. The lamb curry, butternut mango, eggplant and mushroom were our clear favorites. The daal, Boulani, Persian rice and roti accompanied the meal. We found the soy chai sample had way too much ginger in it  for my liking but some may find it enjoyable. Excellent ambiance, decor and friendly service. Highly recommend! Will definitely be back.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:56.274719",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 70,
            "reviewer_url": "https://www.google.com/maps/contrib/105625487107088711822/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdVBuQ3ZnRRAB",
            "reviewer_name": "Andrew Sanders",
            "rating": 5,
            "review_text": "Ive been to East is East a few times and always a delight. The live music creates such an interesting lively atmosphere. The Chia Feast is a great option for someone like myself who can find themselves hungry after some restaurant meals. Ive been with vegetarian guests a number of times and they have always been delighted with the selection of veggie options.",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:06:56.813411",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 101,
            "total_number_of_photos_by_reviewer": 45,
            "reviewer_url": "https://www.google.com/maps/contrib/110718012814085399227/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbnZPdHlnRRAB",
            "reviewer_name": "Erich Enns",
            "rating": 5,
            "review_text": "Absolutely amazing venue that takes you on a journey to another part of the world with authentic Silk Road cuisine and beautiful decor. If you have not experienced this type of cuisine before, do it here. They serve everyone who is vegan, meat lover, and those who have food sensitivities. Price is extremely comfortable and food is in abundance. I loved the mango butternut squash and mango chicken and the curry lamb and the Afghan rice and the Persian salad and the",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:06:56.815329",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/110751213485071353558/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbWV5ZEdBEAE",
            "reviewer_name": "H W",
            "rating": 5,
            "review_text": "Great service and a lovely establishment. It ll feel like you entered another world the minute you walk in. The place is very clean and has a variety of seating options. The decor and music makes the environment very warm, vibrant, and unique. The food is delicious - would recommend the roti roll meals. Was very pleasantly surprised at how tasty the vegetarian options were, and the meat ones are fantastic as well. They also have a great selection of drinks. Perfect date spot if you re looking for something romantic that won t break the bank!",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 02:06:56.816855",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 99,
            "total_number_of_photos_by_reviewer": 621,
            "reviewer_url": "https://www.google.com/maps/contrib/103182469879563742031/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d3RtLW1nRRAB",
            "reviewer_name": "Frank Warburton Bailey III",
            "rating": 5,
            "review_text": "I brought an Iranian friend here one evening, and she loved it. They had wonderful live music, and the food was phenomenal. $39 and you get unlimited portions. Come hungry!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:56.818523",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 29,
            "total_number_of_photos_by_reviewer": 12,
            "reviewer_url": "https://www.google.com/maps/contrib/112801954198741202150/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOE42OWpRRRAB",
            "reviewer_name": "JESSICA",
            "rating": 5,
            "review_text": "Lovely ambiance and piping hot chai. We elect to dine during the musical performances over the flamenco, but it s a lovely atmosphere any time - from the Himalayan salt walls and candles to the rugs and ceiling decor, it s a beautiful space. The tasting feast is your best bet for trying a little bit of everything off the menu. Portions seem small but are perfect tasting size (unlimited eats so bring an empty stomach!) Service is a little lackadaisical, but this place still deserves 5 stars.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:56.820251",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 208,
            "total_number_of_photos_by_reviewer": 404,
            "reviewer_url": "https://www.google.com/maps/contrib/107634675788822926704/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZLTZMZFZ3EAE",
            "reviewer_name": "William Lau",
            "rating": 5,
            "review_text": "I was really not wanting to come here all these years as the cuisine style was not what I wanted. But joining a group lunch here changed my view of this place. Food was great. Taste of the chai that they offered samples of was really strong , which is my cup of tea, and the roti meal was really tasty. The $15  single roti meal is a little pricey for the size of roti (but then Im a big eater), the double is better value as that is just for additional $3. The additional roti does not have to be the same as the first so I tried the 2 lamb rotis on the menu and both were really tasty. The bowls that the others had looked really appetizing too! Service was good, coming just enough times to be of service but not too many times to be overbearing. Seating is mostly half booths but there are tables with just chairs. Take note that these tables may be lower than the half booths. I saw chairs of 3 different heights and the short ones may be too short for taller people. Parking is mixed free/metered street parking and free residential side street parking. Overall a good experience and may come again. 2022-March update:  repeat visit for a farewell lunch. This time had the Chai Feast tasting menu which is all-you-can-eat for $20 (promo price for lunch which also is less the cold mezze). $20 for all you can eat lunch is very reasonable these days. I AYCE deals at other restaurants being more than $27 pre-pandemic, so this is a bargain. Plus I found menu photos from2019 already being $35 (dinner version) so I was dreading this may be more now. I suppose where they make up for the the deal is that most of their dishes are liquids, sauces and starches. Actual proteins are in small amounts. Everything else about service and parking still hold true. Really happy about this promo and dining experience. Will recommend this to others.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:56.822002",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 342,
            "total_number_of_photos_by_reviewer": 2599,
            "reviewer_url": "https://www.google.com/maps/contrib/118320232733073193837/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNnI2NnV3RRAB",
            "reviewer_name": "prerna saha",
            "rating": 5,
            "review_text": "Absolutely a must visit for anyone who enjoys eastern flavours.. their unlimited menu option (or as we Indians like to call it - unlimited thali) is perfect and allows you to try the various delicious things on offer.. the mango prawns were my favourite. And do leave space for dessert! A 10/10 for service, ambience and the live music too!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:56.823873",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 74,
            "total_number_of_photos_by_reviewer": 374,
            "reviewer_url": "https://www.google.com/maps/contrib/115870333488946845364/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwa09MTFFREAE",
            "reviewer_name": "Denise Belisle",
            "rating": 5,
            "review_text": "I always enjoy coming back to East is East. The Chai Feast is always a winner. Also, the selection of Chai teas is amazing. I highly recommend it to anyone who loves Indian food or would like to explore this type of cuisine. I was there for lunch with a group of friends. We all enjoyed our meals. Vegetarian options: Great choices for vegetarians. Its so important for me when I go out.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:56.825437",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 94,
            "total_number_of_photos_by_reviewer": 106,
            "reviewer_url": "https://www.google.com/maps/contrib/113747176739578999643/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN2F2NmtBRRAB",
            "reviewer_name": "Derek Situ",
            "rating": 5,
            "review_text": "The silk route feast is great value and the live entertainment made for a fun atmosphere.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:56.827386",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 29,
            "reviewer_url": "https://www.google.com/maps/contrib/110298807851819434210/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodTR1VFpnEAE",
            "reviewer_name": "Ryan",
            "rating": 5,
            "review_text": "The sampler experience is the way to go at East is East. You get to try a little of everything and the staff are super friendly and attentive at making sure your plate isn t empty as long as you still have space in your stomach! Recommend the mango shrimp and mystic soup!",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:06:56.829571",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 371,
            "total_number_of_photos_by_reviewer": 493,
            "reviewer_url": "https://www.google.com/maps/contrib/110149871067864959533/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMGF1b3RRRRAB",
            "reviewer_name": "jimin",
            "rating": 5,
            "review_text": "soo yummy! very authentic middle eastern food. their chai is just like the real thing and definitely recommended. their atmosphere and the decors really match the vibe of the restaurant and feels so cozy. the staffs are friendly and checks by often. i would say their Chai feast is very worth it for 40$! got to try many delicious + extremely flavourful dishes.",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:06:57.413595",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 22,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/105768298446221904878/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcllMNGVBEAE",
            "reviewer_name": "Donya Arani",
            "rating": 5,
            "review_text": "What an absolute GEM!! Very fair prices. Delicious food from exactly as the name suggests, from Afghan to persian to Indian food. You get it all. Love their Chai feast tasting menu. I got to try almost everything on the menu + unlimited soup and salad for $35!!! The live music really made this a great dining experience and have friendly staff. Will Definetly return.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:06:57.415233",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 117,
            "total_number_of_photos_by_reviewer": 45,
            "reviewer_url": "https://www.google.com/maps/contrib/106826856990440626345/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaWZMZnZ3RRAB",
            "reviewer_name": "Brothers Contracting",
            "rating": 5,
            "review_text": "What a beautiful place... We ended up here waiting for a different reservation (busy friday night)which we canceled after the 1st bite. The stuff was professional and attentive. We got some tea just waiting for our table to get ready. There was a live music performance, great and tasty food and an amazing atmosphere!! Thank you for having us, well be back",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:57.416756",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/105592888176182131594/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdGFUeXBnRRAB",
            "reviewer_name": "Lenka Vaskova",
            "rating": 5,
            "review_text": "The small courses were excellent, many vegetarian as well as meat and fish options. They offered us a welcome chai drink while waiting for our table - great service! We enjoyed the live music a lot too. Awesome spot!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:57.418239",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 181,
            "total_number_of_photos_by_reviewer": 308,
            "reviewer_url": "https://www.google.com/maps/contrib/107998810360939363253/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cjlyMklREAE",
            "reviewer_name": "Kaveesh Kukreja",
            "rating": 5,
            "review_text": "Great ambience, brilliant service. Great people, good music. Honestly I have no complaints. Food was nice as an Indian I loved the simplicity and healthiness that they offer compared to your regular indian Afghani places that are loaded with cream and oil. These guys do it right. You might not get some flavoirs u were expecting but thats because its fresh and clean so truly enjoyed it. Try the chai feast and get the Mango Prawns, jookeh kabab.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:57.419827",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 136,
            "total_number_of_photos_by_reviewer": 99,
            "reviewer_url": "https://www.google.com/maps/contrib/105684207799968732557/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvXy03WExnEAE",
            "reviewer_name": "La Vitta E Bella",
            "rating": 5,
            "review_text": "Fantastic place, yummy food and excellent service! Yummy food, delicious. Awesome service and relaxing live music. The atmosphere is so nice, all my friends and family like it very much. Whoever we took here over the years for dinner enjoyed it very much. Prices are ok as well. Have a few options, for menu order and another one similar to all you can it. The server will explain nicely. Planning to go again soon. Its a favorite place to visit when in town.  East is East!",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:06:57.421426",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 238,
            "total_number_of_photos_by_reviewer": 1477,
            "reviewer_url": "https://www.google.com/maps/contrib/110758902285940027333/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdEw2ZWh3RRAB",
            "reviewer_name": "Chloe Rachel",
            "rating": 5,
            "review_text": "Had such a great time here, attentive service too! However, they should update their menu on their website, as their Rice Bowls dont specify theyre only available at lunch. So instead of a rice bowl, we had to order a dish and then pay additional for a side of rice/roti. That being said, the wild salmon and green Thai coconut milk curry was delicious, it came with a lot of protein. Mixed with the rice, it was so good! Had the Vegan Khir for dessert, which was just heavenly all mixed together. At the start, we got a sample of their apple lemon ginger decaf chai, which I loved but didnt order due to wanting something cool with my dish. Would definitely consider in the future, though, great flavours! There was a live band playing so it got loud, especially on the floor tables, but added to the experience (theres an automatic $3 fee that gets added to each patron, but theyre very clear about that and let you know if you reserve ahead of time). Overall, had a good first experience here! Its a bit on the pricier side if you buy desserts and pay extra for rice/roti, but the good music and food cant be beat.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:06:57.423333",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 371,
            "total_number_of_photos_by_reviewer": 1266,
            "reviewer_url": "https://www.google.com/maps/contrib/112797509866700892010/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bjVxYWlBRRAB",
            "reviewer_name": "Michelle Owen",
            "rating": 5,
            "review_text": "One of my favorite restaurants. Their Tasting menu offers all you can eat sampling dishes. Choose one of three salads, one of two soups, one of two appetizers, and 3 of the many main dishes. Then choose again. And again. Until you feel like you may burst   And their Chai teas are all incredible! Most of the menu is dairy free and vegan. Lots of choices for everyone! Vegetarian options: More than half of menu is vegan. Their new Vegan Butter Chicken with dehydrated Tofu slices fool even the carnivores. Delish! Dietary restrictions: Lots of dairy free and gluten free options",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:06:57.424895",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 196,
            "total_number_of_photos_by_reviewer": 116,
            "reviewer_url": "https://www.google.com/maps/contrib/101494618839333398091/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcGJyN2VREAE",
            "reviewer_name": "Mina A",
            "rating": 5,
            "review_text": "Simply delicious. I have been to their Broadway location many times over the years when I lived closer to that area but had never been to this location. While youre waiting to be seated, they greet you with a hot soy (?) chai and then take you to your table. The decor is really nice and takes you on a journey east. The staff are friendly and knowledgeable. You can order foods individually or you can choose from the Silk Route Feast menu, which basically is an all-you-can-eat type of menu. It comes with basmati rice that has pieces of carrots and raisins in it, along with Boulani (an Afghan bread stuffed with potatoes and other herbs if I remember correctly), an Indian roti, and a soup called Dahl (I think it has lentils and chickpeas in it) and a spinach salad. Then you get to choose two entrees (stews) to start and you can keep asking for more entrees until youre stuffed! You just cant take anything to go if you order off of this menu and it is $23 per person. They have lots and lots of vegan / vegetarian options and I would highly recommend this place!",
            "published_at": "5 years ago",
            "published_at_date": "2018-12-01 02:06:57.426684",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 142,
            "total_number_of_photos_by_reviewer": 940,
            "reviewer_url": "https://www.google.com/maps/contrib/114751164902466001465/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDOGN5TmRREAE",
            "reviewer_name": "Sophie Lussier",
            "rating": 5,
            "review_text": "Love the decor... The food was sooo tasty, spice were well balance so not overpowering.  Try the tasting menu as it will give you a complete experience.  Add a little sweet at the end, it was paradise in a bite.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:06:57.428181",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 266,
            "total_number_of_photos_by_reviewer": 557,
            "reviewer_url": "https://www.google.com/maps/contrib/106820648219985695383/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJcHN5djhBRRAB",
            "reviewer_name": "Glutard Plant-Based",
            "rating": 5,
            "review_text": "One of my all time favourite eateries in the world. Has the best chai tea you ll ever have, I like mine with almond milk, there s also soy, another plant milk option. I love coming here during the evening because there s live music performances. My favourite dishes to order are the Gypsy and Ghandi s Breakfast roti rolls. Their soups and boulanis are also so delicious. Try their Silk Road Feast, an all-you-can-eat menu, if you ve got a big appetite. It is amazing! Beautiful space, chill atmosphere. Lots of plant-based & gluten-free options.",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 02:06:57.979522",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 47,
            "total_number_of_photos_by_reviewer": 413,
            "reviewer_url": "https://www.google.com/maps/contrib/100571485991960887943/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsLXFlUUJ3EAE",
            "reviewer_name": "Kirsten Utheim",
            "rating": 5,
            "review_text": "My favorite dinner out. The feast, mystic soup, Persian salad etc. Loved the music there on Nov. 6th, cello and piano.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-17 02:06:57.981203",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/115196847781437139395/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNXBHV1R3EAE",
            "reviewer_name": "Richard Williams",
            "rating": 5,
            "review_text": "They do a great bottomless menu so go hungry. Lighter bites also available. Good service, good food.Loved the live music - pianist and a cellist performing",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:57.983150",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 95,
            "total_number_of_photos_by_reviewer": 24,
            "reviewer_url": "https://www.google.com/maps/contrib/116943155607693729125/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMGFEQkVREAE",
            "reviewer_name": "Elaine Siu",
            "rating": 5,
            "review_text": "I ve been to the Broadway location and came to this Main Street location to see how they compare.  The Broadway location is bigger but their stage is smaller; most importantly, same great food and atmosphere at both locations. We had their Chai Fest which is basically an all you can eat meal for $35 - great way to sample a lot of dishes. I love all the dishes except for the butternut squash - it was probably the sweetness of it that threw my tastebuds off. The chai drinks are a must try as well.",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 02:06:57.985058",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 200,
            "total_number_of_photos_by_reviewer": 520,
            "reviewer_url": "https://www.google.com/maps/contrib/114461302612918278542/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDOTZ5VXVRRRAB",
            "reviewer_name": "Elle C",
            "rating": 5,
            "review_text": "Amazing experience! They went above and beyond for my family by welcoming us in and keeping their kitchen open an extra 15 minutes. It was just what we needed after a busy day! The ambience was calming with the setting of candles on wooden tables, beautiful rugs, dimly lit lights, and benches with pillows; it felt like we were in the Middle East. The food was the perfect size and full of flavour. And the Chai Tea was delightful! They have live music on Thursdays and Sundays! Thank you for providing us such a great experience!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 02:06:57.986545",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/103610130569529518031/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtczlibXV3RRAB",
            "reviewer_name": "Martin Ruest",
            "rating": 5,
            "review_text": "Great ambiance and decor. All wood and pink salt rock wall. Beautiful everywhere you look. Music was relaxing and soft on the ear. Food was amazing, great levels of flavor and color. Everything was delicious. The staff was very nice and helpful. Look out for performance night and shows.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:57.987985",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 124,
            "total_number_of_photos_by_reviewer": 578,
            "reviewer_url": "https://www.google.com/maps/contrib/116462199142404660163/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNXJiUlFBEAE",
            "reviewer_name": "Paula Uyenaka",
            "rating": 5,
            "review_text": "Ordered take out but would have loved to dine in (nice atmosphere and there was live music). Had double roti rolls - Bombay Masala, Yogis Treat, and The Gypsy. Came with dahl or soup and green salad. Absolutely delicious! Vegetarian options: There are lots of vegan options and even more vegetarian options as well as GF. And the food is delicious!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:06:57.989664",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 111,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115647367647130739782/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlLTdfY1JnEAE",
            "reviewer_name": "Shane Omar",
            "rating": 5,
            "review_text": "The Himalayan lamps ambience, delicious chai teas & food is what keeps me going back when I am celebrating a school term end dinner. Its not cheap. Expect to pay ~$50 + to be satisfied.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:57.991490",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/117790389945186215725/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCa2VQMWlBRRAB",
            "reviewer_name": "Taina Townsend",
            "rating": 5,
            "review_text": "Some friends asked me about my experience at East is East... for the first time, I didnt know anything bad to say about a restaurant! I loved the food, the service, the music, the structure... its a little bit expensive but worth it! I highly recommend!",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:06:57.993469",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 31,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/114357586580902480199/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMzV1RVNBEAE",
            "reviewer_name": "Maria Sumoy",
            "rating": 5,
            "review_text": "Beautiful setting    Service was excellent   We had a great time and the food was delicious!   All of them samples in tiny cute dishes    Such a great way to try them all!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-17 02:06:57.995623",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111268337941047298834/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwb19pbUh3EAE",
            "reviewer_name": "Giselle B",
            "rating": 5,
            "review_text": "Amazing service and food. It s a pity I didn t get our waitresses name but she went above and beyond to make our experience a great one, even giving us drinks on the house as first timers! Definitely will be back!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:06:58.586975",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116889962985439452176/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM002dFdBEAE",
            "reviewer_name": "January Steveston",
            "rating": 5,
            "review_text": "Beautiful interior, very unique space with live shows while you eat. Belly dancing shows are fun! The food is very tasty and fun spices. Great prices and service!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:58.589073",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102065082455052569918/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaS1qTjBBRRAB",
            "reviewer_name": "littlewoo -Gmail",
            "rating": 5,
            "review_text": "This is one of my favorite restaurants in Vancouver!! The beautiful decor, ambience and live music (at night) plus the warm service and delicious fusion cuisine (foods of the Silk Road as I once heard someone describe it) make dining at East is East a wonderful experience. (Their spicy masala chai is my FAVORITE chai of all time!)  I really love introducing friends to this place and its also a great place to celebrate an anniversary or a loved ones birthday!!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:06:58.590930",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/112116196674030592006/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbV8yOGRBEAE",
            "reviewer_name": "Arvin S. Brar",
            "rating": 5,
            "review_text": "East is East is a fabulous place where you can not only find great delicious food but alwaz with excellent service by the ground staff along with u expect life band with that kind of traditional soft music. We were walking across Main Street looking for some random unusual food... It appears that after walking for 8 minutes to 9 blocks nothing amazed up until we past by this particular restaurant which seems to be a tea place... But fully packed as well... Btw the tea special tea [I believe was something called masala chai] they provide once you get the table was sooo mind blowing as well... Should have ordered extra too... Too good n I will be back soon for sure... Keep up the gr8 work guys... Cheers",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:06:58.592636",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 33,
            "total_number_of_photos_by_reviewer": 61,
            "reviewer_url": "https://www.google.com/maps/contrib/107631331168872221032/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bmVxeWh3RRAB",
            "reviewer_name": "Edward Eng",
            "rating": 5,
            "review_text": "I remember delivering for this restaurant and saw the beautiful rustic ambience and waitstaff and food with their potent and exquisite aromas.  I finally came back as a customer and they did not disappoint.  I particularly enjoyed the soup.  Thanks for the experience!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:06:58.594140",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 75,
            "reviewer_url": "https://www.google.com/maps/contrib/105449931356263626983/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MEthazd3RRAB",
            "reviewer_name": "Christine Taylor",
            "rating": 5,
            "review_text": "Got the big dinner $43 which is basically an all you can eat. Really enjoyed the lamb curry, and chicken masala. Good chai bar too.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:06:58.595743",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 151,
            "total_number_of_photos_by_reviewer": 107,
            "reviewer_url": "https://www.google.com/maps/contrib/102086593035791092595/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd0tPdHBnRRAB",
            "reviewer_name": "Diane Jesmer",
            "rating": 5,
            "review_text": "Treated to dinner at this lovely atmospheric place. Live music and flavorful food!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:06:58.597879",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 130,
            "total_number_of_photos_by_reviewer": 385,
            "reviewer_url": "https://www.google.com/maps/contrib/107063571315757047592/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eHJMaHRBRRAB",
            "reviewer_name": "Linda Trinh",
            "rating": 5,
            "review_text": "I really enjoy coming here. The atmosphere is great and food is fantastic. My friend loves their mango prawns and I usually get the Afghan Nomad in a bowl form and not the wrap form. Their chai is real chai with a kick which I love!",
            "published_at": "6 years ago",
            "published_at_date": "2017-12-01 02:06:58.599924",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 69,
            "total_number_of_photos_by_reviewer": 187,
            "reviewer_url": "https://www.google.com/maps/contrib/100832187674728306272/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaUxHbThnRRAB",
            "reviewer_name": "S N",
            "rating": 5,
            "review_text": "I had come to get takeout and decided to eat in. The staff was so accommodating which I appreciated. The food was delicious and chai just perfect in every way. Food",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:06:58.601502",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103378741340972864031/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNWVUS1Z3EAE",
            "reviewer_name": "Carson Hegedus",
            "rating": 5,
            "review_text": "Absolutely lovely place. Took my girlfriend on a date here and we had a great experience. Walking in the door there was about a 15 min wait without a reservation. The staff gave us some Chai Tea samplers while we waited which were very delicious. They had an all you can eat special going on which was great as we were able to try a little bit of everything. The food was spectacular. Tasted great and came out in a timely manner. Our waitress was super friendly and patient. What I liked the most is that they sat us next to the stage and the musicians were not over powering. We could sit next to the stage and still have a conversation. The only con is I will say the chairs are pretty uncomfortable and I find it hard to sit in them for an hour. All in all I would definitely recommend this place.",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:06:58.603492",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/108449849548466091739/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}