{
    "place_id": "ChIJ88cQVSh1hlQREQomlVgfgjs",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsd3NyYjlnRRAB",
            "reviewer_name": "Dan Kim",
            "rating": 5,
            "review_text": "If you are looking for a CHANGE or NEED someone to give you motivation to work out, BLK Box gym is where you should head to right now. Friendly staff, clean and well organized gym with lots of equipments I have been trained by many personal trainers in my life but after meeting Ken, my new personal trainer, I have realized not all the trainers are the same. He really puts in effort and care towards his clients, very well organized, uses his experience and knowledge to help his clients reach their goals. Any trainers can push you to work out and do cardios, but Ken actually makes perfect work out/diet plans for each individual Highly recommended 10/10",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:23:09.033031",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114174480014739222234/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdDRhUnB3RRAB",
            "reviewer_name": "fatima alafifi",
            "rating": 5,
            "review_text": "I joined BLK box gym because I wanted to lose some weight for my graduation ceremony. My experience has been nothing but great. Everyone at the gym was kind and helpful especially my lovely trainer, Rachel. Rachel was tough at times, I used to call her evil, and very caring and attentive on the days I was feeling down. I enjoyed training with Rachel, I enjoyed the music she used to play for my sessions and I was very happy with the transformation I saw on my body after only 2 months of training. Also, I appreciate how Rachel was very understanding of my busy schedule and how she used to push me to keep coming to the sessions regularly. I am very happy with the results I achieved in the 6 months of training with Rachel and I would ve continued working with her if I didn t have to move out of town. All the best Rachel :)",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:23:09.037187",
            "response_from_owner_text": "Hi Fatima, Thank you for your kind review! Were really happy to hear how Rachel made an impact in your fitness lifestyle :)",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:23:09.037187",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115990581260021354156/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bGFTRGZBEAE",
            "reviewer_name": "Pb C",
            "rating": 5,
            "review_text": "Ive been training with David for a few months and he changed my body in just 1 month. I was stunned to see how far I had come in such little time. I have known David for several years and his energy is infectious. I dealt with bloating, hypothyroidism and iron deficiency while doing shift work which all lead to a decline in my health. I went from almost 130lbs of skinny fat to 114lbs of muscle. He has helped me obtain the physique Ive always wanted and the strength I never knew that I had. He s incredibly attentive, knowledgeable, and an overall genuine trainer and boxing coach.  His positive attitude and approachable nature makes me feel completely at ease. I cannot recommend David enough as he truly knows what he is doing and you will see how he genuinely cares about your goals. He radiates passion and dedication for his clients and I absolutely love training with him. He will make you succeed with your fitness goals. If youre seeking a trainer who will produce results and make you enjoy it at the same time - you have found the right place. My only regret is not starting with him sooner. I am so incredibly happy - Thank you David and the amazing Blk Box Team",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:23:09.040653",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112869281883805736595/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NktqVklREAE",
            "reviewer_name": "Crystal Ham",
            "rating": 5,
            "review_text": "I ve been working with Dave Rojo for personal training sessions since March and can t say enough positive things about the experience. He s always motivating and brings a super fun energy to each session (along with a furry friend, Obie, who is a ray of sunshine). I feel stronger than ever and it s great to be able to just show up and have an entire workout planned for you, along with the encouragement to push yourself.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:23:09.043743",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100542294916456353483/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dFlTSG1nRRAB",
            "reviewer_name": "Sofia Chupakhina",
            "rating": 5,
            "review_text": "I ve been training at BLK BOX for 5 months now. Initially I came because I was experiencing back pain and in general was not happy with my body and mindset (COVID greatly affected me). I was reeeally nervous because I had never trained in the gym before and avoided physical exertion in every possible way It s been five months - I ve never felt like skipping a workout. My PT Preston is incredibly professional, knowledgeable and supportive. Going to train with him and seeing the rest of the team is always the highlight of my day. I feel so much better both physically and mentally. Can t recommend this place enough!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:09.046493",
            "response_from_owner_text": "Ecstatic to hear you enjoy training with Preston, Sofia! Really proud of your hard work and discipline in the last 5 months   keep killing it!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:09.046493",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/104893412551526935128/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNHVybGRnEAE",
            "reviewer_name": "Mavis Luo",
            "rating": 5,
            "review_text": "Just completed 36 personal training sessions with Ken, he is very kind, patient, and professional! I m happy that Ken helped me develop a healthier life style! Every staff is friendly! If you are looking for personalized training plan, BLK is definitely a great choice.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:09.049565",
            "response_from_owner_text": "Were happy you had a blast training with Ken, Mavis! Thank you for your kind words, were glad that youre satisfied with your time at BLK BOX GYM.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:09.049565",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/106206996842154811451/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bnRxOUNnEAE",
            "reviewer_name": "Allen C",
            "rating": 5,
            "review_text": "The slogan  weight lost  is exaggerated in most places but if you re looking for real results then you need to go to Blk Box. I trained for two years prior to Blk Box at commercial gyms and I noticed little chances to my body. The tailored program at Blk Box actually made a difference and I could see how my body changed every single week; not to mention what a pleasure it was to work with Ken. He s extremely knowledgeable you can ask him anything training related and he would be able to answer you. He even helped me recovered from an old injury that prevented me from doing many of the movements. Every single trainer at the gym is friendly and has his/her own personality that you can fell in love with. His rate is also very reasonable comparing to other personal trainers. I m excited to see how Blk Box continues to grow!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:23:09.052980",
            "response_from_owner_text": "Hey Allen! Thank you for leaving your kind review for us. Were really happy that you had a great time working with Ken.",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:23:09.052980",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110398198523393174520/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMzhiOTlRRRAB",
            "reviewer_name": "Kyo Zala",
            "rating": 5,
            "review_text": "Rachel is my personal trainer and is fantastic. Very easy to talk to, pushing me even when I want to give up and flexible with my crazy schedule. So happy with my results so far and will definitely be continuing with her in the future!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:23:09.055745",
            "response_from_owner_text": "Hi Kyo, Thank you for sharing your kind words! Were happy that Rachel helped you with the results that you wanted!",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:23:09.055745",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116784103929850771484/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdjVTSzFnRRAB",
            "reviewer_name": "Caleb Lam",
            "rating": 5,
            "review_text": "I originally reached out to BLKBOX in Richmond because I had fitness aspirations but didnt know where to begin. Harris (my trainer) was incredibly knowledgable and friendly, and we got to know each other quite well over the several months that I trained there. Harris helped me understand that lifting wasnt just about heavy weights, and he was great at explaining how mobility, rest and nutrition played such a significant part in it as well. Though my time at BLKBOX has wrapped, Im really fortunate to be able to call Harris a good friend of mine now. One of my favourite things about BLKBOX is how I got to know all the other trainers as well. Its a really tight-knit team that are all super fun to be around and they dont make you feel intimidated or self-conscious to be there. Its a great community and I definitely miss being around that team on a weekly basis, and I would definitely reach out again if I were to need personal training once again!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:23:09.058730",
            "response_from_owner_text": "Thank you Caleb! Your radiant energy has been a great addition to our family. We appreciate you!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:09.058730",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/110899664081601008573/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQycDRXQnpRRRAB",
            "reviewer_name": "Yinan Yin",
            "rating": 5,
            "review_text": "I have been training in BLK Box gym more than a year. My trainer Matt is the most professional trainer I have ever met. I started training with rare experience and he taught me a lot knowledge about weight lifting and nutrition. And at the most of time his motivation encourage me to work harder and helped me to reach the goal. The space is clean and every single trainer is friendly. I feel so welcomed every time when I go there. I highly recommend this gym if you are looking for a personal training program.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:09.061984",
            "response_from_owner_text": "Thank you, Yinan! Were happy to hear that youve enjoyed your experience with Matt.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:09.061984",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103792275602466283267/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSb3ViZDlnRRAB",
            "reviewer_name": "Edward Hsu",
            "rating": 5,
            "review_text": "BLK box gym provides great experience with the thorough sessions of personal training! Had Ken as my trainer and he was knowledgeable and nice to work with. Would definitely recommend BLK box gym for professional training sessions.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:23:09.692503",
            "response_from_owner_text": "Hello Edward! Were happy to hear that your training with Ken has been a great journey! Ken and the rest of the team appreciate you leaving a review for us :)",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:23:09.692503",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108169128855382970414/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeWRQUl93RRAB",
            "reviewer_name": "Jason Hsu",
            "rating": 5,
            "review_text": "Personal training with Ken at BLK Box Gym surpassed all of my previous training experiences at any other corporate gym. BLK Box s environment is clean and the facilities are top notch as well. It is definitely a gym that I would recommend to anyone looking to progress in fitness/lifting journey through their detailed personal training programs.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:23:09.696455",
            "response_from_owner_text": "Hi Jason! Thank you for leaving us a review! We really appreciate your kind words and happy to hear that Ken has provided you an excellent time at BLK BOX :)",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:23:09.696455",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110377859739263030698/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPN29fVVVnEAE",
            "reviewer_name": "Lily Ho",
            "rating": 5,
            "review_text": "I have had the pleasure of training with Jodie for the past several months; she has been an outstanding trainer. Jodie is highly knowledgeable and well-versed in human anatomy. She integrates her knowledge of anatomy and physiology into our sessions, making them educational and insightful. Jodie created various workout split programs for me and she kept me accountable and on track with my fitness goals. She is a kind, sweet and attentive trainer that tailors your workout to your needs while keeping up the intensity of the sessions. I strongly recommend BLK BOX gym for personal training in Richmond!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:09.699706",
            "response_from_owner_text": "Thank you so much, Lily! Youve been such a great addition to our family here at BLK BOX - come visit soon.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:09.699706",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/106610626305143536245/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMEx5NlZ3EAE",
            "reviewer_name": "Jake Autio",
            "rating": 5,
            "review_text": "After training at BLK Box for 5 months I have come away with so much love and respect for the culture of this gym. Matt and Ken have created a business that offers not only high calibre of coaching and training in many different fitness-related areas but a friendly atmosphere to train and learn. Shortly after I started all the trainers at the gym greeted me by name when I walked in to my sessions and I soon felt a connection to this community. My trainer, Matt, listened to my goals and created a program that set me up for success and I so enjoyed learning from him and his infectious passion and expertise for bodybuilding and nutrition. I look forward to working with him again in the future! Similarly, in hearing conversations between other clients and trainers it was clear that everyone had each others best interests in mind and were there to be kind and helpful. This is a fantastic premium fitness studio that truly has coaches and trainers for all levels and areas of fitness interest. I cant wait to go back and see the newly renovated facilities and continue to support this business!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:09.702920",
            "response_from_owner_text": "Thank you for your kind words, Jake! Its been such a thrill to have you around and apart of our family. Were looking forward to your return!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:09.702920",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117420888500904295567/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdEt2SWp3RRAB",
            "reviewer_name": "Ryan",
            "rating": 5,
            "review_text": "after 2 sessions of personal training with ken, i got great tips on my form and an extensive plan for my nutrition and split, everyone was very friendly as well.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:23:09.706652",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 36,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116974440608993373361/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbi1feENBEAE",
            "reviewer_name": "Lily Ho",
            "rating": 5,
            "review_text": "My personal training experience has been by far one of the best experiences I have experienced at BLK BOX GYM in Richmond. I have had several personal trainers in the past from large corporate gyms and in comparison the level of detail and precision that goes into crafting these programs for clients are unmatched. I received a comprehensive spreadsheet of my workout split, a detailed training and nutrition guide alongside with progress photos. Harris utilizes a technical approach and can accurately pin point root causes of certain limited ranges of motions in various movements and exercises which has helped me immensely in reaching my fitness goals. I came into the beginning of my sessions with shoulder pain and Harris incorporated rehab exercises to alleviate the pain and and now it is completely gone. He also taught me how to effectively and properly breathe during my exercises and that has been an absolute game changer in my workout sessions. The value I have gained from my sessions with Harris has been incredible and I am now equipped with the knowledge and skills to maintain the physique I have built. I appreciate the professionalism from Harris and would highly recommend this personal training gym in Richmond.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:09.709392",
            "response_from_owner_text": "Were so happy to be apart of your fitness journey, Lily! Thank you and keep killing it.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:09.709392",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/102929672720636047783/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOGY3OFVBEAE",
            "reviewer_name": "Eleanor Lea",
            "rating": 5,
            "review_text": "BLK BOX is a small gym with big enthusiasm. Everyone I have met so far is friendly and professional. I have been training here for over two months and am so impressed with my PT, Preston. Having been a member of larger, corporate gyms before, I was a bit hesitant on joining a boutique gym but due to the covid situation, I thought I would try a session. As a busy mom, I really dont have too much time to train on my own.  After meeting my PT, I knew this gym would be a good fit for me.  Preston made sure I maximized my training time doing workouts that he tailored to my training goals and lifestyle.  He is very knowledgeable and encourages me to work harder and better. In addition to our workouts, he would give me advice on nutrition and daily exercise habits. I wouldnt have been able to achieve the progress that I have made so far without my PT. I was so surprised to see myself in the mirror with a barbell and weights in such short time! Instead of dreading to go to the gym, I am now looking forward to it. If you are looking to see results with friendly, professional and knowledgeable PTs, I would highly recommend BLK BOX.  My only complaint is that I havent seen Obi, the fur trainer lately. I always look forward to seeing him too!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:09.712963",
            "response_from_owner_text": "Were thrilled you enjoyed your training with Preston, Eleanor! Youve made a considerable amount of progress upon the start of your training. Well make sure to bring our lovely fur trainer into the gym more often!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:09.712963",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117591803893885980000/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcXZuUnVRRRAB",
            "reviewer_name": "Derek Kruszewski",
            "rating": 5,
            "review_text": "Strength trained with Rogan for 6 months in 2022. He has been an excellent trainer: always friendly, attentive, encouraging, and a wealth of knowledge. The gym is well kept and has a diverse set of clientele across all ages and genders. Would recommend.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:23:09.715589",
            "response_from_owner_text": "Hi Derek! Thank you for the kind review. We are super happy to hear your journey with Rogan has been excellent :)",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:23:09.715589",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107610565330520308420/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTOHMzMnJBRRAB",
            "reviewer_name": "Hao Zheng",
            "rating": 5,
            "review_text": "Have been going to BLK for the past half year and getting training from Ken (45+ sessions). From my limited personal training history in Toronto and Vancouver, I would say this is my best experience so far. The gym is never crowded, which is great these days. Ken is super professional and very passionate about building a sustainable workout routine for me. I really enjoy many personalized stretch procedures that he carries out on me every session, to avoid injury and maximize performance. I had many great conversations with him too, although mostly on Tesla:)",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:23:09.718365",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106471982837009540680/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNzlmaG5nRRAB",
            "reviewer_name": "Denise Toor",
            "rating": 5,
            "review_text": "Prior to starting at BLK Box I had an absolutely terrible experience with personal training so I was hesitant to try again. However, from the very first consultation with my trainer Sarah, I knew this was going to be the right fit for me. Not only is she kind and funny but Sarah is EXTREMELY caring and knowledgeable. Going to train with her was always the highlight of my day and I think that speaks volumes of the atmosphere created by Sarah and the other trainers. You can tell theyre like a little family and they make you feel like youre a part of it also. In my time there, not once did I ever feel out of place or intimidated. In fact, my confidence in lifting weights and going to a gym on my own grew significantly all thanks to Sarah. She really pays attention to detail and making sure you understand what youre doing and how to complete the exercises properly. Her dedication to her clients truly shows and Im lucky to have found a friend in her. I seriously cannot recommend her enough! TLDR: BLK Box is comprised of the sweetest individuals and my trainer Sarah is quite literally the best trainer you could ask for. Do yourself a favour and book a consultation with her ASAP!!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:09.720931",
            "response_from_owner_text": "Thank you for your kind words, Denise. Were thrilled to hear that you enjoyed training at our facility just as much as we enjoyed having you. Keep chasing those gains!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:09.720931",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105966529601822251827/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleS1MMkF3EAE",
            "reviewer_name": "Joyce Xiao",
            "rating": 5,
            "review_text": "Ive been training with Sarah for about 2 months now. I havent gymed for 3 years because of covid. Sarah did an amazing job to get me started on my fitness journey again and help me work toward my goal of weight loss. With her help, I see a huge difference of my physique and my energy level. Shes very knowledge and encouraging that makes building up a fitness routine fun. I would definitely recommend Sarah and BLK BOX gym.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:10.394414",
            "response_from_owner_text": "Hi Joyce, were happy to hear that Sarah has made a big impact in your fitness journey!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:10.394414",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/118258416294723587129/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybWNIVFVBEAE",
            "reviewer_name": "Thalia Lang",
            "rating": 5,
            "review_text": "Sarah is a wonderful, knowledgeable trainer! She s very personable and does a great job meeting you where you re at in your fitness journey. She pushes you (in a good way) and made me feel so comfortable returning to working out after nearly 2 years away from the gym. The other trainers are very nice and the gym itself is always clean, has enough space, and has a good variety of equipment. It s pet friendly too!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:10.398580",
            "response_from_owner_text": "Were so happy to hear that you enjoyed training with Sarah! We loved having you and Cici in our facility. Please come back soon!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:10.398580",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 22,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/114181007412591149150/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1djlfQS1nRRAB",
            "reviewer_name": "Simrit Sian",
            "rating": 5,
            "review_text": "I ve was training with Sarah for a few months and honestly I have nothing but positive things to say about her. As an individual, Sarah is one of the kindest people I have ever met. She s such a genuine person who really cares about people, which made it so easy for me to connect with her instantly. As a trainer, she listens to what your fitness goals are and really caters to that. She pays attention to your pains/limitations and works towards healing those (I work at a desk all day and she really worked on trying to reverse that damage). She takes time to make sure you re all warmed up, massages out any tight muscles from prior workouts, and switches workouts up often to make sure you re avoiding that plateau. What I love about her is how much importance she gives the mental aspect of working out along with the physical. The progress that I saw within even 3 weeks was incredibly rewarding. She puts you through a very comfortable level of discomfort and isn t one of those trainers who you dread going to because of how intense it is. She greets you with a smile and makes it an incredibly positive experience overall. All-in-all, she s amazing. Life has gotten in the way and I haven t been able to reconnect with her but hoping to do so again in the near future.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:10.402210",
            "response_from_owner_text": "Thanks for your kind words, Simrit! We really enjoyed having your energy in our facility so we re happy to hear you enjoyed training with Sarah just as much. Hope to reconnect soon!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:10.402210",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106885964296458543550/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMmFyRl9RRRAB",
            "reviewer_name": "Lucien Lu",
            "rating": 5,
            "review_text": "These guys are the best personal trainers Ive met in Richmond. Ive known Ken since high school and he has never let anyone down. If youre on the fence, you wont regret signing up.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:23:10.405797",
            "response_from_owner_text": "Hi Lucien! Thank you for the review, Ken and the rest of the team appreciate your kind words!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:23:10.405797",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/111595241318138679056/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMTlMRk5BEAE",
            "reviewer_name": "Zhenkai Yu",
            "rating": 5,
            "review_text": "I have been training at BLK for the past three months now. I first reached out to them in hope to find a relatively more private place to train due the pandemic. To my surprise, my trainer Mat introduced to me to a whole new perception about physical training. On top the sheer wills of working hard, he explains to me the necessity of working smart, and the progress is visible, and measurable. After sessions with Mat, I would feel much more comfortable working out by myself,  knowing that I am so much more knowledgable about fitness and my body in general. I would 100% recommend Mat to anyone from beginning level to advanced.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:23:10.409267",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117026936549111894577/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVel9LeDd3RRAB",
            "reviewer_name": "Ardis Liu",
            "rating": 5,
            "review_text": "I have been training with Ken Lu for almost two months. He helped me a lot not only on lifting weights in accurate forms, but also on building self-discipline in following meal plans. He is an excellent personal trainer and he is very knowledgeable. I really enjoyed the classes with him and I definitely plan to stay and do more exercises with Ken for a longer period of time. I strongly recommend everyone take the first consulting class with Ken and Matt (its free), and I am sure you will like them.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:10.412624",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/113868218301735423953/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNjR6eUtnEAE",
            "reviewer_name": "M",
            "rating": 5,
            "review_text": "Did personal training with Ken at Blk Box a year ago, learned a lot that I didnt know about from just going to a regular gym or any other PT trainers before Blk Box. Till today, I still practice the stuff he taught me and would recommend his training.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:10.415058",
            "response_from_owner_text": "Hi M, were happy that youve gained lots of knowledge from Ken! Lets hope to reconnect soon!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:10.415058",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 84,
            "total_number_of_photos_by_reviewer": 49,
            "reviewer_url": "https://www.google.com/maps/contrib/114993580565959012039/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwXzd1bEF3EAE",
            "reviewer_name": "Samantha Vu",
            "rating": 5,
            "review_text": "Hands down the best gym experience I ve ever had. Ken is patient, knowledgeable, and efficient. His simple approach to strength and body building training has assisted me in pursuing my fitness goals. You definitely leave happy and accomplished after just a single session. I would highly recommend BLK BOX GYM.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:10.418086",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106980414685612190221/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPay1UdldBEAE",
            "reviewer_name": "Maria Osipova",
            "rating": 5,
            "review_text": "I ve joined BLK gym about two years ago when my weight was at my highest point. I met my trainer Harry and asked to help me gain the strength and energy and be fit enough to train Muay Thai. Harry was amazing from day one, he tailored the program to achieve my goals and has helped me every step of the way to reach them. From understanding nutrition plan, to weight training, to being there through tough days and best days. I started seeing results after few months. Not only had I the energy to train, run, be more active then I ever was, I was doing all of that pain free. Harry helped roll out and strengthen the muscles and made sure that every exercise was done in perfect form. I was able to maintain the weight loss for moths and started hitting weight lifting PRs that were more than my original weight. Harry helped me in so many ways, giving strength and energy to change my weight and in many ways my life.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:10.420568",
            "response_from_owner_text": "Were so thrilled to hear that Harry has made such an impact on your everyday life, Maria! Thankful to have you apart of our community.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:10.420568",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 19,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/110295477920142816235/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPb2Npa2FREAE",
            "reviewer_name": "Michele Cheung",
            "rating": 5,
            "review_text": "I ve been training at BLK BOX just over 4 months. My trainer, Sarah, has been incredible at helping me accomplish my fitness and lifting goals! From the get-go, Sarah was results-driven and designed a custom workout program for me both at BLK BOX and at home (I own a home gym). On Day2 of training when she gave me an Excel spreadsheet of lifting homework to track progress, I knew she was my trainer!! I went from a pre-COVID deadlift PR of 135 to 185 comfortably in 4 weeks! And a squat PR of 85 to 155 in the same time! I can also finally do a non-assisted pull-up! Sarah is friendly, professional and very knowledgeable about lifting. She corrects my form to lift safely and pushes me to become stronger! Sarah lifts super heavy herself (ask her about her PRs)! I look forward to continue training with her :)",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:10.423169",
            "response_from_owner_text": "Its awesome that you were able to achieve so much in a short span of training with Sarah! Keep crushing it, Michele!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:10.423169",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 42,
            "total_number_of_photos_by_reviewer": 108,
            "reviewer_url": "https://www.google.com/maps/contrib/100598991699247855677/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzeWJxN0Z3EAE",
            "reviewer_name": "Gary Yeung",
            "rating": 5,
            "review_text": "As part of my new year resolutions to become healthier, I signed up with one of personal trainers at Blk Box Gym, Matt. Its been close to 3 months and my experience has been overwhelmingly positive! Its hard work, but every session puts me one step closer to achieving my goals. So far, my walking posture has improved and my neck and back pains have lessened. Its a very rewarding experience seeing and feeling these improvements, and having Matts professional guidance aids in expediting my progress. He is very knowledgeable in the fitness field and helps someone like me, whos completely new to working out in correcting my form and understanding the reasoning behind each movement. The exercises vary in each session which keeps things fresh and interesting. I highly recommend Matt for personal training at Blk Box Gym especially if you dont know where to start on your journey to better health.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:11.207001",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110654048328774926579/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeHA2UktnEAE",
            "reviewer_name": "tee ee",
            "rating": 5,
            "review_text": "Great environment for training! Glad I came here for my first personal training sessions because normal gyms feel super foreign to me and here all the trainers are very nice and friendly so I don t ever feel intimidated, especially being a girl at a gym! Sarah is my trainer and I absolutely adore her. I always have a lot of questions about the different movements and she s knowledgeable and patient with explaining the details. I didn t think I d come to enjoy gymming as much as I do now so i d say the trainers really do make a difference!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:11.209022",
            "response_from_owner_text": "It is awesome to hear that you feel comfortable training at our facility! Were so happy to hear that we helped you enjoy exercise. Keep killing it!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:11.209022",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117712350625364604157/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwb0pfMkhBEAE",
            "reviewer_name": "Joyce W",
            "rating": 5,
            "review_text": "Ken is a wonderful personal trainer with a lot of knowledge about the anatomy aspect of the body as well as detailed instructions on positions and workouts that I can do to achieve my body goals. He is really patient and supportive throughout the session which influenced me in wanting to continue working out. I would definitely go back to BLK BOX GYM.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.211283",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112687787511253013470/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN291eEpREAE",
            "reviewer_name": "Jasmine Nguyen",
            "rating": 5,
            "review_text": "I love going to BLKBOX to see Jodie!! If it weren t for Jodie my fitness journey would have been tough!! Before every exercise she makes sure to explain which muscle you re working and how to prevent myself from not getting hurt. She is super patient and professional. I love her so much!! She s the best",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:11.213068",
            "response_from_owner_text": "Thrilled to hear how much you love training with Jodie! She is awesome. Thank you for your support, Jasmine! Keep crushing it.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:11.213068",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109100318261589145945/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzanFhOXNRRRAB",
            "reviewer_name": "Chi Liu",
            "rating": 5,
            "review_text": "I have been training with Matt, co-founder of this gym, for about 5 months and each training session is effective and better than expected. Backed by his more-than-a-decade experience as a bodybuilder and a trainer, Matt understands his clients  capability and limitations, providing personalized training routine and protection. He is super cool and easygoing. I sincerely recommend my trainer&friend Matt to whoever is interested in getting a better shape and lifestyle.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:11.215104",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/118278696241426422683/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNveU12U1hREAE",
            "reviewer_name": "Tina Hong",
            "rating": 5,
            "review_text": "Amazing gym, clean and spacious! Has anything youd need for a good workout and the trainers there really know their stuff. They can explain and go over every movement with you, not only details on your form but also what muscle groups it works on. Did a group training session today with Ken. Intense but fun at the same time , will definitely be coming back! They also offer personal training. Highly recommend !!!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:11.216829",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108253762795460053431/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQweVl5Sm1BRRAB",
            "reviewer_name": "Derek Wong",
            "rating": 5,
            "review_text": "I worked with Matt for 3 months with the goal of getting back into shape. Within the set, my confidence returned, my strength went up and my knowledge of how to create my own workout program increased. Matt and Ken are incredibly inviting, knowledgeable and flexible. Their business model promotes local people with a strong work ethic. You cant go wrong with either of them for personal training.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.218418",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105165004731339011131/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXemNpUS1BRRAB",
            "reviewer_name": "Jackie So",
            "rating": 5,
            "review_text": "I was suffering from mid / upper back pains since high school while performing any ab exercises and I came to see Harris for the issue. He was able to figure out what was causing the problem and help me fix issue in my very first visit. He started off with some tests with range of motion of my spine and discovered some asymmetries in rotation from left to right and also upper mid back tightness. Harris thoroughly explained to me the reasons why I was likely experiencing pains and gave me a couple mobility exercises to do before I start my workouts, stretches, and also taught me how to properly brace my core during my ab exercises to keep on being pain free while doing exercises. After the session I was able to perform exercises with absolutely no pain at all. I didnt expect my issue to be fixed this quickly considering its something Ive dealt with for years now and I regret not coming sooner. Highly recommend Harris for all your pains, injuries, and personal training needs in Richmond!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:11.220036",
            "response_from_owner_text": "Thank you, Jackie! We re happy to hear that we were able to help you move pain-free! Keep killing it.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:11.220036",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111793395898411611532/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNjd2eDNnRRAB",
            "reviewer_name": "Ying Hu",
            "rating": 5,
            "review_text": "I started my first personal training with Ken when I joined Steve Nash in 2015. He was professional, knowledgeable and nice. He would explain not only how to do an exercise correctly, but also which muscle group the exercise targets as well as the variation of it. Working with Ken gave me the confidence and resource to be self-sufficient so I was able to incorporate fitness in my daily life. Now, 3 years later, I am excited to join blk box gym, where I also get to meet Matt. Its a pleasure to work with the champions (both Ken and Matt are NPAA champions). They are passionate about training and dedicated to help their clients succeed.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.221828",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102696189915990060051/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJcTVTeUNBEAE",
            "reviewer_name": "Kelvin Yeung",
            "rating": 5,
            "review_text": "Super friendly staff and very knowledgeable trainers! I started out with their group fitness classes then went ahead and signed up for a few personal training sessions. I thought I knew what I was doing before but Ken, my trainer, showed me all the little common mistakes and really helped refine my form in a lot of movements. Definitely planning to stay and do more here!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.223412",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111283371101165068331/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdzlfUDlRRRAB",
            "reviewer_name": "Ophelia Yu",
            "rating": 5,
            "review_text": "Ive been working with Ken from Blk Box Gym for a little over a month now and Im very glad I made the leap to commit to personal training. After thinking about personal training for a long time and doing a ton of research, I found Blk Box Gym. From the very start, Ken was supportive, approachable, and invested in helping me reach my goals. Ken is friendly but will make sure you work hard! What I appreciate about the program itself is that it is holistic and comprehensive; it is not just about the training nor just about dieting. Ken provides expertise and guidance for both exercise as well as nutrition and the program he has created for me is a great mix of aiming high when goal setting but also creating healthy habits that are sustainable and realistic based on my lifestyle. I look forward to the rest of the journey with Ken and Blk Box Gym.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.878462",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/114463226640654576240/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvLUoycTNRRRAB",
            "reviewer_name": "tyler alderman",
            "rating": 5,
            "review_text": "I have been training here for a bit now and I have never had a better experience. I have trained and worked out in multiple gyms and none are quite like BLK box. Matt and Ken have really created a perfect experience with a perfect space, they have motivated me to create a better and more sustainable work out style!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.882519",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108912862879387686524/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpbmFPSUdnEAE",
            "reviewer_name": "Jan Dockray",
            "rating": 5,
            "review_text": "David Rojo has been my personal trainer for the past 8 years.  Because of David, my health, in general, has greatly improved. When I first started training with David, I was diagnosed with high blood pressure. Now normal.  Boxing for cardio, weight training and various other forms of exercise under the coaching of David, has helped keep my 77year old body in reasonable shape. David is the best coach and personal trainer anyone can ask for.  Hes caring and his clients remain his top priority.  I would recommend David to anyone looking for a top notch coach and personal trainer.  Over the past 8 years,David and I have become very good friends!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:11.886050",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103430522014305055338/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMweGE3LXpBRRAB",
            "reviewer_name": "Anthony Shivakumar",
            "rating": 5,
            "review_text": "The trainers are friendly, very knowledgeable and the gym is well equipped. Both personal trainers, Matt and Ken are bodybuilding champions. They look the part and walk the talk. If you are looking to get in shape I would definitely recommend BLK BOX GYM.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.890034",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/116966197868208360852/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbC1Uc1N3EAE",
            "reviewer_name": "Sakura Iwagami",
            "rating": 5,
            "review_text": "David Rojo is a great personal trainer, I have been working with him with boxing and general fitness. He has really helped me with my chronic back, shoulder, and hip issues due to work habits. David is super positive, motivating and makes exercise fun. I cant recommend him enough!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:11.893069",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/100148911993048316773/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNU9XMVFREAE",
            "reviewer_name": "Irena Lytvynyuk",
            "rating": 5,
            "review_text": "I did PT with Jodie for two months. Shes brilliant - super knowledgeable and motivating. Thanks to her I was able to build my stamina, improve my strength and learn a variety of exercises tailored to my goals. Highly recommend :)",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:11.896639",
            "response_from_owner_text": "Thrilled to hear that Jodie has helped you in your fitness journey! Keep killing it, Irena.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:11.896639",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117465372908526565866/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaTUzWWpBRRAB",
            "reviewer_name": "Nathan Ong",
            "rating": 5,
            "review_text": "First of all let me just say, over the years Ive trained at multiple gyms and have had different trainers over time. But nothing compares to BLK BOX GYM conveniently located in Richmond B.C. As the name states its black box gym, your literally working out and training in a box, thats of course painted black giving you a more overall better experience. With new equipment and very knowledgable Trainers your sure to accomplish your goal no matter what the obstacles may be. Im personally very proud to be part of Blk box gym and being able to have personal training and soon enough accomplish my goals thanks to my very good friends Matt Law and Ken Lu who are the trainers here. I believe the only way one can accomplish their goals is to put in the work so what are yall waiting for, check em out today!! And change your life forever",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.899877",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/100815074658518518950/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNveU12OUZnEAE",
            "reviewer_name": "Rachel Woo",
            "rating": 5,
            "review_text": "Just did an intense group training session with Ken. He s really great, he knows how to communicate and explain the exercises well. He also gives excellent advice on if you re having any muscle pains. The environment itself is nice, spacious and all the trainers are very friendly. Overall great experience and would definitely recommend!!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.902471",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113318807803673068419/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bnViakVREAE",
            "reviewer_name": "Renzo Rettis",
            "rating": 5,
            "review_text": "Really enjoyed my time at blk box. Ken was very insightful and knowledgeable. Training at blk box I have gotten the results I have been looking for and it definitely couldn t have been possible without the help of Ken. The gym is never crowded and it is always clean the other trainers are incredibly friendly and it is a great environment to train in. Would definitely recommend.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:23:11.905050",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110160556894220866618/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrdzQ3N05BEAE",
            "reviewer_name": "Rachel wu",
            "rating": 5,
            "review_text": "Blk box gym Personal Training is really great. I was skinny but too unmotivated and shy to go to the gym. Ken is an amazing personal trainer and I am happy and now more confident with myself. Highly recommend",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:11.907965",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/100736572548994029616/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJd016SmJ3EAE",
            "reviewer_name": "Pavel Chan",
            "rating": 5,
            "review_text": "Staff is extremely knowledgeable. The personal training I received from Ken is nothing short of professional. Theyve shown their knowledge and expertise in many aspects of weight lifting. Regardless, if youre going through a rehab or just working on strength training, the staff know what theyre doing and you cant find a better place to train elsewhere.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:12.542567",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100579139611941298171/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbXFIRG9BRRAB",
            "reviewer_name": "Rachel Kwong",
            "rating": 5,
            "review_text": "I ve had a lot of fun training with Jodie at BLK BOX. She s very knowledgeable and also incredibly patient and encouraging. I enjoy all my sessions so far and will definitely recommend this place (and Jodie!) to anyone who s looking for somewhere to train!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:12.545996",
            "response_from_owner_text": "Thank you for your kind words, Rachel! We appreciate it.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:12.545996",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106238262662178439127/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNja1ppa1JBEAE",
            "reviewer_name": "Ramboud Farahani",
            "rating": 5,
            "review_text": "I had the pleasure of training with Harris, and I have nothing but the best to say about my personal training experience with him. I came into the session feeling generally good about my form, but there were certain lifts that were starting to become uncomfortable as I increased the weight. My bench press was such an example. Almost immediately Harris gave me some pointers and my bench press felt a lot better. It felt less strenuous in a good way, and I felt that my chest muscles were being activated more than before.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:12.549838",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105553062291117144824/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaDZ6OFdBEAE",
            "reviewer_name": "Peter Wang",
            "rating": 5,
            "review_text": "I m a regular at BLK BOx Gym. I very much enjoy the first-class attention to detail that Ken (my trainer) provides me when it comes to personal training. I started my fitness journey by myself a few years ago. I mostly did cardio and then a few compounded exercises that s suppose to give me a full body workout. In 2017 my friend referred me to Ken and said to give personal training a try. I was skeptical at first because I believed my training was sufficient. Boy was I wrong. Sure I was keeping my shape and losing weight, but I had no idea how to train effectly to target muscle growth. Ken s expertise have brought my own fitness goals to another level. If you are looking for personal training, attention to detail, first-class trainers, then do yourself a favour and sign up at BLK BOX. This gym is not your social hangout. It does not offer you lemonades, fresh towels or spas with fingerprint lockers - It s designed for one purpose and one purpose only: to give you a proper, scitentfically-proven, fastest way to attain your own fitness goals workout. I like it for its gritty, no B.S, no judgement type of environment. If you are serious about training, do yourself a favour and give them a try.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:12.552860",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111413768526609933670/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDM3FUNDN3RRAB",
            "reviewer_name": "Tommy Liu",
            "rating": 5,
            "review_text": "Before meeting Harris, I thought I understood the limitations of my body. Only after coming to BLK BOX I realized techniques and forms that elevated my lift potential. Having previous injuries limiting my mobility, Harris immediately knew what was wrong and educated me on stretches that allowed for deeper range of motion and full activation of my muscles. I definitely recommend going to BLK BOX and asking Harris for a consultation.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:12.555846",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100016517113085137773/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNOV8zclZREAE",
            "reviewer_name": "Angelo Yue",
            "rating": 5,
            "review_text": "During my time there, I had Ken as my trainer. He was very knowledgeable and professional and I learned a lot in terms of how my muscles developed, how to optimize my routine and the techniques involved in each exercise. Highly recommended!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:12.558856",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 50,
            "total_number_of_photos_by_reviewer": 26,
            "reviewer_url": "https://www.google.com/maps/contrib/103602601278430162454/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOExEdHdnRRAB",
            "reviewer_name": "Yuhao Han",
            "rating": 5,
            "review_text": "Blk Box Gym is a really awesome gym! Very knowledgeable trainers Ken and Matt teach me how to live in a healthy lifestyle. Training with Ken for about a year makes me change a lot! I really enjoy training in Blk Box Gym!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:12.561590",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/108602425723183889202/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcG9fSldBEAE",
            "reviewer_name": "Travis liu",
            "rating": 5,
            "review_text": "BLK Box gym is a great location for people of all fitness levels.Trainers are encouraging and dedicated.Staffs are very professional and informative. They offer personal training fitness sessions to build up muscle and help with posture.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:12.564282",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101669770507427605402/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpdTRiYjd3RRAB",
            "reviewer_name": "Stephanie Talbert",
            "rating": 5,
            "review_text": "The gang at blk box are an amazing! They re fun to be around and are so supportive. I ve been training with Harry Patel for about 2.5 years and couldn t be happier. He s a great guy with a lot of knowledge! I alway have a good workout with him. Love my time at blk box",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:12.566842",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104869450789616750416/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwcjR6VWdnRRAB",
            "reviewer_name": "Vacant Position",
            "rating": 5,
            "review_text": "OKAY SO, I was recommended to Ken and so glad I decided to work with him. I m 25 but felt like I was 85 since I had back problems. Thankfully working Ken has allowed me to pinpoint my back issues, but that s not the point. THE POINT IS, the most rewarding experience I ve had is learning to maintain my lifestyle while still being in track and getting in shape.I thought I was smart about these things but turns out I m not. ALSO, KEN WENT ABOVE AND BEYOND trying to fit everything into my schedule, the number of workouts per week as well finding food that I liked but fit within my macros. I m not kidding I m legit busy all the time and not going to lie, I wasn t holding my end of the bargain. Ken was so nice and understanding but made sure I knew why training and being healthy was important. Honestly, everyone should invest in one of the personal trainers because really, it s an investment in yourself. You can tell they put a lot of work in the company. SO MORAL OF THE STORY, IF YOU DONT WANT A GENERIC PT AND SOMEONE WHO MAKES YOU FEEL YOUNG AND NOT 85 YEARS OLD GO TO BLACK BOX GYM. Not only will you be more healthy but you learn proper techniques (which your back will thank you later) and have fun. I MEAN IM A WOMAN AND I FEEL BADASS THAT I CAN LIFT MORE WEIGHTS THANKS TO KEN. I m not yelling, I m just mega excited.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:12.569578",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115076281720330334113/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDZ2VUb21BRRAB",
            "reviewer_name": "Marko Joannou",
            "rating": 5,
            "review_text": "Everything you need for a personal training environment.  David Roxas is my boxing and Muay Thai coach with great results.  Focused training and designed for the fitness minded individual at any level or age",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:13.222504",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 275,
            "total_number_of_photos_by_reviewer": 546,
            "reviewer_url": "https://www.google.com/maps/contrib/115862964292341321650/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdlp6LVVBEAE",
            "reviewer_name": "Rob Kim",
            "rating": 5,
            "review_text": "I ve been getting personal training with Ken. He s been excellent and very informative. He s been able to help with proper form, injury prevention, and meal planning. I highly recommend blk box gym. Looking forward to see how far I can go with Kens help in the next few months.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:13.227931",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101049242251453143979/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjdzR1YW93RRAB",
            "reviewer_name": "Coley",
            "rating": 5,
            "review_text": "These guys are amazing! I have been working out with Joyce. - and I ve never worked with anyone so attentive and understanding. Even when closed due to lockdown, she s helped me come up with an entire routine I can do at home and has been checking in to keep me accountable and helping me adjust wherever I need.  Best investment I ve ever made!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:13.231335",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117091489077490941482/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrM2I2dFZBEAE",
            "reviewer_name": "Suet Suet Lau",
            "rating": 5,
            "review_text": "I ve been going to their boot camp class for two months now. Matt and Ken are awesome. They will guide you and make sure you are doing the exercise correctly. Definitely recommend all mommies that have very little time to work out.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:13.234467",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118073914571461184926/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdmJmcG5BRRAB",
            "reviewer_name": "Eva Tong",
            "rating": 5,
            "review_text": "Amazing gym - incredibly friendly and fully supportive staff. Every time I ve gone, the trainers there have asked how I ve been doing, my progress etc. I ve also trained with David for a few years now and would hands down recommend him to others any chance I get. Absolutely great gym, clean and well maintained also!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:13.237481",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106484557335830788572/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaDdqTjh3RRAB",
            "reviewer_name": "Sherri Motohashi",
            "rating": 5,
            "review_text": "BLK BOX gym and owner Matt are so amazing! Very knowledgeable, thorough and motivational. Hes going to help me achieve my goals for sure!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:13.241270",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 29,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/102966828636068837540/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdFlqQXdRRRAB",
            "reviewer_name": "Adam Wong (adamsywong)",
            "rating": 5,
            "review_text": "Despite being friends with the owners, I can honestly say that the establishment they have created is of the highest quality. The trainers that have gathered are complete all-stars and the price per sessions are unbeatable for the quality.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:13.244598",
            "response_from_owner_text": "We value your kind words, Adam! Thank you for being apart of our community.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:13.244598",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108882423575665541812/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4aDl5NGx3RRAB",
            "reviewer_name": "Michael Yun",
            "rating": 5,
            "review_text": "Have the pleasure with working with David for the past months and its been fantastic! He really knows what hes doing and is encouraging and awesome to train with. Highly recommend coming to Blk box! The staff are really friendly and the facility is very nice",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:13.247691",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108747964585354217650/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbzRyQld3EAE",
            "reviewer_name": "Denon Maximchuk",
            "rating": 5,
            "review_text": "I used to train elite athletes, and can tell you that Im a harsh critic on trainers....but I can happily say that fellas over at Blk Box Gym are world class in every way. Always focused on improving and constantly staying up to date on current science and nutritional guidance approaches, I highly reccomend stopping in for a consult with Matt and Ken",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:13.250314",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102450617772716668718/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNXNtdTBnRRAB",
            "reviewer_name": "Michael Liu",
            "rating": 5,
            "review_text": "I have been working out here for 4 months. Everything is good. My personal trainer Matt is very very professional patient and responsible.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:13.252682",
            "response_from_owner_text": "We appreciate your kind words, Michael! Thank you",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:13.252682",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101219738534258629299/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJX3VLd0ZnEAE",
            "reviewer_name": "David Lee",
            "rating": 5,
            "review_text": "Amazing experience training here at BLK BOX GYM. Great environment and great trainers that really know their stuff! Highly recommend!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:13.861838",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106508829553132851441/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJeV9EY1F3EAE",
            "reviewer_name": "Edward Zhou",
            "rating": 5,
            "review_text": "The staff is very friendly and welcoming. Theyre group fitness sessions not only work up a sweat but are really fun, that hour past by so quick!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:13.865457",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104043316203243526820/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMmJYMjBRRRAB",
            "reviewer_name": "Paulo De Mesa",
            "rating": 5,
            "review_text": "I have learned a lot training in this gym. Great coaches and really nice place to get trained.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:13.868797",
            "response_from_owner_text": "Thank you Paulo! Were happy to hear you learned lots from our gym :)",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:23:13.868797",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106893756043278110814/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvLUp2bHBBRRAB",
            "reviewer_name": "Anaahat Dhanju",
            "rating": 5,
            "review_text": "Very nice setup with great personal trainers in Matt and Ken, would highly recommend to anyone who wants that extra push with knowledgeable trainers",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:13.872149",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103812554221736187551/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdDdUSkJREAE",
            "reviewer_name": "Ryan Pak",
            "rating": 5,
            "review_text": "Excellent facility and Ken is super knowledgeable and helpful with making sure you have proper form and technique.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:23:13.875064",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 33,
            "total_number_of_photos_by_reviewer": 548,
            "reviewer_url": "https://www.google.com/maps/contrib/113600382871412673203/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMmYzVlZBEAE",
            "reviewer_name": "Carlos stafford",
            "rating": 5,
            "review_text": "Friendly staff, great atmosphere!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:13.877996",
            "response_from_owner_text": "Thank you for your kind words Carlos!",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:23:13.877996",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/105087068948095700319/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdGNpVTRRRRAB",
            "reviewer_name": "Brian Hsieh",
            "rating": 5,
            "review_text": "Very awesome placeeee wooooo",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:13.880999",
            "response_from_owner_text": "Thank you, Brian! We appreciate you.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:23:13.880999",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102620342295245472185/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrM2RxVDFBRRAB",
            "reviewer_name": "Allen Huang",
            "rating": 5,
            "review_text": "I started to find Ken as my fitness coach at BLK gym in April. He provides very professional personal training and the class time is not long at all. Unlike other fitness clubs or coaches, a one-hour class actually only lasts 45-50 minutes. He also has rich professional knowledge and explains the essentials of each action in detail. I recommend everyone to give it a try!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:13.883911",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109992800159399981921/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjeHF2cTVRRRAB",
            "reviewer_name": "Shan Lu",
            "rating": 5,
            "review_text": "Blk box gym is the most professional and carefully run store among all the personal training gyms I have visited so far. Not only do each of their coaches have great bodies, but their professional knowledge is also needless to say  . He really knows how to practice and teach, and the price is very affordable. I recommend friends who want to find a personal trainer to check out this gym, it s invincible!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:13.886400",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104823504784298815764/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaThtWWRnEAE",
            "reviewer_name": "Serena Su",
            "rating": 5,
            "review_text": "After being introduced by a friend, I signed up for personal training. Under the guidance of coach Ken Lu, I slowly started from the basics three times a week. Squats are now easy. The waist and legs also become stronger and stronger. The best thing is that if I have any muscle tightness or soreness during training, the coach can immediately help me relieve it with professional techniques. I like Kens professionalism very much and will always follow him in fitness.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:13.889220",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113479861672528898445/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJX1Bha3dRRRAB",
            "reviewer_name": "Zhou Zeyuan",
            "rating": 5,
            "review_text": "I happen to know Matt, the founder of this gym studio. As for his achievements, I don t need to repeat them, but I can feel his enthusiasm for fitness from my usual contact with him, and he also shares this enthusiasm. Putting it into this gym studio, it will be passed on to his students. With his professional background, in addition to the professional knowledge of daily teaching, the arrangement of various equipment is also very reasonable. Whether you are a beginner or a fitness master, I hope everyone can go to blk box gym to experience it and share the love of fitness together",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:14.630096",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110951430874654959711/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrM2FuUWNnEAE",
            "reviewer_name": "WanHua Lee",
            "rating": 5,
            "review_text": "If you (you) are in contact with fitness for the first time, you must find a professional Personal Training coach to establish a good correct concept and training method, and then achieve your (you) goal with half the effort. Choose Blk-box-gym, Choose Ken, you (you) will know that bodybuilding is definitely not a difficult task!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:14.634069",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110083544743139550028/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": "Personal Training                                         Blk-box-gym,  Ken,       bodybuilding",
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjc2JDZTVBRRAB",
            "reviewer_name": "Rosa su",
            "rating": 5,
            "review_text": "I usually have the habit of exercising, and I started to exercise in this gym after being introduced by a friend. The fitness coach Ken helped me design an exclusive nutritional recipe, and carefully taught me how to calculate the nutrients I should take in a day, and how to increase healthily and effectively. muscle. Among them, the reason why I will continue to exercise here is that Ken will make many corrections and trainings for my movement standard accuracy and small details. There is a systematic and planned training, and he will pay attention to my weaknesses and past old injuries. There have been different changes in just 2 months. If you want more than a fixed exercise frequency, but more healthy and effective personal training, this gym is my first choice in Vancouver!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:14.637788",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116102552455402796390/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": ".    Ken             ,                 ,           . Ken                                   ,             ,      2         . ,",
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cjdyREFREAE",
            "reviewer_name": " ",
            "rating": 5,
            "review_text": "At the beginning, I wanted to work out, but I didn t want to go to the crowded gym in Richmond because every time I went to the gym, I looked very embarrassed. But if I go to this gym because it is far away, I will never meet anyone I know, so I will never do it. Embarrassingly, I also learned a lot about fitness here and lost 20 pounds. The fitness instructors here can speak Chinese, Cantonese and English. I highly recommend this place.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:23:14.641351",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111302747716794251713/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrbmZyNGZ3EAE",
            "reviewer_name": "John Zhang",
            "rating": 5,
            "review_text": "Highly recommended. I have practiced with Ken for more than 4 years and the results are obvious. There are a lot of bad fitness coaches in the Chinese circle who waste your time and develop wrong habits. So come to BlK BoX gym, you can get professional science training methods",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:14.644976",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105895180051097184386/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": ".   Ken       4       .                                  .      BlK BoX gym,",
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdDZETXF3RRAB",
            "reviewer_name": "Amy Feng",
            "rating": 5,
            "review_text": "Working out with Coach Ken, I feel that time passes quickly, and I don t feel that fitness is boring at all. The very professional teaching not only helps my hunchback and shoulder pain, but also makes my body stronger and makes people feel physically fit Younger",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:14.648174",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112710434419473671620/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": "Ken",
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzam9xQkV3EAE",
            "reviewer_name": "lan su",
            "rating": 5,
            "review_text": "My fitness trainer, Matt, is not only good-looking, gentle, but also very professional. He can make you fall in love with fitness and feel the fun of fitness.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:14.651142",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110609774980237222791/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": "Matt",
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwMHREbDJBRRAB",
            "reviewer_name": "Sss H",
            "rating": 5,
            "review_text": "I was very lucky to find Matt, a very professional, experienced and patient coach for the first time! I am very happy every time I take a class. I practice for almost 1-1.5 hours each time. It is very tiring, but I can see obvious improvement in myself. Very happy with the change!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:14.654105",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108718073147239891094/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": "Matt!                  1-1.5                         !",
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNjQ2NWpnRRAB",
            "reviewer_name": "gigi cheng",
            "rating": 5,
            "review_text": "Personal trainer is very professional and responsible. I feel that I am changing. This young and energetic team will promote myself to become stronger and better! Thank you black box gym!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:14.656967",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105438971000967473620/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": "Personal trainer                              team           !   black  box gym!",
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMi0zRDNnRRAB",
            "reviewer_name": "Zifan Kang",
            "rating": 5,
            "review_text": "Its a really professional team. At least they pay attention to the class and are very responsible, not in a hurry. I have looked for coaches before, but after comparing them, I still think they are better. I recommend trying a free class experience, and you can really tell the difference.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:14.659678",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/105125978606700918175/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dVk3eC1RRRAB",
            "reviewer_name": "Fernanda Gancedo Osorio",
            "rating": 5,
            "review_text": "",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:23:15.258653",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115413356255688263445/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwX05MeXhnRRAB",
            "reviewer_name": "Alan Wu",
            "rating": 5,
            "review_text": "",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:15.262076",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108717163304021390702/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdElmc3BnRRAB",
            "reviewer_name": "Chao-Yang Chan",
            "rating": 5,
            "review_text": "",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:23:15.265245",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": null,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "",
            "is_local_guide": null,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDOGI2RmFBEAE",
            "reviewer_name": "Hardik Patel",
            "rating": 5,
            "review_text": "",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:23:15.268239",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113319542924854636247/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrcmRDc013EAE",
            "reviewer_name": "Wei zhang",
            "rating": 5,
            "review_text": "",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:15.270879",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": null,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "",
            "is_local_guide": null,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5djdyeUxREAE",
            "reviewer_name": "david rojo",
            "rating": 5,
            "review_text": "",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:23:15.273431",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114976441113736042061/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbk9xR0p3EAE",
            "reviewer_name": "Leanne Dy Ning",
            "rating": 5,
            "review_text": "",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:23:15.276481",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111471991598585824620/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMWRiWElnEAE",
            "reviewer_name": "Weston Ho",
            "rating": 5,
            "review_text": "",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:23:15.278695",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114908486950721323376/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOHV2MEJ3EAE",
            "reviewer_name": "Rogan Cheng",
            "rating": 5,
            "review_text": "",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:23:15.280918",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104705822680548231040/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}