{
    "place_id": "ChIJUZ_hrWBxhlQRhCrbA3DBfLM",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3LWRTOWpnRRAB",
            "reviewer_name": "Nevin Low",
            "rating": 5,
            "review_text": "In marketing one of our clients new upcoming real estate development projects, we were looking for visual and rendering solutions that were not only unique but one that has not been used in the industry. In essence, we wanted to wow our developer client and also provide a wonderful representation of the project for prospective buyers and realtors to appreciate the realism of actually being inside of one of the townhouse units, through our project website, brochures and at our Presentation Centres. Our results with Stambol have been amazing. Their 3D, 360, AR, and VR work for us has exceeded all expectations. Never before have we been able to offer such high quality true to life images and renderings for a pre construction offering. Our client, prospective buyers and realtors have all been wowed and we are very happy with the work Stambol has done. The team at Stambol has been awesome to work with and dedicated to ensure client satisfaction. Stambol is a great partner for us and we look forward to collaborating with them with our future development projects.  We would greatly recommend Stambol Studios for anyone looking to do 3D, 360, AR and VR  in their respective industry. Nevin Low, Executive Vice President Nu Stream Marketing Inc.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:52.416790",
            "response_from_owner_text": "Thank you very much, Nevin. Your vision to incorporate these effective immersive technologies into your marketing flow is unmatched. We love working on every one of Nu Streams projects.",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-21 21:11:52.416790",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/117192408305453148738/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrZzVhNDBBRRAB",
            "reviewer_name": "Kevin Smith",
            "rating": 5,
            "review_text": "We just completed a project with Stambol for our companys townhouse project in North Vancouver. Stambol created VR tours of several of our home types and we are using this cutting edge technology in our sales centre to help help customers see our home plans in three dimensions. This is a game-changing technology and it offers so much more than traditional 2D drawings. Dogu from Stambol has offered us exceptional service and a great deal of advice and guidance as this is relatively new technology and can be intimidating to many. Stambol is highly recommended and we plan to use them again in the future.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:52.420858",
            "response_from_owner_text": "We are incredibly pleased to have worked with such a forward thinking team, Kevin. Immersive technologies are the best way to showcase your unique vision and every detail you are carefully crafting in the final product. We are thrilled you are benefiting from our VR and visualization solutions at many levels and cant wait to work on many new projects together that need stunning visuals and most functional interactive applications.",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-21 21:11:52.420858",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/103272901049408857862/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrbmZLVzRRRRAB",
            "reviewer_name": "Naomi Van Halteren",
            "rating": 5,
            "review_text": "Stambol Studios has exceeded my expectations, and the quality of their work has been incredible! Dogu, Mehmet, and their team were amazing at bringing my idea, vision, and VR experience to life. If you are looking for an unbelievable company to execute your AR/VR/XR needs, Stambol is the company to go with. Their work is mind-blowing! Thank you for all that you did and will do Stambol! I look forward to many projects together!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:52.424544",
            "response_from_owner_text": "You are the absolute best, Naomi. Your story and vision has been the most inspiring for all of us at Stambol. We appreciate the authenticity and fresh perspective you bring to every detail of one of the most fun and innovative health care products ever built. Your prompt feedback at every step does not go unseen as it made the overall process made our job twice as easy. Keep on being awesome! We are excited about our amazing partnership going forward!",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-21 21:11:52.424544",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/117669817969595898496/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdUlIdkVnEAE",
            "reviewer_name": "Tracey Carlson",
            "rating": 5,
            "review_text": "Pacific Coast Community College has been working with Stambol for over 4 years on our online advertising and marketing. They have successfully managed our requests and guided us into best practices that have helped increase our lead generation 50 fold since we started. The team at Stambol is incredibly creative and flexible and are able to translate our desired outcome into a cohesive strategy that works.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:52.427809",
            "response_from_owner_text": "Thank you for the kindest words, Tracey. It is an absolute pleasure to work with you and your team at the Pacific Coast Community College. Your passion to serve and finding innovative new ways to reach the target audience has been an inspiration all around the industry. We are truly glad to have been part of this amazing journey and use our creative muscles and marketing technology expertise to be able to help. Looking forward to many years of creating exciting and innovative projects together.",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-21 21:11:52.427809",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109717476146032760125/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdHFmOHVnRRAB",
            "reviewer_name": "Rowena Rizzotti",
            "rating": 5,
            "review_text": "I have had the pleasure of working with Dogu and team at Stambol for a few years now.  While I have greatly appreciated their expertise and technology in the rapidly evolving VR space, I am always impressed with their utmost commitment to the highest quality product, all while embracing the newest and most novel applications of the technology.  Dogu is a highly innovative thinker and deeply thoughtful around where VR and AR are going, such that they were able to demonstrate an entirely new way to recreate the experience of walking through our Health & Technology DISTRICT and Innovation HUB, allowing us to share it around the world.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:52.430880",
            "response_from_owner_text": "Thank you very much, Rowena. We are thrilled to be partners with such an amazing organization as Health and Technology District. You devotion to bringing the development of all the bleeding edge technologies into the healthcare space is very exciting. It was our pleasure to with your team and take a part in showcasing the DISTRICT, the Innovation HUB and the future of health technologies. Looking forward to building worlds together that truly enhance this space.",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-21 21:11:52.430880",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112382686410940626302/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaTdQWC13RRAB",
            "reviewer_name": "Edoye Porbeni",
            "rating": 5,
            "review_text": "The team at Stambol Studios do excellent, high quality work. That s easy to see. What I m most impressed with, however is the work that goes on behind the scenes. The team at Stambol made an extraordinary effort to get to know our goals and offered different solutions to help manage and meet our needs. Regular check-in s and updates kept me informed and engaged in the process. And, perhaps most importantly, the Stambol team itself has a cohesive spirit and is well organized which made everything go as smoothly as possible. I ve already recommended Stambol s services to other business owners and will continue to work with them for years to come.  Edoye Porbeni, CEO Future Health Ventures Inc.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:52.433926",
            "response_from_owner_text": "Thank you very much for the kind words, Edoye. We hold ourselves to the highest of standards when it comes to understanding your goals and finding the best solution possible within any constraint. Your innovative ideas and vision have inspired us all here at Stambol. It has always been great pleasure to work with you and we look forward to continuing to innovate together for the many years to come.",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-21 21:11:52.433926",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104583960148965823478/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMy1fRlZnEAE",
            "reviewer_name": "Amir Hemani",
            "rating": 5,
            "review_text": "What a fantastic final product to market our Heritage Townhouse units.  Dogu and Mehmet were consummate professionals to deal with and were extremely supportive in working with the changes and adjustments that invariably come with putting together a complex finished product.  Highly recommended for anyone looking to go next level with marketing any real estate spaces.  The realism of the finished product which hasnt even broken ground yet, is truly stunning !!  Next generation tech !!  Thanks Team Stambol !!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:52.436699",
            "response_from_owner_text": "Thank you very much, Amir. We are thrilled to have been a part of this unique heritage development project with our immersive real estate marketing tech. These beautifully designed spaces were a joy to visualize and it has been an absolute pleasure to work with you and your passionate team to make it come to life. We truly look forward building several next generation applications together.",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-21 21:11:52.436699",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110554797469678962022/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBd0lETkNBEAE",
            "reviewer_name": "Matthew Alexander",
            "rating": 5,
            "review_text": "Dogu and his team have been a pleasure to work with, this emergent technology is changing so quickly so trust was paramount, I am confident that the end product was both high quality and well priced. Really appreciate the extra work that went in to the final products. We used Stambol for their VR and then got some really great Renderings as well.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:52.439421",
            "response_from_owner_text": "Thank you for these very kind words and your trust in us, Matthew. We are always thrilled to work with you and your team and help showcase beautiful unique features of every property you develop.",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-21 21:11:52.439421",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100891723601959959202/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRM1plV2JnEAE",
            "reviewer_name": "Ardeshir Yeganegi",
            "rating": 5,
            "review_text": "Stambol s technology and concepts are game changers.  They worked very hard with our marketing team to ensure the project is delivered on time and with the anticipated results.  We intend to continue working with them on exploring other avenues of using their VR/AR tech.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:52.442069",
            "response_from_owner_text": "Thank you very much, Ardeshir. We are truly inspired by your vision and your pioneering work in using technology to showcase your projects. It is a true pleasure to work with you and your team and we look forward to creating magical activations together for the many years to come.",
            "response_from_owner_ago": "5 years ago",
            "response_from_owner_date": "2018-11-21 21:11:52.442069",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101450034493235486063/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMmRuSEpBEAE",
            "reviewer_name": "Matthew Jimmy James",
            "rating": 5,
            "review_text": "Stambol has been professional to work with and delivers a fantastic product.  They will be our go-to company moving forward.  Great experience.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:52.444823",
            "response_from_owner_text": "Thank you very much for the kindest words, Rachael. It has been an absolute pleasure to work with you and your team. We look forward to creating many exciting visualizations and applications and showcase unique aspects of your projects together.",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-21 21:11:52.444823",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115010885542445483545/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5aDVuMDN3RRAB",
            "reviewer_name": "Gss Raj kumar Raju#",
            "rating": 5,
            "review_text": "Nice",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-21 21:11:52.972620",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 42,
            "total_number_of_photos_by_reviewer": 38,
            "reviewer_url": "https://www.google.com/maps/contrib/113397643143144859630/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjaExMaTdBRRAB",
            "reviewer_name": "Matt Grant",
            "rating": 5,
            "review_text": "Dogu rules!!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-21 21:11:52.979357",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 948,
            "total_number_of_photos_by_reviewer": 3704,
            "reviewer_url": "https://www.google.com/maps/contrib/105326509518595027774/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDM1A3d0ZREAE",
            "reviewer_name": "oncel tuzel",
            "rating": 5,
            "review_text": "",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-21 21:11:52.984048",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": null,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "",
            "is_local_guide": null,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}