{
    "place_id": "ChIJZz-c-AlzhlQReKsBUjYSmOU",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGejZUbDNBRRAB",
            "reviewer_name": "Dianne Schoeman",
            "rating": 5,
            "review_text": "My husband and I had a very pleasant stay. Staff were very friendly and ensured we were happy with our room by texting us shortly after going up to our room.  Room was very clean. Bed beautifully made with quality sheets that had that freshly laundered feel. Bathroom was extremely clean. Lovely big shower. Highly recommend Hotel Belmont. We would definitely stay there again. Walkability: Close to restaurants.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-18 05:07:33.032810",
            "response_from_owner_text": "Dear Dianne, Thank you for choosing Hotel Belmont Vancouver MGallery! Were delighted to hear you and your husband enjoyed your stay. Its wonderful that our staffs friendliness and attention to detail, from the clean room to the quality sheets, made your experience memorable. We appreciate your recommendation and cant wait to welcome you back on your next visit! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.032810",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115604044275506796547/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsc2JUdXFnRRAB",
            "reviewer_name": "Deanne Gale",
            "rating": 5,
            "review_text": "Some say service standards these days are going backwards - well I would certainly say that is not the case at the Belmont. The service was outstanding. Each staff member that I interacted with were amazing, caring and very friendly. The hotel is in an exciting part of Vancouver with lots of nightlife, dining, etc. I loved the fun decor and attention to detail updating what looks to be an older building in Vancouver. I would stay again - and thank you to the incredible team working during my stay.",
            "published_at": "4 days ago",
            "published_at_date": "2023-11-21 05:07:33.038026",
            "response_from_owner_text": "Dear Deanne, Thank you so much for taking the time to share your wonderful experience at Hotel Belmont Vancouver MGallery! Were delighted to hear that you found our service outstanding and our team amazing, caring, and friendly. Its fantastic to know that you enjoyed our exciting location in Vancouver with its vibrant nightlife and dining options. We take pride in our attention to detail and the fun decor that breathes new life into our historic building. We cant wait to welcome you back, and a BIG thank you from the entire team for your kind words! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "17 minutes ago",
            "response_from_owner_date": "2023-11-25 04:50:33.038026",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111497774495235103881/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1OTRpNlVnEAE",
            "reviewer_name": "Ann",
            "rating": 5,
            "review_text": "We had the best experience at this hotel!! Every single detail was thought out -whether we needed to borrow an umbrella to walk to dinner or borrow bikes, they had it all. The kindest staff ever and always willing to go above and beyond (I wish I remembered specific names but honestly it was everyone)! So so accommodating and provided awesome recommendations. We also loved the access to the restaurant/bar and we didnt hear any music or noise from our room on the 5th floor. The room was spacious, clean and luxurious. We loved the cute details and decor in both the lobby and room. Not to mention the location was great and we were walking distance to all restaurants/activities we wanted to try. I could not recommend this hotel more!! We will be coming back and recommending to all of our friends.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:33.040449",
            "response_from_owner_text": "Dear Ann, Wow! Your review made our day! Were absolutely thrilled to hear about your amazing experience at our hotel. Its fantastic to know that every detail contributed to making your stay special. Our team takes great pride in going the extra mile, and were overjoyed to have met your expectations. Were delighted you found our staff accommodating and enjoyed the recommendations. Its fantastic to hear that you found the room luxurious, clean, and loved the little details in both the room and lobby. Your kind words mean the world to us, and we cant wait to welcome you back and host your friends too! Thank you for recommending us! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.040449",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103595769322434281857/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ3VtaExBEAE",
            "reviewer_name": "Sadana Simran",
            "rating": 5,
            "review_text": "I had during my recent stay at your hotel. My stay was truly memorable, and I felt compelled to share my positive feedback. From the moment I entered the lobby, I was impressed by the warm and welcoming atmosphere. The check-in process was smooth, and your staff members were not only professional but also incredibly friendly. Their attention to detail and commitment to guest satisfaction were evident throughout my entire stay. The room I stayed in exceeded my expectations in every way. The cleanliness, modern amenities, and thoughtful touches in the room contributed to a comfortable and enjoyable stay. The attention to detail in the rooms design and furnishings did not go unnoticed, and I felt like every aspect of my comfort had been considered. I would also like to commend your team for their excellent customer service. They were always ready to assist with any inquiries and went above and beyond to ensure that my needs were met promptly and with a smile. Overall, my experience at your hotel was outstanding, and I will certainly recommend it to friends, family, and colleagues. Thank you for providing such a wonderful environment and for your commitment to excellence. I look forward to the opportunity to stay at your hotel. Regards, Simran Sadana",
            "published_at": "a week ago",
            "published_at_date": "2023-11-18 05:07:33.043156",
            "response_from_owner_text": "Dear Simran, Thank you for the glowing 5-star review! Were thrilled that you had a memorable stay and appreciated our warm atmosphere, smooth check-in, and friendly staff. Its fantastic to hear that your room exceeded expectations and that you enjoyed the thoughtful touches. We greatly appreciate your commendation of our teams customer service. Your recommendation to friends, family, and colleagues is the highest compliment. We cant wait to welcome you back for another outstanding experience. Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.043156",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118433887920136053411/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aHBIMG5nRRAB",
            "reviewer_name": "Kendra Harrington",
            "rating": 5,
            "review_text": "Was located in a great location downtown, very clean and well decorated which made the stay quite enjoyable! Lobby smelled quite strongly of perfume, but otherwise the stay was very good. Wish we had been  back during the right hours for the complimentary drinks but that was cool to receive!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:33.045948",
            "response_from_owner_text": "Dear Kendra, Thank you for your fantastic review! Were thrilled you found our downtown location, cleanliness, and decor enjoyable. We appreciate your feedback about the lobbys scent, and well certainly look into it. Its great to hear you liked the complimentary drinks, and we hope youll have the chance to enjoy them during your next visit. We cant wait to welcome you back for another great stay! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.045948",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118292236519497275878/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseXVpY2l3RRAB",
            "reviewer_name": "Feet Banks",
            "rating": 5,
            "review_text": "The hotel was amazing. so visually fun and clean and great! the staff from the front desk to the restaurant/bar were all exceptional. 10/10 recommend this hotel.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-18 05:07:33.049100",
            "response_from_owner_text": "Dear Feet Banks, Thank you so much for taking the time to share your delightful 5-star review! We are thrilled to hear that you found our hotel amazing, fun, and clean. It warms our hearts to know that our staff, from the front desk to the restaurant and bar, exceeded your expectations. Providing exceptional service is at the core of what we do, and were delighted to hear we hit the mark during your stay. Your recommendation means the world to us, and were grateful for your kind words. We hope to welcome you back to our hotel in the near future for another exceptional experience. Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.049100",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111713285384507193429/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcW9leUp3EAE",
            "reviewer_name": "Martin Lewton",
            "rating": 5,
            "review_text": "Really enjoyed my stay at the Belmont. Room was spacious with interesting decor, a super comfy bed and and a great shower. Staff were so friendly and courteous. Located close to public transportation.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-11 05:07:33.052507",
            "response_from_owner_text": "Dear Martin, Thank you for your kind words! Were thrilled you enjoyed your stay at Hotel Belmont Vancouver MGallery. Our team takes pride in ensuring a comfortable and welcoming experience. Delighted to hear you loved the spacious room, unique decor, and especially the heavenly shower! Looking forward to your next visit for more comfort and a warm welcome! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-11 05:07:33.052507",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114725126148441948033/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMnNIYmFREAE",
            "reviewer_name": "Joseph Hildred",
            "rating": 5,
            "review_text": "Look, its a very comfortable and clean hotel for the price and staff were very accommodating and helpful.  Its just on the fringe of the CBD, and there is a bit of a seedy underbelly that gets around at night... a bit like Sydneys Kings Cross or Fortitude Valley in Brisbane. We NEVER felt threatened, though, and Id stay here again for the proximity to everything.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:33.055280",
            "response_from_owner_text": "Dear Joseph, Thank you for your fantastic review! Were delighted to hear that you found our hotel comfortable and clean, and that our staff provided excellent service. We appreciate your insights about the location and the surrounding area. Were glad you felt safe, and we look forward to welcoming you back for your next stay, with all the conveniences of proximity to everything! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.055280",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 50,
            "total_number_of_photos_by_reviewer": 14,
            "reviewer_url": "https://www.google.com/maps/contrib/106198301903548212824/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1Z3Y3Y1p3EAE",
            "reviewer_name": "Preetika Sachdeva",
            "rating": 5,
            "review_text": "The staff was very quick in responding to my queries. They are very helpful. You can just send a quick text message to front desk and they respond very quickly. The room was very nice and clean. I would definitely come back.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:33.057676",
            "response_from_owner_text": "Dear Preetike, Thank you for the fantastic review! Were delighted to hear about your positive experience with our staff and the quick response to your queries. Its great to know you found the room nice and clean. We appreciate your kind words and look forward to welcoming you back for another enjoyable stay! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.057676",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109505420289141440774/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1aGZ1LUJ3EAE",
            "reviewer_name": "Amanda Laturnus",
            "rating": 5,
            "review_text": "We would have liked to have a mini fridge and air conditioning would have been a bonus. Our room was cute, and clean. Staff were extremely friendly and fun ! Very attentive.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:33.060369",
            "response_from_owner_text": "Dear Amanda, Thank you for your excellent review! Were delighted to hear that you found your room cute and clean and that our staff was friendly and attentive. We appreciate your feedback about the mini fridge and air conditioning. We do offer air conditioning in all our rooms, and some of our room categories come with a small fridge. For your next stay, please dont hesitate to inquire about the room options that best meet your preferences. We cant wait to host you again and ensure your next visit is even more enjoyable! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.060369",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115689684647832547170/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdE1lcWNREAE",
            "reviewer_name": "Dave Hanley",
            "rating": 5,
            "review_text": "We had a last minute unplanned need to stay at the hotel and they were totally agreeable.  The staff went out of their way to look after our extensive needs.  The  three people at the front desk, especially Gabriel went above and beyond to look after us.  Thank you so much for all the support when we really needed it.  I would highly recommend this place.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-25 05:07:33.654128",
            "response_from_owner_text": "Thank you for your review! we will definitely share your feedback with the team, particularly Gabriel!",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-25 05:07:33.654128",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103233559326504684309/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadVpudjBnRRAB",
            "reviewer_name": "Camila P",
            "rating": 5,
            "review_text": "It was a good stay, well served. Gabriel was very kind and helped us during our stay. The hotel offered bike to go around. The experience was amazing.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:33.658781",
            "response_from_owner_text": "Dear Camila, Thank you for the fantastic review! Were delighted to hear that you had a good stay and that Gabriels kindness and assistance made your visit even better. Its great that you enjoyed the option of using our bikes to explore. We appreciate your kind words and look forward to providing you with another amazing experience during your next stay Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.658781",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117694154361254680895/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGOWJqcElREAE",
            "reviewer_name": "Hannah Olmstead",
            "rating": 5,
            "review_text": "Great hotel. Clean comfortable and really unique. It is well priced and a great location with helpful staff. The restaurant and bar were excellent.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-04 05:07:33.674316",
            "response_from_owner_text": "Dear Hannah, Thank you for the fantastic review! Were thrilled to hear that you enjoyed our unique and comfortable accommodations. Our team takes pride in providing helpful service, and were glad our location worked well for you. Delighted you loved The Living Room, our restaurant and bar as well. We cant wait to welcome you back for another wonderful experience! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.674316",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102969629071815574036/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbXZPZEVBEAE",
            "reviewer_name": "Di Mason",
            "rating": 5,
            "review_text": "The Hotel Belmont was a welcome haven. The staff were very friendly and helpful and the room comfortable. Its in a great, central location, a short walk from Vancouver City Center Metro station (an easy 30 mins ride from the airport) and some great restaurants Walkability: Central location. Short walk to City Metro station and restaurants. About a 20 min walk down to Canada Place for spectacular views of the harbor",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-11 05:07:33.677250",
            "response_from_owner_text": "Dear Di, Thank you for sharing your experience at Hotel Belmont MGallery! Were thrilled to hear that you found comfort in our haven and that our friendly staff made your stay special. Our central location near the Vancouver City Center Metro station truly offers convenience and easy access to the citys attractions and dining spots. Were delighted you had a great time, and we hope to welcome you back for more memorable experiences! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-11 05:07:33.677250",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100064638459148434616/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eU9MWXRBRRAB",
            "reviewer_name": "Marisol Iniguez",
            "rating": 5,
            "review_text": "First time visiting Vancouver. Picked it based on the location to the cruise portal. Very close to walk so highly recommend especially because boarding day is hectic with traffic. The hotel staff was AMAZING always went above and beyond to ask me how they can improve my stay. Staff was incredibly nice and helpful. The breakfast I highly recommend getting with your stay there. Breakfast was delicious and had a nice spread. If you on the go they provide take out containers as well. The bar downstairs was fun and chic. Love the location and highly recommend the hotel. FYI there s this fun taco place I think called the pawn shop, just a couple building down with great all day happy hour! Drug store, grocery store, post office, and great shopping area in the nearby location.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-25 05:07:33.680477",
            "response_from_owner_text": "Thank you for your positive review! We will definitely share this with our team! We strive to offer all our guests a great experience.",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-25 05:07:33.680477",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/100250839178634304691/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMjdLQ1BnEAE",
            "reviewer_name": "Judd Hards",
            "rating": 5,
            "review_text": "Couldnt have asked for a better place to stay.  It was clean, decor was cool and the staff were super helpful.  It was close to everything.  We would stay there again without question.  Thank you, Hotel Belmont. Rooms: Clean and nice! Nearby activities: Went to see Tool.  Rogers center was 20 min walk.  Perfect! Walkability: I blew up my step counter.  Perfect!  You could walk, or subway/SkyTrain anywhere faster than any car, I promise you. Food & drinks: Free drinks were a plus!",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-04 05:07:33.683866",
            "response_from_owner_text": "Dear Judd, Thank you for your fantastic review! Were thrilled to have exceeded your expectations during your stay at Hotel Belmont Vancouver MGallery. Its wonderful to hear that you found the place clean, loved the cool decor, and experienced our super helpful staff. Were delighted that our central location added to your convenience. We cant wait to welcome you back for another amazing stay. Thank you for choosing us! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-11 05:07:33.683866",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/108508996697905468706/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cWVhVWx3RRAB",
            "reviewer_name": "Stephanie LeBouthillier",
            "rating": 5,
            "review_text": "Such a cute hotel! The staff is super friendly and the hotel is very clean. Location is within walking distance of many shops and restaurants.",
            "published_at": "4 weeks ago",
            "published_at_date": "2023-10-28 05:07:33.694083",
            "response_from_owner_text": "Dear Stephanie, Thank you for the lovely review! Were thrilled you found our hotel cute and enjoyed our friendly staff. Its great to hear that our cleanliness and convenient location added to your stay. We appreciate your kind words and look forward to your next visit for more delightful experiences! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.694083",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113622239828705778068/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOWRiNjVnRRAB",
            "reviewer_name": "Anthea Williams",
            "rating": 5,
            "review_text": "Amazing vibes, delicious food, epic drinks. Happy hour is a steal. Come see downtown and enjoy the vibes",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-11 05:07:33.698376",
            "response_from_owner_text": "Dear Anthea, Thank you for the fantastic review! Were thrilled you enjoyed our vibes, delicious food, and epic drinks during Happy Hour. Downtown is always buzzing, and were delighted you were part of it. Looking forward to your next visit for more great times and amazing vibes! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-11 05:07:33.698376",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 102,
            "total_number_of_photos_by_reviewer": 59,
            "reviewer_url": "https://www.google.com/maps/contrib/103272997162752813635/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aTY3YjZRRRAB",
            "reviewer_name": "Steven Snidal",
            "rating": 5,
            "review_text": "Had a great stay here for one night the hotel is super cute and for the price one of the cheapest in the city the rooms are nice but small bath room was super cute but no fan. The only complaint I had was that the rooms had a bit of a musky smell and it may have been coming from the pipes in the bathroom. Only other small issue was me asking if I could borrow a bike they said yes I came down filled out the paperwork and then once I did all the paperwork they told me they a chilly didnt have a bike fore me to use... All in all id definitely come back. Rooms: Rooms are small but nice had a bit of a weird smell Nearby activities: Lots of restaurants and bars close by Walkability: Good location to all things downtown",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-25 05:07:33.702693",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 125,
            "total_number_of_photos_by_reviewer": 279,
            "reviewer_url": "https://www.google.com/maps/contrib/111735816109390603888/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NVBYZk1REAE",
            "reviewer_name": "Let's Go DoDo! (None)",
            "rating": 5,
            "review_text": "I wanted to check in early and my associate was able to figure out a way of doing that with my membership. She was proactive and offering this and it was very helpful.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:33.705899",
            "response_from_owner_text": "Dear Lets Go DoDo!, Thank you for sharing your experience! Were glad we could assist in arranging an early check-in using your membership. Were committed to finding solutions that enhance your stay. Your feedback is appreciated, and were looking forward to welcoming you back for more proactive and helpful service! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:33.705899",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 158,
            "total_number_of_photos_by_reviewer": 230,
            "reviewer_url": "https://www.google.com/maps/contrib/113030673542083461350/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSN0xicmF3EAE",
            "reviewer_name": "Volodymyr Vrublevskyy",
            "rating": 5,
            "review_text": "Everything was perfect. It exceeded my expectations :) I can recommend this hotel to anyone. Nice smell in the hallways, good rooms with coffee machine and TV with streaming from your cell phone, tasty breakfast and amazing location!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-25 05:07:34.231987",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 42,
            "total_number_of_photos_by_reviewer": 406,
            "reviewer_url": "https://www.google.com/maps/contrib/112357372416718975592/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMjkzSkZREAE",
            "reviewer_name": "Kali-olt Sedgemore",
            "rating": 5,
            "review_text": "Great hotel. Loved that they had the shampoo, conditioner and body wash in dispensers in the no diving shower The small bottles are never enough. The bed was really comfortable and the staff are really kind & if you need anything are just a text away instead of phoning",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-25 05:07:34.234735",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 50,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/104237216698698840812/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtclBPUmV3EAE",
            "reviewer_name": "Roseanna Chan",
            "rating": 5,
            "review_text": "Place is clean and lobby is modern. The room is a little cramped but the beds were comfortable and no issues with hot water or anything. Check in was smooth and easy. Just a 5-7 min walk from the train station if youre coming from the airport via train. Conveniently and centrally located. However it does get loud at night especially on the weekends you can hear the drunk people outside even from the top floor Walkability: Located in the city center its very close and easily walkable to key places if its your first visit.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:34.237253",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 131,
            "total_number_of_photos_by_reviewer": 886,
            "reviewer_url": "https://www.google.com/maps/contrib/116918014723631931815/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M2R6RmdBRRAB",
            "reviewer_name": "Chris Shepherd",
            "rating": 5,
            "review_text": "This was a great stay. Rooms are quirky with a nice touch of humour and adequate in size.Staff was excellent Wholeheartedly recommend this hotel and associated restaurant (Living Room) Rooms",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-25 05:07:34.239512",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 88,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/100693490868632184870/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoX2J5TDFRRRAB",
            "reviewer_name": "r Y",
            "rating": 5,
            "review_text": "Very good price for a hotel so new with such artistic designs and a location between downtown Vancouver and Yaletown, though the rooms and elevator may be small. The front desk did not charge any hidden fees and allowed us to use their fridge and microwave for no charge. Lived on the top floor and was not troubled at all by the bar downstairs. Would recommend for anyone visiting Downtown Vancouver.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-25 05:07:34.242185",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 37,
            "total_number_of_photos_by_reviewer": 92,
            "reviewer_url": "https://www.google.com/maps/contrib/110375561697904941058/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NGM3aGFnEAE",
            "reviewer_name": "Jude",
            "rating": 5,
            "review_text": "Certainly cramped, to the point of minor annoyance, but otherwise a pleasant stay. Theres some neat stuff in walking distance, but be sure to inform people of where youre headed and when you plan to return, and keep self defence on you if you can. Rooms: Very, very cramped. Storage was under-bed shelves, a small safe in the night stand, and an open faced wardrobe with 3 hangers in it. Cozy and well decorated, though.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-25 05:07:34.244137",
            "response_from_owner_text": "Thank you for sharing your experience at the hotel. Being a historical building from 1912, weve strived to keep the hotel original character and style throughout the building.",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-25 05:07:34.244137",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 39,
            "reviewer_url": "https://www.google.com/maps/contrib/118027504792732649953/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MnNycE5nEAE",
            "reviewer_name": "jamie brown",
            "rating": 5,
            "review_text": "So pleased with our stay here! We arrived from the states early on a Saturday, a few hours before check in time. We weren t expecting a room to be ready but we thought we would ask anyway and to our surprise they let us check in early! This hotel is so nice, the staff were all very welcoming. The bar/restaurant downstairs from the hotel was a great vibe, we ended up spending most our night down there! The room itself was very clean, very simple and just what we needed for a quick stay.  We will definitely book another room at this hotel next time we re in Vancouver!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:34.246628",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/113883275147103037011/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdGNfWVpREAE",
            "reviewer_name": "Eric Jason",
            "rating": 5,
            "review_text": "Room we got was different than what we saw online, but it was cool. Location is next to a couple hostels and clubs so it can get loud at night, but the Belmont has mitigated the sound issue with double windows. They also have the worlds smallest elevator! No complaints. We loved all the quirks!",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-25 05:07:34.248653",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 183,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/105051278950013801525/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoM1pmcGVREAE",
            "reviewer_name": "Cosmic",
            "rating": 5,
            "review_text": "Just an amazing stay at Hotel Belmont. The beds were just so damn comfy, no fridge, tho which was very annoying, but we ate out most nights anyway. Service was great the staff there were so nice. Being right in the middle of downtown vancouver was perfect too, right next to a nesters market, and 7 eleven made it super easy for quick food. Rooms: Comfiest beds ever",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-25 05:07:34.251112",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106595423577010753002/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcXZmeXZRRRAB",
            "reviewer_name": "Mike Funk",
            "rating": 5,
            "review_text": "My Wife and I loved our time at the hotel Belmont. Right from the beginning the staff went out of their way to ensure we were enjoying our stay and time in Vancouver. Whether it was offering directions or much needed forgotten toiletries they were always there with a friendly smile and expedient service. The Lobby gives an excellent preview of the decor, which is eclectic and lots of fun. Very untraditional and thats what made it so enjoyable. The  hotel house party idea first through us off, we are not party types and were concerned of the noise. We stayed on the 2nd floor and did not hear any noise during our stay related to the party. Frankly, if there was a party happening we were unaware. Thats how quiet it was. The living room is a fun place to have drinks and get some food. Decorated with some goofiness In mind its a very inviting space. Plenty to see and the food was delicious. The room itself was delightful, the design motif from the rest of the hotel continues into these rooms.  The no diving shower was a fun addition. Since no place is truly perfect I need to find something to put into a negative. That would be room size, we stayed in a double twin bed room and found it to be on the small side. Nothing to prevent any further desire to stay here and not something that should put off any potential other guests! Thank you Hotel Belmont staff for an amazing stay",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-25 05:07:34.253277",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 46,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/107459386605777971269/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodU9pQUx3EAE",
            "reviewer_name": "Yeh Karen",
            "rating": 5,
            "review_text": "Great location!  2 mins walk from a nice grocery store and quite a few nice cafe and restaurants within 10 mins walk.  The employees here are very friendly, helpful, and kind.  Room is clean and neat!  My friends and I really enjoy the stays here (we spent 3 nights) and will definitely recommend it to friends who plan to visit Vancouver!",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-25 05:07:34.813910",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 27,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/108003889764421926292/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOWZMd3pBRRAB",
            "reviewer_name": "Anurag Chaudhury",
            "rating": 5,
            "review_text": "A good hotel with polite staff. The rooms are very nice and stylish. I really appreciated the fact that we could cast to the TV in our room.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-25 05:07:34.818435",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 31,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/110338864575018255764/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoLXMyRzBBRRAB",
            "reviewer_name": "Vernon Chang",
            "rating": 5,
            "review_text": "I enjoyed my stay here at Hotel Belmont MGallery. Its funky, unique and has its own character. It transform an old Hotel into a new modern one. Friendly staff and room is clean, comfy beds, luv the bathroom design especially the No Diving white tiles in the shower area. I enjoy the shampoo, conditioner, shower gel and body lotion all have the minty refreshing feeling to it. Cool retro fridge. Fast complimentary WIFI internet service. The BEST part about this hotel is its location! Located right at the heart of the Downtown Vancouver core, close to the entertainment district. There are coffee shops, 7/11 convenience store, clubs, restos and bars. Walking distance to Hornby, Granville, Yaletown, Robson. Everything is so walkable that you dont even need to take a taxi/Uber, the amount of time & money you are saving. Before I stayed at this hotel, I was skeptical since so many Google reviews mentioned how noisy the streets and the areas are that they couldnt sleep. Occasionally, there are noise from outside but they are manageable and within reason. I was ok with it and had good sleeps. Listen, lets be rational and be reasonable here, you are staying in the entertainment/clubbing district, and you are complaining about excessive noise? You must be kidding me here. Name me a place around the world where you stay close to bars and clubs and you expect to hear nothing but crickets? I am just being realistic and being reasonable here. I found the hotel inside itself very quiet and calm, I had a good night sleep. What I look for when I stay at this hotel is its prime location that is close to everything.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-25 05:07:34.822971",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 282,
            "total_number_of_photos_by_reviewer": 13122,
            "reviewer_url": "https://www.google.com/maps/contrib/113299646947651900305/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbnRHYUtBEAE",
            "reviewer_name": "Nadia Moretto",
            "rating": 5,
            "review_text": "My girlfriend and I, stayed here 2 weeks ago and the staff were all amazing! So accommodating and friendly!! Nice, clean room, breakfast was fabulous    I want to give a big shout out to Christian who is always eager to help, and  Alex who totally went above and beyond! Would definitely stay here again! Darlene Poholka and Nadia Moretto",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:34.826942",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/115645562692197512188/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1akotaWlnRRAB",
            "reviewer_name": "James Haley",
            "rating": 5,
            "review_text": "Wow this is a treasure. Fit out is fun and vibrant.  Service was great. Love the theme throughout and all the extras in the decor.  After 4 weeks abroad, this ear the last stay for our family and it was a most fun and enjoyable final hotel. I rate this hotel highly.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:34.830830",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 84,
            "total_number_of_photos_by_reviewer": 13,
            "reviewer_url": "https://www.google.com/maps/contrib/109058547231754094878/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaME9HMnFBRRAB",
            "reviewer_name": "Gearin K",
            "rating": 5,
            "review_text": "In this hotel they have Aquaman working at the front desk. Super hotel and super staff, 100% recommended!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-25 05:07:34.835732",
            "response_from_owner_text": "Dear Gearin, Thank you so much for your fantastic 10/10 review! Were thrilled to hear that you had such a super experience at our hotel. Were proud to have our own Aquaman at the front desk, ensuring that every guest receives superhero-level service. Its always our goal to make each stay memorable, and were delighted to know we hit the mark with you. Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:34.835732",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/100976766039131016820/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybDZiZXVBRRAB",
            "reviewer_name": "Karen Johnson-Young",
            "rating": 5,
            "review_text": "We booked this hotel before our Alaska cruise. The decor is eclectic and funky. The front desk staff are very friendly and it is super clean. Our room was modern. The bed, bedding and pillows were awesome. The funky decor extends to the room which had a fridge with the door resembling a guitar amplifier. The only downside is there are steps to enter from the street. I would return the next time I am in Vancouver.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:34.841225",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 28,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100864908091197612058/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeEt2QkZBEAE",
            "reviewer_name": "Jessica Lamothe",
            "rating": 5,
            "review_text": "They take us after our flight got cancel. Everyone was really welcoming, they take care of us very well. The hotel is really beautiful, room are clean and confortable. A really nice discovery! Beautiful place if you want to be in the action of the city! Thanks you very much to Simon and his staff! We will come back for sure!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:34.844555",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112276436553273978325/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOEx6Wmd3RRAB",
            "reviewer_name": "Jaime Slapkus",
            "rating": 5,
            "review_text": "This hotel is wonderful! Super friendly and helpful staff.  Very clean rooms.  Neighborhood seems a little iffy, but tons of walkable restaurants, bars and entertainment . Rooms are very quiet despite the club and people on the street below.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:34.848109",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/107900720629339501288/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbi1hT01nEAE",
            "reviewer_name": "Yannick S.",
            "rating": 5,
            "review_text": "Located very central, a lot of areas like Gastown, Chinatown etc can be reached by 15-20 min walk. Not the cheapest hotel, also not the most modern one, but good in general, nice staff, breakfast was good, nice bar. Neighborhood is ok, parking lot has to be paid but thats normal for any hotel. All in all a good experience for us. Rooms are a little bit small, no fridge inside, but still fine. Bed also a little bit small, but acceptable. Room walls are a little bit thin, but still acceptable. Pricing could be a little bit lower",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:34.853048",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 141,
            "total_number_of_photos_by_reviewer": 687,
            "reviewer_url": "https://www.google.com/maps/contrib/103852044962058441906/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcVBHN05nEAE",
            "reviewer_name": "Aryn LaBane",
            "rating": 5,
            "review_text": "We took a girls trip for the weekend, and Ava was absolutely the best bartender I have ever had. She made our stay 100x better. Plus she was hot. Definitely recommend coming here!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:35.686788",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100320376315937797520/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5OWZTWmNnEAE",
            "reviewer_name": "Gurpreet Cheema",
            "rating": 5,
            "review_text": "Stayed a night here and I was pleasantly surprised at the charm of this Hotel. It is located in the heart of the city, and many great food options are within walking distance. If you fancy some adventure, you are only a short distance from many historic sites with lots of opportunities to learn more about the culture of the city. The hotel itself also has an arcade in the basement and a secure/safe lobby with internet/computer access. The room we stayed in was very well kept, clean, and comfortable. This room featured a king size bed, which was perfect, and a cheeky shower that stated there was to be No Diving. All in all it was a great experience, and Id definitely do it again!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:35.689144",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 80,
            "total_number_of_photos_by_reviewer": 29,
            "reviewer_url": "https://www.google.com/maps/contrib/118259448058434652725/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bHZEMzJnRRAB",
            "reviewer_name": "Mohamed Ibrahim Mohamed Artham",
            "rating": 5,
            "review_text": "Perfect location to walk around downtown. Hotel staffs were friendly and welcoming. Room was lovely and comfortable,  loved the showers in the room. Room came with 15% discount for Room service from the living room restaurant. Overnight parking available by the street which is around $23++ per night. Overall lovely stay and not everyday you will bump into a superhero while walking around the city.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:35.691291",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 39,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/102808062993694443172/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDX05TRHhRRRAB",
            "reviewer_name": "Ly N",
            "rating": 5,
            "review_text": "Love how the owners updated this hotel. Its cute on the outside as well as inside. Cool vibe and hip room. Super clean. The walls are thick and little noise gets through which as great for a light sleeper like me. I like the Keurig coffee maker and the drink options in my room. Jeff and Claudio gave me above and beyond great customer service. For the price point, quality and how centrally located this hotel is...I highly recommend it. The restaurant downstairs has yummy options and you are also surrounded by many other restaurants in the area. Its also safe walking around this neighbourhood. As a female who weighs just over 100lbs...I felt safe:)",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:35.693405",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 102,
            "total_number_of_photos_by_reviewer": 1751,
            "reviewer_url": "https://www.google.com/maps/contrib/109736009456278941287/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKenJLbEF3EAE",
            "reviewer_name": "Cooki W",
            "rating": 5,
            "review_text": "Amin is very helpful and friendly. Great location, clean room, and convenient parking lot.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-25 05:07:35.695306",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 40,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/109404668764223680096/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NHY2aHNBRRAB",
            "reviewer_name": "L Perez",
            "rating": 5,
            "review_text": "Centrally located to various attractions. Booked through Expedia. Nearby activities: Museum, Granville Island, Parq Casino and good eateries close by, ex: Nero s and Templeton. Rooms : 5/5 |",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:35.697688",
            "response_from_owner_text": "Dear L, Thank you for the wonderful review! Were thrilled you found our location convenient for exploring various attractions. Booking directly with us offers added benefits and exclusive perks, ensuring an even more delightful stay. Wed love to host you again and provide you with additional incentives when you book directly. Looking forward to your next visit! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:35.697688",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116398707719261616745/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": "Rooms",
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDX1pqa2F3EAE",
            "reviewer_name": "Hanna Gry",
            "rating": 5,
            "review_text": "I really enjoyed my stay. The hotel isn t new, but very nicely renovated. Very modern. Specially liked bathroom design and Marshall mini bar fridge. Bathroom amenities...shampoo, conditioner, gel  one of the best I ever seen in the hotels. Can t recall the brand, but it has mint flavour...very refreshing. Pillows and mattress super comfy as well. I don t remember when was the last time I slept so deeply. They have great restaurant downstairs as well. The only disadvantage it might be, on Saturday night this street gets really loud with clubs and restaurants. Staff was amazing.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:35.700359",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 77,
            "total_number_of_photos_by_reviewer": 219,
            "reviewer_url": "https://www.google.com/maps/contrib/113763667335138570627/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydnItNmNnEAE",
            "reviewer_name": "Steve Xoumph",
            "rating": 5,
            "review_text": "When it comes to hospitality, cleanliness and professional staff 5 stars isnt enough. We stayed for 6 nights and above and beyond to the best of their abilities is an accurate description of this hotel. The room size was fair considering their definite competitive price and the modern shower was top notch. I personally would of liked a mini fridge in the room but given half of the vancover experience is food and drink we ended up not necessarily needing one. The bar theyre connected to turns into a nightclub essentially on the weekend so if youre planning on staying over the weekend I would suggest a room 2nd floor or higher, we were situated on the 2nd floor and we have no complaints. And In my opinion a family stay would be better off outside of downtown vancover to begin with. This is a great place we would recommend and we will stay again",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:35.702207",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110648807142834509376/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd3BUeW9BRRAB",
            "reviewer_name": "Ally Davis",
            "rating": 5,
            "review_text": "Almost all staff was super helpful and very nice. Good location. Can roam the street up and down for hours. Tattoo shops surround it.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-25 05:07:35.704196",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": 32,
            "reviewer_url": "https://www.google.com/maps/contrib/115621776547307889275/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2Zy1DRVJREAE",
            "reviewer_name": "Akingboye Morakinyo",
            "rating": 5,
            "review_text": "Was at this hotel for 2 nights. Great location as its close to the various bars and nightclubs on Granville St. Room was small but the beds were super comfortable and the washrooms had umlimited amounts of soap and shampoo. The price was also affordable as well. Enjoyed my stay here. Also had a good time at the bar below.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:35.706894",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/107983811607483871542/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDZ3VueUhnEAE",
            "reviewer_name": "Laarni",
            "rating": 5,
            "review_text": "The rooms are cozy, a little small but thats fine since youre gonna be out most of the day. The interiors are sooo beautiful! Theyre also really clean which is very very important. Check-ins and check-outs are contactless- their new protocol because of covid. The location is right in the heart of Granville St, which means it can get loud when your windows are open but otherwise it feels like an oasis when theyre shut. You wouldnt even know how crazy loud it is down there if you didnt look out the window. They also have an amazing bar. The renovations in this building from what it was before is totally jaw-dropping! If you drive and need to park your car, there is a fee of $30/night. So thats something to also really think about since it racks up the price per room. We ended up finding another parking space thats cheaper.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:36.263389",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 19,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/100031572689657000412/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCLVlHWDlBRRAB",
            "reviewer_name": "christopher Limon",
            "rating": 5,
            "review_text": "Ava made my experience and my first time to Canada one to remember very welcoming, inviting informative and added to the whole vibe of the restaurant will definitely be back. And knowing that her favorite color is yellow is amazing.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-25 05:07:36.265464",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/107357630926435199083/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcC1HdVNnEAE",
            "reviewer_name": "Lindsay Moorhouse",
            "rating": 5,
            "review_text": "beautiful interior decor, i wish the hotel i worked at, was updated like this, we could really use some help lol, all safe was helpful as a former housekeeper of 9yrs it was all very clean.. will def stay again, hoping for our birthdays in december",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:36.267767",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100663087751963600571/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzeTR1NmtnRRAB",
            "reviewer_name": "Alain Bovet",
            "rating": 5,
            "review_text": "Great boutique style hotel on the main strip. Nice bar downstairs with just-right service and ambiance. I was staying on business and it was just great. Room is perfect size with amenities. I would add a few plugs at the desk but definitely not a deal killer. Deco is really nice too.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:36.270108",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/104275474250069149675/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacmEtUVl3EAE",
            "reviewer_name": "Travis Riggin",
            "rating": 5,
            "review_text": "Perfect place for downtown Vancouver. Close to everything. You will not be disappointed here.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-25 05:07:36.272510",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 47,
            "reviewer_url": "https://www.google.com/maps/contrib/110682809458071941243/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMweU1EX3l3RRAB",
            "reviewer_name": "Mike Gnitecki",
            "rating": 5,
            "review_text": "I realize that the reviews on this hotel are mixed, but the hotel is pretty good. Though slightly small, the rooms are very modern. There are also plenty of power outlets. The toiletries are of high quality. This is one of those hotels that surprises you. Its not a luxury 5-star hotel, but its better than you would expect. I recommend it.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:36.275022",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 120,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/104990178001354288208/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxd1pUclBREAE",
            "reviewer_name": "Karsten Lee",
            "rating": 5,
            "review_text": "Have stayed here twice, both times great experience. Recently renovated, modern interior and clean rooms. Would stay again. Easy check in / check out and as the rooms are slightly smaller than a typical hotel room it is also cheaper for the great central location.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:36.276997",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 88,
            "reviewer_url": "https://www.google.com/maps/contrib/108007800477978544395/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMFBuOTF3RRAB",
            "reviewer_name": "James Adams",
            "rating": 5,
            "review_text": "Its a great clean hotel, spacious and comfortable. Staff are very friendly and helpful. You have to pay for parking but they make a plan to accommodate you. WiFi is free and unlimited, does not seem to have issues connecting. The beds are really comfortable, TV is a big flat screen. Free TV and coffee facilities in the lobby. The location is great, very central. Overall an excellent hotel to stay at, would definitely come back.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:36.279066",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110987644533896339197/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzLUthV1NBEAE",
            "reviewer_name": "Sameer L",
            "rating": 5,
            "review_text": "Had a great stay here just before new years. Staff was very helpful at the front and very pleasant. Decor was vibrant throughout the hotel. Great location nearby many restaurants and bars in the heart of downtown. Rooms are smaller than usual but its not tight inside of the room and you are given more than enough space. Great place to spend the night in downtown Vancouver. Highly recommend.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:36.280892",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 133,
            "total_number_of_photos_by_reviewer": 41,
            "reviewer_url": "https://www.google.com/maps/contrib/101748167046025893663/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzeXYtUzdBRRAB",
            "reviewer_name": "Mel G",
            "rating": 5,
            "review_text": "Chic boutique hotel with beautiful decor. Clean rooms and exceptional friendly service. Beds were super comfortable and the body and hair wash products provided were great! Located in the heart of entertainment district, so generally a very young crowd around the hotel. Bonus that guests are able to go into Living Room and Basement [bar/club] through the hotel! Our room was on the 5th floor and was super quiet. Cons: - The breakfast buffet offered at $15 pp is basically just cereal, ham and coffee. - Key card needed to get into hotel after hours, which is great, but the doors stay open way too long allowing people to come in some time after you [and they did] - not the greatest area to have this happen",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:36.282981",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100940806203289164326/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDOHQyS1pREAE",
            "reviewer_name": "Karishma Mohamed Hussain",
            "rating": 5,
            "review_text": "Stayed here for 10 days and we loved everything. Absolute value for money and the best you can get in this price range. Modern, chic boutique hotel with  every detail carefully thought through from the shampoo to the shower to makeup remover wipes. Coffee machine was also great. Staff is extremely friendly",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:36.807275",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 32,
            "total_number_of_photos_by_reviewer": 48,
            "reviewer_url": "https://www.google.com/maps/contrib/116267948219202938880/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTX29lX3FnRRAB",
            "reviewer_name": "Christelle Sotelo",
            "rating": 5,
            "review_text": "Accessible from sky train, surrounded with many restaurants and even small convenient stores. We got a big room with 2 queen size bed and a pull out couch. Looks and feels clean. Bathroom is decent size but very updated. Decor is modern.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:36.809295",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/115122820842902491659/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NFpPZVpnEAE",
            "reviewer_name": "Human Kambakhsh",
            "rating": 5,
            "review_text": "Excellent customer service, very clean room, I asked for an electric kettle which the hotel ordered. Security is very good and things like in room safe deposit and the availability of Google Chromecast devices where you can stream your own programs to the tv is very well thought. Also the presence of an electronic information pad is unique and very welcoming. Overall : very pleased",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:36.811385",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 122,
            "total_number_of_photos_by_reviewer": 255,
            "reviewer_url": "https://www.google.com/maps/contrib/111071869049824557674/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNUlQZ2h3RRAB",
            "reviewer_name": "Coleen Pieters",
            "rating": 5,
            "review_text": "Great location. Within walking distance to alot of places. Stayed here for 2 nights and the staff are all friendly. We got discount coupons for the aquarium from the front desk which was pretty cool. The buffet breakfast is pretty decent as well. Would definitely stay here again.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:36.813276",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 128,
            "total_number_of_photos_by_reviewer": 307,
            "reviewer_url": "https://www.google.com/maps/contrib/103214698102349662221/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdVBmRU93EAE",
            "reviewer_name": "Anthony Towns",
            "rating": 5,
            "review_text": "Nice boutique hotel and reasonably priced compare to other Accor hotels in Vancouver.  Rooms are very clean and well appointed.  The Living Room is the perfect vibe to chill with my friends in town.  Will visit again soon.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:36.815364",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117339602201262706882/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MHBYQW1RRRAB",
            "reviewer_name": "Damaris Niziol",
            "rating": 5,
            "review_text": "I stay at Hotel Belmont every time I am in Vancouver and I can t get enough! It is so so wonderfully renovated - the room and the washroom are so chic and modern - I am obsessed! It s always up to the highest of standards, super clean, and the staff are very friendly! I ve always had such an incredible experience! Definitely recommend 100% to everyone :)",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:36.817599",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110963896158708289632/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNG82dWJBEAE",
            "reviewer_name": "Dansesouslesetoiles",
            "rating": 5,
            "review_text": "My dad and I had an excellent stay at the Comfort Inn downtown. The location cannot be beat. Parking is perfect alongside the building, cheap for this city at $14/night, and self-park in/out. The room was clean, simple, and small, but it had comfortable beds and a nice view of the city by night. We needed a place for a hot shower, a good nights sleep, and a chance to catch the evening news. Breakfast is free through the hotels pub and is filling and complete. I had seen many reviews about small rooms, loudness, or bed bugs, and decided to take a gamble. I found all of that to be unfounded with the exception of the rooms being small. If you are really going on vacation to see the city though, they have plenty of space to set down a suitcase, write a letter/postcard at your desk and store souvenirs. The value was unbeatable and the staff exceptionally friendly. This was our first stay, and it does appear that they have renovated the whole place in the last year or two.",
            "published_at": "11 years ago",
            "published_at_date": "2012-11-25 05:07:36.819589",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101552879181616062207/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTZ0lXSHZRRRAB",
            "reviewer_name": "Luke L'sk",
            "rating": 5,
            "review_text": "Had a nice dinner in this hotels restaurant, The Living Room. Quickly received complimentary beverage and snack after seated down for a short while. Standard masking and social distancing protocols were following accordingly based on the health orders Love the setting of the place, I couldnt stop looking around at the decor Menu via QR code, the drinks were interesting and the foods were great. Cozy and comfortable place to hang out with friends or date for a meal or snacks.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:36.821453",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 530,
            "total_number_of_photos_by_reviewer": 15027,
            "reviewer_url": "https://www.google.com/maps/contrib/117292505860511395536/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcUtubS1RRRAB",
            "reviewer_name": "Aselin Johns",
            "rating": 5,
            "review_text": "Never been to Canada before but the bartender at the living room, Ava, made me want to come back all the time! She was the best bartender i ve ever had and made our trip better than i could ve imagined, would definitely recommend coming to see her here!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:36.823492",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107857697292816734283/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaS1ESUdBEAE",
            "reviewer_name": "Elizabeth",
            "rating": 5,
            "review_text": "I had a great experience and hope to come back.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-25 05:07:36.825770",
            "response_from_owner_text": "Dear Elizabeth, Thank you for the wonderful review! Were thrilled to hear about your great experience. We cant wait to welcome you back for another fantastic stay! Hotel Belmont Vancouver MGallery",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-18 05:07:36.825770",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 37,
            "total_number_of_photos_by_reviewer": 26,
            "reviewer_url": "https://www.google.com/maps/contrib/101508569979121601749/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaDVxTGZ3EAE",
            "reviewer_name": "Victoria Greco",
            "rating": 5,
            "review_text": "The location of the place is perfect, it is close to everything. The staff were very friendly and the room was great. We would book a room here again in the future.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:37.467603",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/113827328241526366103/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcVBXSF9RRRAB",
            "reviewer_name": "Susan",
            "rating": 5,
            "review_text": "Cant beat the location, booked months in advance. Irish pub is connected to the hotel, breakfast was included in our rate. It was good  and constantly replenished. 402 and 502 were quiet rooms. Staff was very accommodating and professional. Tea, coffee,water, in lobby is a nice touch. Beds were comfortable and room was clean. Main strips all around, with main strip issues. Cabbies ripped us off, only go by what the meter says, dont fall for the short trip charge",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:37.469935",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 74,
            "total_number_of_photos_by_reviewer": 75,
            "reviewer_url": "https://www.google.com/maps/contrib/108008634507274455612/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eU42dWRnEAE",
            "reviewer_name": "Rebecca Suthervans",
            "rating": 5,
            "review_text": "We were sent to Hotel Belmont after our flight was delayed and the service was excellent, rooms were a good size, very clean and stylish. We had a short but great stay!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:37.471704",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/112442322973788283133/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncGVTUGpnRRAB",
            "reviewer_name": "Andrew Schram",
            "rating": 5,
            "review_text": "Room was nice and clean, although the view left a lot to be desired. Staff were friendly and helpful. Was very impressed by their honesty when wed left $100 in our room when we checked out and they held it at the front desk for us. We will stay there again for sure.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:37.473685",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105994600008243402052/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjeGFhcWV3EAE",
            "reviewer_name": "Michelle",
            "rating": 5,
            "review_text": "Honestly, I ve only ever stayed at one hotel that really stood out to me. This is now makes for number two. Hotel Belmont is a stand out for sure. What an outstanding place to stay. It s in a prime location, the vibes are unreal and the check in staff are delightful. The room was beyond anything I could have hoped for. The furniture was fun and funky. It really does have the coolest all around look and feel. We spent the evening at The Livingroom and The Basement. I now found my favourite places to enjoy a night downtown. What a great experience. I 100% recommended Hotel Belmont to anyone who is considering it. You will not regret it! ...I also had the best sleep of my life! I am in love with the comfy bed and I am still dreaming about the pillows!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:37.475793",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/101314133006867483252/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoN3NyTlBREAE",
            "reviewer_name": "pendar shams",
            "rating": 5,
            "review_text": "Good service and very nice room. Their shower is one of the most beautiful places I ve ever seen.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-25 05:07:37.477883",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 37,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112324847289284272155/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTb291VFBBEAE",
            "reviewer_name": "Sulaiman Saeed",
            "rating": 5,
            "review_text": "Very Nice place to stay , welcoming staff and great room service. We were a group of three and got 2 bed and sofa bed , comfortable pillow. Like the Kurag coffee machine with extra flavor they give you, Clean and fresh towels, like No diving sign in the washroom and the soap dispenser or something else. Definitely will go again if visiting Vancouver",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:37.479919",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 40,
            "total_number_of_photos_by_reviewer": 263,
            "reviewer_url": "https://www.google.com/maps/contrib/106992957621135767325/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnemF5YXBnRRAB",
            "reviewer_name": "Lauren Quirk",
            "rating": 5,
            "review_text": "Friendly staff, very helpful. Room was great and we got a complimentary upgrade as well. Very clean and great amenities. Small elevator so we had to take 2 trips with our stroller and bags but it was fine.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:37.481962",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/105938885548712459367/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhanJLXzRBRRAB",
            "reviewer_name": "Alex K",
            "rating": 5,
            "review_text": "We had a lovely stay, everything was perfect! We chose Belmont because it looked like the most modern hotel in Vancouver downtown, way above the other ones that are 4 and 5 stars but look like they havent renovated since the nineties.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:37.483951",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110816208892498767936/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNjUzOXJ3RRAB",
            "reviewer_name": "Sim Uppal",
            "rating": 5,
            "review_text": "Stayed for 3 nights on my own for a mini getaway. Really nice hotel with a funky vibe, definitely seems to be catered more towards a younger crowd. The hotel was very clean from what I saw. Since it was just myself, I got one of the cheaper rooms with one bed, cable TV, a mini fridge (a really cool looking one, might I add), a Keurig, amongst other complimentary items. Pretty much right in the heart of downtown, can easily get to anywhere in Vancouver fairly quickly by either walking or catching a bus/skytrain. I don t drive and so I spent most of my time walking around, finding new places to eat, and hanging out in the nearby parks/waterfronts. Overall, was a really enjoyable experience! I would definitely go stay there again. Best part is that they have room service, and two restaurants downstairs of the hotel for days you don t want to leave (which is much appreciated on rainy days) plus computers you can use in the lobby and arcade games",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:37.486247",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117080207640381245062/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aFBDZi1BRRAB",
            "reviewer_name": "Vicky Huang",
            "rating": 5,
            "review_text": "I really enjoyed the stay here and I was exited, nice hotel nice rooms design crazy cool, good and great price! Location is the only thing I was mmm... Doubt about it but if you are careful you can enjoy it as we did!! The mint soap shampoo and conditioner is the Thing we loved it!!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:37.997790",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 186,
            "total_number_of_photos_by_reviewer": 340,
            "reviewer_url": "https://www.google.com/maps/contrib/113260179873685512918/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5MWFiQjZ3RRAB",
            "reviewer_name": "Sheldon Cooke",
            "rating": 5,
            "review_text": "The guest services guide on the tablet is the lovely icing on the cake. And the included Chromecast that works when youre connected to the hotel wifi. The cake? Best Cake ever. Not bland or generic. Loaded right up with quirky uniqueness and personality Ive not seen elsewhere. Frankly, this is the way a hotel should be.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:37.999997",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 44,
            "total_number_of_photos_by_reviewer": 152,
            "reviewer_url": "https://www.google.com/maps/contrib/104260715990458637321/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXLW9qZTZBRRAB",
            "reviewer_name": "Mitchell Leitman",
            "rating": 5,
            "review_text": "Beautiful decor and super comfy beds. Our room was right on Granville, but generally very quiet. I strongly recommend staying here.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-25 05:07:38.001944",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/102558431870411613102/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndTZPd21BRRAB",
            "reviewer_name": "Steve Carter",
            "rating": 5,
            "review_text": "I was pleasantly surprised by our stay at the Comfort Inn. The area is central to the Granville hub where we were seeing a concert. It is a slightly dicey location unless you enjoy humanity at its worst. Regardless, the hotel contrasted the area. I was expecting a shabby run down hotel. The lobby is right next to Doolans pub which has happy hour $5 craft beer until 6pm. This worked out well. The elevator was out of service during our visit but the stairs helped burn off some beer calories and we got a great rate. I was worried about street noise. Again, no problem. We had a king bed in our room and selection of firm and soft pillows. It was amazingly comfortable. Probably the best hotel sleep I can recall. In this price range for the area of downtown, it would be very hard to beat. Parking is extra and breakfast is over priced, but the Wifi is free. There are dozens of breakfast options nearby and the parking rate is fair for the area. Staff were courteous and the hotel was well kept. Our bathroom had a jacuzzi tub and recent Reno. Very impressed with the value.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:38.004017",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 77,
            "total_number_of_photos_by_reviewer": 229,
            "reviewer_url": "https://www.google.com/maps/contrib/102213333291690097161/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRejhtUThBRRAB",
            "reviewer_name": "Maximiliano Quintanilla",
            "rating": 5,
            "review_text": "Wonderful hotel. Hidden gem in Granville street. Excellent location at an affordable price. Less than 2 blocks away from the Canada Line station. Very convenient if youre coming from the airport. Rooms were nice, beds comfy and the washroom was spotless. Try to book a room with breakfast included. It was a really good breakfast, which was served in the Irish pub thats next to the hotel (both places are connected by inside, so its not necessary to leave the building).",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:38.006059",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 80,
            "total_number_of_photos_by_reviewer": 25,
            "reviewer_url": "https://www.google.com/maps/contrib/111636575645914934628/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaTZXbElREAE",
            "reviewer_name": "Adam Skoreyko",
            "rating": 5,
            "review_text": "Well appointed, very modern rooms with all the little comforts to help you relax. Very stylish decor with great in room appointments. Not sure what else you would need since you should be spending your time outside in lovely Vancouver.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:38.007978",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 22,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106315646493776129309/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwNGVmaGxnRRAB",
            "reviewer_name": "Lucy Vargas",
            "rating": 5,
            "review_text": "Enjoyed my stay here! Modern, clean hotel. Rooms are slightly small but are definitely comfortable and clean! Staff was friendly and very helpful. Would stay here again and recommend it!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:38.010352",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/109758872057126534376/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxc3VfWmhRRRAB",
            "reviewer_name": "Gordon Currier",
            "rating": 5,
            "review_text": "Good pub/restaurant offering wide selection of food and drink. Hotel is staffed by super friendly knowledgeable staff who seem eager to assist. Reasonably priced rooms, of a good size.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:38.012394",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 152,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105211961892803342062/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnN2FTaUNREAE",
            "reviewer_name": "Alan Weir",
            "rating": 5,
            "review_text": "Absolutely fantastic. Well worth the cost. Lovely air conditioned rooms. Tons of amenities. Fantastic breakfast in the morning for $10 extra. And a free drink voucher to boot. Coffee and tea maker, large wall mounted flatscreen tv with plenty of channels. Huge amount of space in the room.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:38.014412",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/111603188167340913402/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneDR2ZEdnEAE",
            "reviewer_name": "Angie Williams",
            "rating": 5,
            "review_text": "Not the place for a quiet night but great location! Steps from Granville and busy nightclubs. My room had a comfortable king sized bed and a jet soaker tub in the updated bathroom. Would definitely stay there again if attending a concert or event.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-25 05:07:38.016484",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 50,
            "total_number_of_photos_by_reviewer": 74,
            "reviewer_url": "https://www.google.com/maps/contrib/107329882916014258184/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbTUzcTVBRRAB",
            "reviewer_name": "Melissa Procaccini",
            "rating": 5,
            "review_text": "Not much to look at from the outside, but inside is a different story! Weve stayed here several times and havent been disappointed. I recommend staying in a corner room. They are bigger and have jacuzzi tubs if you like that kind of thing. The location is great and centrally located downtown. Loved the atmosphere at Doolins Irish Pub, which is attached. Also, had a great time at the Belmont downstairs. We will definitely stay here whenever we come to Vancouver!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-25 05:07:38.557426",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 91,
            "total_number_of_photos_by_reviewer": 98,
            "reviewer_url": "https://www.google.com/maps/contrib/111653317728254935254/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodThYR1BnEAE",
            "reviewer_name": "Anthony Fuertes",
            "rating": 5,
            "review_text": "Excellent location.  Room was nice & the bar/restaurant was very good Nearby activities: Vogue theater, where our concet was at, was only a block away Walkability: Walked to concert at Vogue Theater Food & drinks: The restaurant & bar in the hotel was very good",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-25 05:07:38.559457",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105305288512832409024/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzOGQ2SDdnRRAB",
            "reviewer_name": "Kirsty Whyte",
            "rating": 5,
            "review_text": "My partner booked a surprise birthday staycation at the Hotel Belmont. We were upgraded upon arrival, and the room was fantastic. Very clean and comfortable. The shower was incredible. Cant wait to visit again.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:38.561629",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 66,
            "total_number_of_photos_by_reviewer": 265,
            "reviewer_url": "https://www.google.com/maps/contrib/109670869784192388346/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMl9QVW1RRRAB",
            "reviewer_name": "Genegie B",
            "rating": 5,
            "review_text": "A great pub that provides free breakfast buffet when staying at the comfort inn. It also provides a free drink during certain hours and the night life gets better. The food and beer selection were great, I recommend the wings, braised beef poutine and nachos. The service is great too and a convenient location for night life in the heart of downtown.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-25 05:07:38.564016",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 197,
            "total_number_of_photos_by_reviewer": 825,
            "reviewer_url": "https://www.google.com/maps/contrib/112031746556389987466/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKc1AzVjBnRRAB",
            "reviewer_name": "Sowmiya Baskar",
            "rating": 5,
            "review_text": "Very beautiful and neat superb restaurant food very good..",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-25 05:07:38.566027",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/102544350514567230162/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNOU5hOVhBEAE",
            "reviewer_name": "Darren",
            "rating": 5,
            "review_text": "Price location and staff were great. The Belmont is an old downtown hotel but all the rooms have had a major upgrade. The bar downstairs is fun as well. Would stay again and recommend for sure.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-25 05:07:38.568029",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 85,
            "total_number_of_photos_by_reviewer": 66,
            "reviewer_url": "https://www.google.com/maps/contrib/107348659285718862942/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eC02Vnd3RRAB",
            "reviewer_name": "Maksym Gogolinsky",
            "rating": 5,
            "review_text": "This was one of the best hotel stays in the last 5 years I been travelling, my other hotel reservation got cancelled so this was my last choice. Sam got me a room that I was looking for(I am a picky guy) in under 10 mins, parking spot took her only 2 min to aquire, and she was extremely friendly and helpful. I would say this hotel has the best customer satisfaction that Ive seen in a while. Thanks Comfort Inn !",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-25 05:07:38.571288",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/103843251854769422336/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNUliWENnEAE",
            "reviewer_name": "Erica Polkinghorn",
            "rating": 5,
            "review_text": "Very friendly staff to check us in. Offered an array of recommendations and suggestions for visitors. Perfect location in the center of downtown. Well within walking distance from Stanley Park! Small rooms, but efficiently organized. A seagull greeted us in our window upon morning, which was a fun touch! Windows open up for city views and sounds. It was surprisingly fairly sounds proof from street noise, even on the 2nd story.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-25 05:07:38.573278",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 65,
            "total_number_of_photos_by_reviewer": 662,
            "reviewer_url": "https://www.google.com/maps/contrib/118289128510505102231/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVc2RUVHJBRRAB",
            "reviewer_name": "P G",
            "rating": 5,
            "review_text": "Excellent stay. Staff very friendly. I stayed in this hotel chain in New York a couple yrs ago and very similar set up. Smaller rooms but they make up for it with service and decor.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-25 05:07:38.575164",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111727123886782473155/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbjZDYzlnRRAB",
            "reviewer_name": "Sherry Nisa",
            "rating": 5,
            "review_text": "AMAZING, CLEAN AND VERY COMPETENT STAFF. The location was awesome, front desk was really accommodating and parking was right by the hotel. Would absolutely recommend this hotel.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-25 05:07:38.577069",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117881734487122343391/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}