{
    "place_id": "ChIJ___vY1p2hlQRbsFUM6JZwhE",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacGUzRGtRRRAB",
            "reviewer_name": "Zheng Luo",
            "rating": 5,
            "review_text": "Me and my wife bought our first home in Canada, and we are so lucky to have Brandon as our agent. Brandon took consideration deeply to our need and our budget and can always provide us great listings. Our shopping lasted for 3 months and Brandon was always there with us for every visit. He shared us his honest opinions and can always pick up details we didnt notice. He answered us whenever we have questions regardless weekdays or weekends, daytime or nighttime. We eventually got this great deal in Metro Burnaby, which originally thought to be much more expensive. He made the whole completion process so smooth that we didnt had any trouble. Hes indeed Top 1% realtor. We greatly appreciate his hard work and professionalism.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 01:35:45.960402",
            "response_from_owner_text": "Thank you Zheng!!!! It was a really enjoyable process working with you guys to find the perfect home!!! I am so happy for you guys and hope you settle in soon! Appreciate the kind words! :)",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 01:35:45.960402",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103034135317729293433/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadU43d09REAE",
            "reviewer_name": "Masih S",
            "rating": 5,
            "review_text": "Brandon is the epitome of a consummate professional. Over the course of a year, he demonstrated an exceptional commitment to securing a property on my behalf, and the final outcome left me absolutely elated. Brandons unwavering patience, profound grasp of the real estate market, and proactive approach were truly extraordinary. He invested the time to thoroughly understand my vision and budget, assuring me that he would lead the charge in finding the perfect property. What truly distinguishes him is his unwavering dedication and impeccable communication throughout the process, which transformed it into a seamless and triumphal experience. Words cannot adequately express my admiration for Brandons work ethic and his depth of expertise. For anyone in search of a dedicated realtor who prioritizes your needs and makes your real estate aspirations a reality, I wholeheartedly endorse Brandon.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 01:35:45.964153",
            "response_from_owner_text": "Thanks for your kind words Masih!!!! It was a long journey but I m happy on how it resulted for you guys!!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-10-01 01:35:45.964153",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100106936797149066217/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaHAzVGdRRRAB",
            "reviewer_name": "Clayton Aelbers",
            "rating": 5,
            "review_text": "First Class Service! This guy is an exceptional Realtor! My experience with Brandon is I first had seen his face everywhere. It started with busstops, billboards, note pads  then one day I was driving down Kingsway and bam!!   right beside me is a 4 foot image on a car of Brandon! I went home and told my wife I think I found our realtor. I called Brandon and he came to our current home at the time and gave us a breakdown on market/value. He is very well spoken , confident , handsome young man and has his finger on the heartbeat of the market so we decided to list. We listed aggressively as he suggested and this fetched us multiple offers with our property going 80k over asking!! What a beauty! This was only one experience with Brandon. The second experience is a single family home in Montecito burnaby. I had fully renovated. Brandon showed up and fell in love with the place. I told Brandon  do you think we can get $2.5  we had purchased 1.5 years prior for $1.840 he said yeah l let s try! I believed that if anyone could fetch this number it would be him. Brandon had beautiful photos taken, drone shots, and a walk through video featuring,  yes! The one and only Brandon Gee Moore!! Brandon got us the number we wanted yet again for another huge win. Now we had sold and we did not have a house to move to only a pocket full of cash. This is great but not when you have a pregnant wife and two other kids! He worked day and night until he found us our dream property. No wonder this guy is top 1% . If you can say Brandon you can say SOLD!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-17 01:35:45.967286",
            "response_from_owner_text": "Thanks Clay!!!!!!! We definitely rocked it on the selling prices of your condo & house!!! The house hunting was definitely a journey! Glad it all worked out the way it did in the end. Couldnt have been better timing! Appreciate all of the kind words!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-24 01:35:45.967286",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/108037036650752350678/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOVlPU3B3RRAB",
            "reviewer_name": "SJ R",
            "rating": 5,
            "review_text": "Brandon helped our family with the purchase of our first home. We googled  best Burnaby realtor  and he was the top pick! We were impressed by his professionalism, genuine care for our needs and knowledge of the market. We were able to get a great deal for our home and we wouldn t have been able to do that without Brandon s guidance! His connections made the home buying process so much easier and we would recommend him to anyone looking to buy or sell their home. There s a reason he s #1!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 01:35:45.970683",
            "response_from_owner_text": "Thank you so much Sanja!! I hope you guys enjoy your new home and settle in soon!!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 01:35:45.970683",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118251159056471595915/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGelpXQ2N3EAE",
            "reviewer_name": "Me You (Someone)",
            "rating": 5,
            "review_text": "Brandon is a pleasure to work with. He is honest, upfront, determined, and knowledgeable. He helped me through every step of the process of selling the condo. If you need a professional who can get the job done then Brandon is the Realtor to use. He really must be one of the best in Vancouver.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 01:35:45.973791",
            "response_from_owner_text": "Thank you very much Guy!! Really appreciate the kind words!!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-11-01 01:35:45.973791",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115275864477424878695/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdzRPUUVBEAE",
            "reviewer_name": "MJ Barros",
            "rating": 5,
            "review_text": "Brandon is an amazing agent. He helped us to find a place to purchase taking in consideration our limited budget and specific needs. He was always driven to get the best deal for us, providing advice that helped us to make smart decisions for our future. Brandon was always welcoming, never made us feel inappropriate for having a limited budget, and was always eager to answer our questions and calm our anxieties. If we ever need to sell or buy in the future, for sure we will contact Brandon again. A great experience.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 01:35:45.977040",
            "response_from_owner_text": "Thanks MJ!!! You guys were a pleasure to work with! Hope you are all settled in your new home!",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-08-01 01:35:45.977040",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108529745838750586853/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4c2RQNjJ3RRAB",
            "reviewer_name": "Jaya Sugathan",
            "rating": 5,
            "review_text": "Brandon is a great realtor - he knows the answers to the important questions we had during the buying process, patiently walked us through all the paperwork and explained it to the novices that we were. Working with the right realtor really worked for us and I realised that at crucial points during the buying process where quick decisions need to be made and good advice, experience and reputation is invaluable. That s why Brandon is the the best. Bonus is he s very affable, friendly, committed, easy to talk to, well-liked and respected in the industry. Go with Brandon!",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 01:35:45.979773",
            "response_from_owner_text": "Thank you very much Jaya!!! I m super happy for you guys! Hope you settle in soon!",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-07-01 01:35:45.979773",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 31,
            "reviewer_url": "https://www.google.com/maps/contrib/103615001566389457458/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMTlHcnBBRRAB",
            "reviewer_name": "Maria Melo",
            "rating": 5,
            "review_text": "Brandon is a professional real estate agent and I highly recommend working with him.  I consider myself incredibly fortunate to have met Brandon.  He helped us with selling and buying our property.  He was very professional, organized always there to guide us every step of the way. He went above and beyond to find us a home. He was amazing selling our home, he works so hard for his clients. He always had our best interest in mind, guiding us, he knows all the right strategies and tactics he is extremely knowledgeable and has a true passion for his work. Brandon was very patient, managed expectations very well, and kept us updated about each step of the process, and addressed and answered all of our questions and concerns. Its been nothing but a positive experience working with him a true pleasure.",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 01:35:45.982672",
            "response_from_owner_text": "Thank you so much Maria!! Im so glad that we were able to get your family into the perfect home!!!",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-02-01 01:35:45.982672",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117944116560715680118/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbmRDQ2JnEAE",
            "reviewer_name": "Sahil Jain",
            "rating": 5,
            "review_text": "I had an amazing experience with Brandon. As a first time home buyer, I really appreciated his patience and understanding. He was always honest and transparent about the properties we looked at, and never tried to push us into making a decision. In fact, there were a few instances where he even advised us against putting an offer on a property. His knowledge of the Burnaby area and his reputation among other realtors was also a huge plus. He even provided references for me to speak with before hiring him, which gave me a lot of confidence in his expertise. Overall, I highly recommend Brandon for anyone looking to buy or sell a home. He truly went above and beyond to make sure we found the perfect property for our needs. Ask Brandon for my reference and I will be happy to talk more in detail.",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 01:35:45.985297",
            "response_from_owner_text": "Thank you Sahil!! I really appreciate all of those kind words!! Super happy for you and Sonali in your perfect home!! :)",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 01:35:45.985297",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 120,
            "total_number_of_photos_by_reviewer": 501,
            "reviewer_url": "https://www.google.com/maps/contrib/110590145854701854515/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eGZIcU5REAE",
            "reviewer_name": "Adarsh",
            "rating": 5,
            "review_text": "When we embarked on home search, Brandon Gee More was recommended to us by mortgage executive. Brandon is very knowledgable, punctual, responsive and easy going and is able to quickly build relationships with all stakeholders involved. He made our home search an extremely seamless process and I shall gladly refer him to our friends.",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 01:35:45.987835",
            "response_from_owner_text": "Thank you very much Adarsh!!! :)",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-07-01 01:35:45.987835",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108675183233229404699/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OWZpN1BBEAE",
            "reviewer_name": "Pavel Dosanjh",
            "rating": 5,
            "review_text": "Brandon is a top notch professional through and through.  He went above and beyond over the 5 months he worked on my behalf to secure a property.  I was absolutely thrilled with the end result.  Cant says enough about Brandons work ethic and knowledge.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 01:35:46.505141",
            "response_from_owner_text": "Thanks Pavel!!! We definitely couldnt have scored a better unit!!",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-06-01 01:35:46.505141",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117038004806077309434/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScVBEUU5BEAE",
            "reviewer_name": "L A Robison",
            "rating": 5,
            "review_text": "Im embarrassed that it took so long to do a review for Brandon. He is very professional, knowledgeable, kind and very much a people person. He sold my property, which went on the market on a Saturday afternoon, in 9 days for an amount I was very pleased with in what was a slightly falling market. His marketing program was excellent and we had 2 appointments to view within a couple of hours of the listing going live. I would not hesitate to call Brandon again whether I was buying or selling. Thank you for the excellent real estate transaction Brandon, you made it easy and stressless!!",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 01:35:46.509221",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111937261340458069769/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eEplZTZnRRAB",
            "reviewer_name": "Alberto Galleguillos",
            "rating": 5,
            "review_text": "Ive been house hunting (first time home buyer) for ~3 years, and Brandon was one of the first realtors that I met when I first started looking for a home.  Over the course of those 3 years, Brandon was very patient and a huge help.  I often needed to tweek/change my email updates (eg. new budget, new neighbourhood, etc) as I learned more about Vancouver, and Brandon was very supportive and fast to make the changes. When I finally found the home I wanted to buy, Brandon again was very attentive and made the process easy and as stress-free as possible!  I felt that I had his undivided attention every step of the way, and he helped walk me through the negotiation, subjects, and helped explain what all the closing dates meant. I recommend Brandon to all my FTHB friends, even if they already have a realtor, becasue Brandon was fantastic.  We even got a beautiful welcome home basket which was above and beyond what we expected. Brandon, Ill see you soon for home #2!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:46.512456",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 6,
            "total_number_of_reviews_by_reviewer": 240,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/108934350929086677815/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMmFTaUt3EAE",
            "reviewer_name": "Melanie S",
            "rating": 5,
            "review_text": "Brandon was Great! We found someone we could really trust. Searching for a home can be draining but Brandon kept us on track.  He made us feel comfortable and at ease throughout the process. We have worked with other realtors and he sure is the best! He was great at directing us to options that had a great value and meet our needs. He made sure our offers aligned to the market value. He was also my moms realtor and she had a great experience. For my mom it was a bit tricky as she had a tight deadline but Brandon understood the urgency. My mom got a great property! I super recommend him!",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 01:35:46.516477",
            "response_from_owner_text": "Thank you so much Melanie! It was -  a pleasure helping you guys out to find the right home!!",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2023-01-01 01:35:46.516477",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100396310320576987290/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OWNxM2h3RRAB",
            "reviewer_name": "Kathleen Moore",
            "rating": 5,
            "review_text": "Brandon is knowledgeable and organized. He will take care of you through each step of the process and help you make good, informed decisions for the best outcomes. You won t regret choosing to work with Brandon.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 01:35:46.519595",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114280877551418946437/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdHB1TVR3EAE",
            "reviewer_name": "kimmy kim",
            "rating": 5,
            "review_text": "I bought my first townhouse abroad and was lucky to work with Brandon.  He was reliable, friendly, efficient and knowledgeable.  He was very responsive despite our 15 hour time difference!  Brandon had also provided me with valuable information and I appreciated his honest opinions.  Buying a property  overseas could be overwhelming but Brandon s professionalism and pleasant demeanor had made the apparently stressful process look easy.  I would definitely recommend him.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:46.522449",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 15,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106728425339495581438/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bmZ1UkFREAE",
            "reviewer_name": "Mikhail Moore",
            "rating": 5,
            "review_text": "I recently had the privilege of working with Brandon Gee-Moore as my real estate agent for selling my property, and I cannot recommend him highly enough. Brandon exceptional service, expertise, and dedication to ensuring a smooth and successful sale exceeded all my expectations.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 01:35:46.524823",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103326759232416269518/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNnI2NThBRRAB",
            "reviewer_name": "Barry Y",
            "rating": 5,
            "review_text": "Brandon provided excellent service and guidance in the process of buying our new home. He was very attentive and responded quickly to our questions and concerns. 100 percent I would recommend him to my family and friends. There s no question why he is as successful as he is and voted top realtor, he will take care of you! Thanks Brandon for your hard work and service!",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 01:35:46.527374",
            "response_from_owner_text": "Thank you so much Barry!! Congratulations to you guys on the purchase!",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-02-01 01:35:46.527374",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104752851015532590892/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdF9qcGVBEAE",
            "reviewer_name": "Marta C",
            "rating": 5,
            "review_text": "Brandon is the best realtor in Vancouver!!! He helped me find a beautiful apartment and I couldn t be happier. Brandon works extremely hard to find you a perfect place. He worked day and night on this deal. I m extremely grateful! Highly recommend :)))",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 01:35:46.530104",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 53,
            "total_number_of_photos_by_reviewer": 15,
            "reviewer_url": "https://www.google.com/maps/contrib/107774235279504647581/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtOC1uTnlnRRAB",
            "reviewer_name": "Amanda Goh",
            "rating": 5,
            "review_text": "My partner and I had such a smooth sailing experience working with Brandon! As first time home buyers, he really went above and beyond by answering our numerous questions, assuring us that things are doing well, always very responsive, and also made the entire process such a breeze. Brandon has such a fun personality and we always look forward to seeing him. Who knew buying a place would be so enjoyable in these trying times amidst COVID and the crazy real estate market! He really make dreams come true! I would highly recommend him to anyone I know.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:46.532610",
            "response_from_owner_text": "Thank you Amanda!! Im so happy for you guys!! We definitely secured a gem, thats for sure!!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 01:35:46.532610",
            "review_likes_count": 46,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/116055021839289139196/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb1pINndnRRAB",
            "reviewer_name": "Stephanie S",
            "rating": 5,
            "review_text": "Brandon is a realtor of great integrity, diligence and care. As I have come to encounter, Brandon s level of integrity is rare in the real estate industry. It is the care and kindness he acts with that sets him a part. He is in the top 1 percent of realtors for a reason! Not only is he very efficient and thorough in all details, but he genuinely cares about you and your family s needs. He understands the stresses of selling/purchasing a property and is very supportive of clients. Most realtors are all about the money and getting a sale. Brandon is different, he leads with his heart and treats you like family. He does this all while ensuring you also make the purchase of your dreams/sell in a way that you feel comfortable. This makes the experience so much more enjoyable and less stressful! I am very grateful to Brandon for such excellent service and care! I highly recommend Brandon for any property you are looking to buy or sell. If you want a kind, compassionate, efficient, and upbeat professional who will look after you, Brandon is for you! I will be returning to him and recommending him to all my friends and family!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:47.057792",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 9,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107993432404500033974/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCci02eFZREAE",
            "reviewer_name": "Poonam M",
            "rating": 5,
            "review_text": "Brandon was very helpful, professional, friendly and diligent. He helped sell our place quickly and made a daunting experience feel effortless. We did not need to worry about following up, he was always on top of it. We will definitely work with Brandon again. Thank you for all your hard work Brandon!",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 01:35:47.061179",
            "response_from_owner_text": "Thanks for the kind words Poonam!! We definitely sold at the perfect time! Super glad it all worked out for you guys!",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-03-01 01:35:47.061179",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101906412765490504774/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlakxINk9BEAE",
            "reviewer_name": "Jocelyn Ross",
            "rating": 5,
            "review_text": "I was very fortunate to find out about Brandon when I was looking at a property online and saw him posted as a Buyers Agent.  I was in my other residence for 16 years and was honestly overwhelmed by the thought of selling and then finding a place such that I thought someone like Brandon would be absolutely essential.  He was an incredibly honest and enthusiastic person from the beginning.  When it came to selling my home he had a collection of listings in the area presented in a binder so  quickly that I was amazed.  This prospectus enabled me to be realistic about what to list my home for and how to respond to changes in prices in the units around me.  He never pushed me to change my price but rather discussed the differences between units and what they were subsequently asking so that we could come to an effective solution with respect to my listing.  My place sold and I strongly believe that it was one of the few as the market dropped, and was directly related to his endless effort.  He guided me through the process of selling and then found the perfect place for me where I had really hoped I would end up very quickly!  He then expedited the buying process so that we were the first offer and we were able to buy the unit right away!!  In addition to all of this, he was a wealth of information regarding aspects related to moving out and moving in as he had a vast awareness of great people such as my Notary and movers.  Throughout this process he was always a step ahead of everyone and very effective in his actions.  But then theres the fact that he also was a very polite, caring and non-pressuring person that I could really relate to.  If you have the opportunity to work with Brandon, you will be another fortunate person indeed!!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:47.064869",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109305165246831004860/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCX3ZHYmtnRRAB",
            "reviewer_name": "Sedigheh Mahdavi",
            "rating": 5,
            "review_text": "Brandon is a professional real estate agent and I highly recommend working with him! He helped me buy a one-bedroom condo in 2022.  He is very professional and also extremely helpful in all steps. He advised me to get pre-approved for the mortgage which gave me a good reasonable mortgage rate during the interest rate hike. He always sent me new condo listings in my interest area (west Coquitlam and Burnaby). As a first-home buyer, I had many questions and he was very patient and responded very quickly.  During the whole process, he provided many professional tips/advice. I had a good experience and I would highly recommend him to anyone! Thank you for everything, Brandon!",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 01:35:47.067730",
            "response_from_owner_text": "Thank you so much Sedi! I m so glad everything ended up working out the way it did!!",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2023-01-01 01:35:47.067730",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101240246482009632605/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLem9taHRnRRAB",
            "reviewer_name": "Luz Su",
            "rating": 5,
            "review_text": "Brandon is so kind, friendly, helpful, empathetic and very professional. He made sure to sought out all our needs when hunting down a condo for us. He provided many selections, and when we were ready to make a deal, he was our first defense ensuring we got what we needed for the price we were looking for. And when the keys were handed over, he gifted us a beautiful house warming basket with a personal touch!! Thank you, Brandon for making our journey in finding a home for our daughter a wonderful experience!!!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.070846",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/107609387853735994532/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtai1xQ1d3EAE",
            "reviewer_name": "Lindsay Weston",
            "rating": 5,
            "review_text": "My husband and I engaged Brandon this past year to assist us with the purchase of our first house in the Metro Vancouver search area. As any first-time home buyer can attest to, this can be an overwhelming and defeating process in what was a very aggressive sellers market at the time. When we did finally come across the one, which was slightly outside of our price range, Brandons approach to be firm yet patient during the negotiation stage paid off in our favour and we secured the property under asking. To this day, were still amazed that it worked out the way it did, and feel grateful to Brandon for making it happen. Brandons commitment to work for his clients, passion for the business, and likeable demeanor makes him a solid realtor for anyone looking to buy/sell their home. Highly recommend!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:47.073667",
            "response_from_owner_text": "Thank you for your kind words Lindsay!! Im so happy for you guys that we finally found the perfect home at the right price!! :)",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 01:35:47.073667",
            "review_likes_count": 9,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/101658312677424808184/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaEp1VHZ3RRAB",
            "reviewer_name": "Mike B",
            "rating": 5,
            "review_text": "Highly recommended. Brandon Gee-Moore assisted me in the sale of a newer rental property condo near Brentwood in Burnaby, BC just before Christmas (2021), and I have rarely been as impressed with someone as I was with him. Brandon was a true professional from start to finish and is one of those rare breeds of people who actually does what he says he will. Not some of the time, but all of the time. And is humble and down to earth to boot. With an infectious, positive attitude, and fun to do business with. Every obstacle (and there were a few along the way) was met with a can-do attitude, and a solution that moved us all along. Brandon follows up leads on his website in a timely manner (to get your business, a good start), comes fully prepared to buyer or seller meet and greet meetings, and I found him to have excellent knowledge of current market conditions and current market selling prices. He uses good professionals (such as photographers), manages the showings and sales processes professionally, and closes win-win deals. In my case as a seller, we had three full price offers within a week (in the slow period of Nov 16-30 just before Christmas 2021), that all fell through for various reasons (financing turned down, etc). Not to worry, we got a fourth full price offer, and that sealed the deal. I enjoyed working with Brandon, and found him to be a true professional, and I would highly recommend him to any friends or associates, or others just looking for a good broker, on either the buying or selling side. My experience with Brandon was first class, 10/10, with no reservations.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:47.076890",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 21,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/115718017498988359673/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOEx6TXRBRRAB",
            "reviewer_name": "Nouri R",
            "rating": 5,
            "review_text": "It s been a pleasant journey working with Brandon. He made the whole process smoother despite a few obstacles! From the beginning, he acted so fast and dagged deeper by asking the right questions to learn about our preferences; soon after, he started sending listings based on our answers. He arranged the viewing for the selected listings and gave us the whole picture and information about each unit, and provided his real estate insights for each one of them. His insights were very valuable and crucial for us to decide which unit is going to be the most beneficial in the long term and ticks all the boxes for us at the current moment. During the offer stage, he was very thoughtful and knowledgeable, using the right strategies and tactics to present offers with fair negotiation that allowed us to get our dream unit BELOW the asking price, and this is all because of Brandon s experience in this hot market. Brandon was very patient, managed expectations very well, and kept us updated about each step of the process, and addressed and answered all of our questions and concerns. Its been nothing but a positive experience working with him. I strongly recommend Brandon to anyone looking for the dream house or condo!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:47.080484",
            "response_from_owner_text": "Thank you so much Zeinab!! It was a pleasure working with you guys during this journey. I am so excited for the next chapter of your lives!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 01:35:47.080484",
            "review_likes_count": 20,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107853356197649297045/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcG9qVlNnEAE",
            "reviewer_name": "Sov",
            "rating": 5,
            "review_text": "It was a great pleasure doing business with Brandon. He helped us find our dream home. He is extremely knowledgeable and will go above and beyond to answer any questions you may have. He knows a lot about buildings and can provide valuable insights on whether its in good condition or not. I would highly recommend Brandon to anyone for their real estate needs. Keep doing the good work, Brandon!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.083167",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106014216945334714093/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOHQ3SUZREAE",
            "reviewer_name": "Dar Papa",
            "rating": 5,
            "review_text": "I ve had the wonderful opportunity to have Brandon as my realtor. He takes the time to understand my needs, asks the right questions, and listens. He did an amazing job presenting our property, took quality photos, bringing in buyers and selling! Brandon is easy to work with, he works hard to ensure all his clients are happy, brings perspective and knowledge into everything he does. I believe in Brandon!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.086088",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 6,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113502675029623423366/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bUlfTE93EAE",
            "reviewer_name": "Katie Cegoni",
            "rating": 5,
            "review_text": "My husband and I couldnt recommend a better realtor! We found Brandon while searching online for a realtor as we were looking to relocate from Montreal to the Vancouver area. He did a great job of finding us our new home and was very responsive and helping answer any questions we had. He made our move across the country a very smooth and seamless transition. He was very helpful in providing us with neighbor information and really got to know us as people to help us find the best fit for what we were looking for in a home. Brandon is one of the most hardworking professionals I have ever worked with, he went above and beyond our expectations. I know that if we ever decide to sell in the future that we will be working with him again. Could not find a better realtor to work with!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.675021",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117323747339447496716/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNVB5cHh3RRAB",
            "reviewer_name": "Edmond Tam",
            "rating": 5,
            "review_text": "Brandon is a energetic and humorous person, he helped us to found our investment condo. He did his research and suggested our initial offer 32K below asking price that got accepted. It was lower than our expected price which was unusual in a hot market. He sent emails at each stage to remind me what need to be done, that was helpful and guided me through all the way to completion. I appreciated his work and I actual enjoyed the whole process.  Brandon, keep up the good work and wish you successful in your career. Thank you. Edmond",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.679265",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112387790442164078081/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5bE1iaEhBEAE",
            "reviewer_name": "Wenyan Hu",
            "rating": 5,
            "review_text": "Brandon with his professional real estate buying knowledge will guide buyers through all the processes as home buying, especially great for first-time home buyers. Brandon will explain the docs before buyers make decisions, draft contract, offering prices suggestions for buyers. When placed the offer, Brandon will try his best to negotiate with the sellers to help buyers get it accepted. After that Brandon will help buyers through the home inspection, mortgage contacting, etc. to walk with the buyers steps by steps. No matter buyers have any questions, Brandon will try help buyers get the answers. Brandon is really helpful and can be trusted, which makes the first-time home buyers have a smooth buying processes and the most important thing is that fulfilling your dream to be a real home owner.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.681999",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113075830881776619682/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzX0syRVpREAE",
            "reviewer_name": "Andrey Dekhtyarev",
            "rating": 5,
            "review_text": "It has been a real pleasure working with Brandon. He is very efficient, knowledgeable about the housing market and also fun and pleasant to deal with. I was also impressed by his terrific negotiations skills, we got great price on both buying and selling end. Brandon is very proactive and punctual, he really listens to your needs and provides excellent guidance and amazing customer service. From the very first meeting every step of the process was made very clear, and everything went smooth and worry free. I definitely recommend him to anybody looking to buy or sell property,",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:47.685165",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114382356720508497146/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bk95R2xnRRAB",
            "reviewer_name": "Scott Wong",
            "rating": 5,
            "review_text": "Brandon provided top notch service in selling our current and buying our future home.  He is honest, transparent, and trustworthy in our transaction.  He is always available when needed, and answered many of our questions and concerns, providing us the confidence and facts to make the right decisions.  Any questions he cant answer, he would utilize his experience, knowledge, and connections in the industry to find the solution.  This added value gives him a tremendous edge over this competition.  Brandon truly provided his best interest for our family and needs, and we are grateful to have met him.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.687637",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 296,
            "total_number_of_photos_by_reviewer": 176,
            "reviewer_url": "https://www.google.com/maps/contrib/111998841370784480985/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdlBqcFdREAE",
            "reviewer_name": "KyungHye Kim",
            "rating": 5,
            "review_text": "Brandon helped me finding our very first home. It was NOT a easy process thanks to the SELLERS realtor who really shouldnt be a realtor. Brandon not only spent extra time and energy to take care of the mess, but also made sure I am informed. He was professional and super friendly throughout the whole process - I honestly think my purchase wouldnt even possible if I didnt have him. I highly recommend Brandon. If anyone need a honest and hard working realtor who can deliver, Brandon is your guy! Him and his dream team will make your dream come true! ;)",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.690970",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 5,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102904691578800715404/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydXBuTVVREAE",
            "reviewer_name": "Himanshu Joshi",
            "rating": 5,
            "review_text": "We had a fantastic experience with Brandon! From start to finish, Brandon was extremely considerate of our needs. He made himself available 24/7. The process was painless and efficient. Thank you Brandon for getting us into my first home!! I would recommend Brandon to anyone. Thanks for everything.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:47.694098",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 11,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103385135179600352409/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ZzdpMDVRRRAB",
            "reviewer_name": "aratrika akhter",
            "rating": 5,
            "review_text": "Brandon is an exceptional realtor. I can say this with confidence because of my experience with other realtors. First of all, Brandon truly cares about the service he provides. It is more than just a sale for him. He takes time in getting to know the client and what matters to them the most. He is not pushy which I appreciated a lot. However, if he thinks something is the right fit he will encourage you to move forward. For us, build quality was extremely important. Brandon understood that and he used his deep local knowledge and experience to guide us to find a home that was built well. There were many viewings we went to where we were willing to settle because we were tired of looking. Brandon stopped us from settling. There were offers that didnt go through and it was upsetting, but he didnt give up, and he kept us going. Brandon has lots of knowledge about the region, most of the local builders, and has access to insider information as he comes from a family of realtors. Brandon is professional and very approachable. I truly believe if it wasnt for his knowledge and expertise we would have never been able to buy our home in a crazy competitive market like Burnaby! If you are struggling and serious about buying, go with Brandon, you wont regret it!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.696364",
            "response_from_owner_text": "Thank you so much for the kind words Aratrika!! It was definitely a long journey and I m so happy it all worked out!! After all of the pain, stress and tiredness we found the best home possible in the end!!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 01:35:47.696364",
            "review_likes_count": 7,
            "total_number_of_reviews_by_reviewer": 57,
            "total_number_of_photos_by_reviewer": 92,
            "reviewer_url": "https://www.google.com/maps/contrib/109297558843747880189/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxak1UdTlBRRAB",
            "reviewer_name": "Rachel S",
            "rating": 5,
            "review_text": "Brandon is one of the best realtor we have worked with! He and his team are very polite, quick, and accommodating. He is very professional and honest about his work and you can tell he is putting in 100% of his effort to help us. Even with our language barrier, he made the process very easy for us. We hope to have him as our realtor in the future and will recommend him to anyone looking to buy or sell their homes. Thank you Brandon! -from Paul and Rachel",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.699578",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 6,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111778916338438850642/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTcDU2ZkFREAE",
            "reviewer_name": "A S",
            "rating": 5,
            "review_text": "As a first-time buyer, we were extremely lucky to have Brandon Gee Moore as our realtor. There was a lot to learn and Brandon responded promptly to our queries, offered advice and eased our anxieties throughout the process. He took our needs into consideration and was honest with his opinion for every property we looked at. He was always prepared and walked us through every detail of the home buying process and sat with us through the documentation process. Brandon is professional, knowledgeable, and quick at making appointments. We would recommend Brandon to anyone who is looking for a trusted realtor who prioritizes his client s happiness.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:47.701678",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104134796923253640256/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5bE55dFB3EAE",
            "reviewer_name": "Joyce Cheng",
            "rating": 5,
            "review_text": "We met Brandon by chance and everything just worked out! Brandon made the whole process of selling our townhome and buying a detached home seamless. Brandon guided us through the whole process. He is very responsive and always looking out for our best interest. We are extremely happy and would recommend Brandon to anyone. He is a truly qualified professional agent and we could not have done it without his expertise. Thanks Brandon!!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.239958",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 225,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104116625750245320146/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMUlXa0xREAE",
            "reviewer_name": "Juno Bulatao",
            "rating": 5,
            "review_text": "As a first time home buyer, Brandon was the best realtor. He helped find the perfect home within budget for my partner and I while educating us about the home buying process. He was amazing to communicate to (very reassuring and quick to respond) and dedicated to his work. We will be recommending Brandon to our family and friends as well as turning to him the next time we buy/sell.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:48.243794",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114980736873137393268/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMVlxNlRBEAE",
            "reviewer_name": "YTC",
            "rating": 5,
            "review_text": "Brandon helped us bought our first apartment.  It was such a pleasure working with Brandon.  He provided great guidance for us first timers.  Buying a home is very daunting but he definitely made it much easier for us. He is always quick to response, and patient.  Very knowledgeable too!  Do not get fooled by his young age.  He has tons of experience in the area.  And when it comes to price negotiation - lets just say we were very satisfied. Cannot recommend him more :)!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:48.247478",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 93,
            "reviewer_url": "https://www.google.com/maps/contrib/100275522238497307196/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobWFYUnVnRRAB",
            "reviewer_name": "Christine G",
            "rating": 5,
            "review_text": "Was so very helpful with the process of buying our first home! As many know, buying a home can be very stressful, Brandon was the best to work with & made my husband & my goal of owning our first home possible! Many thanks Brandon!",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 01:35:48.251095",
            "response_from_owner_text": "Thank you Christine!! Im so glad we made it work in the end!! The timing was perfect!",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-03-01 01:35:48.251095",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115689397785366897114/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMGZDODJ3RRAB",
            "reviewer_name": "CK E",
            "rating": 5,
            "review_text": "Brandon successfully managed to make purchasing our home in a crazy market situation an amazingly positive experience for us. Talk about smooth and easy! We were impressed by his professionalism, customer-service orientation, knowledge of the areas and real estate options, as well as his out-of-the box thinking. His attitude was respectful and receptive to our needs at all times. Great job!!! C+C",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.254027",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117264783803782314318/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcnJLWlJREAE",
            "reviewer_name": "Prem Bhakthan",
            "rating": 5,
            "review_text": "A FIVE STAR EXPERIENCE!!! I highly recommend Brandon Gee-Moore for buying or selling your home. He is very genuine, consciencious and caring through the entire process. Brandon is a patient and knowledgeable realtor with a strong skill-set to get the job done! I will not hesitate to work with Brandon again for either sale or purchase of a home or investment property. Hes a natural in dealing with people and makes the process very enjoyable.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:48.256902",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 6,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108373236063519975467/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbVlXZmVBEAE",
            "reviewer_name": "Jinal Jain (CA)",
            "rating": 5,
            "review_text": "We were so fortunate to have Brandon as our Realtor. He is very Professional & HARDWORKING!!! As a first time home buyer, he educated us well with all the aspects of buying. He was very patient and didnt rush us into buying anything we didnt like. In fact he made us see many condos varying from old to new & also introduced us to new neighborhoods. This really made our purchase easy..Also I must say he was flexible with the tight work schedule we had and would book all the appointments per our schedule. In short, he was always on our side as a friend working to make our house purchase as simple and successful as possible. The best part about working with Brandon was that he was always more focused on answering our questions, giving us good advice & boost our confidence when we were hesitant in decision making. And finding condos that met our needs than he was on closing a deal. We would definitely recommend him to anyone",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.259798",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116649865470931483591/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcWEycDdnRRAB",
            "reviewer_name": "LING KUO",
            "rating": 5,
            "review_text": "We highly recommend Brandon. Brandon is an amazing realtor. He is helpful and knowledgeable. We changed our mind couples of time during the purchasing procedure, and sometimes my husband and I even held the opposite opinions. He always worked in our best interest, and had patiently guided us to purchase our primary home. Thank you, Brandon.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:48.262430",
            "response_from_owner_text": "Thank you!",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-12-01 01:35:48.262430",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107257184025388687299/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5c052cEx3EAE",
            "reviewer_name": "a Patrick",
            "rating": 5,
            "review_text": "I was a first time home buyer and Brandon came recommended to me by my bank. I am so happy that he was my relator. He listened to my requirements and my budget and only showed me properties that were within my parameters. He worked very hard to juggle viewings around my work schedule and when it came to put offers in, he would work late night at the office to ensure everything was done properly. While looking at properties, Brandon had my best interest in mind and did not hesitate to advise me of potential problematic issues during the viewings. He has a very pleasant disposition and I felt like I was taken care of throughout the entire process. I am confident in recommending Brandon to anyone who is in search of a top notch relator. Thank you Brandon for getting me my first home!!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.264781",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/113574392258309743903/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpc3VlWE1BEAE",
            "reviewer_name": "neha agarwal",
            "rating": 5,
            "review_text": "We had a wonderful experience with Brandon Gee and cant speak highly enough of our experience.We were first-time homebuyers with very little knowledge about how to find the right place. We met with a couple of realtors before Brandon,but we knew instantly that he was the one for us. He is honest and hands-on and he really helped to take the pressure off of us. We never felt forced to make an offer and when we finally found the one and ended up in a bidding war, Brandon walked us through every step of the negotiations, and we thank Brandon for that! We have several friends looking for homes and thinking about selling, and we would recommend Brandon to them!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:48.267500",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101707273584928157900/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeXZ6TDJRRRAB",
            "reviewer_name": "rosy fong",
            "rating": 5,
            "review_text": "Brandon was our agent for the sale of our condo in Burnaby and he did a fantastic job with a quick sale. He is an amazing realtor, knowledgeable, friendly and honest.  Highly recommend!! Thank you so much. Rosy and Howie",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 01:35:48.847285",
            "response_from_owner_text": "Thank you so much Rosy & Howie!!",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2023-01-01 01:35:48.847285",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118162448877458541751/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eExmbnhBRRAB",
            "reviewer_name": "Archita Borah",
            "rating": 5,
            "review_text": "Brandons professional and timely support enabled my partner and I to buy our first home! He offered advice and a step-by-step guide to all necessary action items throughout the home-buying process. Brandon has ensured that we, as buyers, are set up for success! Highly recommended!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.851294",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111683584511903298925/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpeGRpb0t3EAE",
            "reviewer_name": "Bruna Cruz",
            "rating": 5,
            "review_text": "Brandon is a incredible professional to work with! He was easy going, responsive, resourceful and  knowledgeable but most importantly Brandon always had our best interest in mind every step of the way. As first-time buyers - newbies in this crazy market -  he helped us navigate through the process in a comfortable way. I would highly recommend Brandons services!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.854737",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116352264364668627334/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcHNiRk1nEAE",
            "reviewer_name": "Jessica Pearson",
            "rating": 5,
            "review_text": "Brandon was professional, quick to respond and extremely informative. As a first time home buyer I wasn t quite sure what to expect. The entire process can seem overwhelming and we honestly didn t know what questions to ask to ensure we were getting good value for our money. That s where Brandon came in; he walked us through what questions to ask, what we needed to know about the process, how to assess future expenses, and how to tell if a location would be easy to sell again in the future. He also took the time to sit down with us to review the documents, answer any questions, and ensure we fully understood what we were looking at. We found our dream condo within a month and thanks to Brandon s feedback and guidance we felt extremely confident in our decision. It s no wonder he came so highly recommended.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.857476",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109397569301419104761/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLM0otY2lBRRAB",
            "reviewer_name": "Marina Ubalde",
            "rating": 5,
            "review_text": "My neighbour, Darlene, and I talked about selling our townhouses for a few months, so when she told me she sold her place, I asked if she would recommend her realtor, Brandon.  She had very impressive words about him  - his professionalism,  his strong support and responsiveness to the sellers questions and needs, and has a vast knowledge about the community where the property is being bought and/or sold.  I used Brandons services and he was just outstanding.  He sold my property within just a week!!!   I was very thankful for Darlenes recommendation!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.860971",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112311577580026881732/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMkp1VE9nEAE",
            "reviewer_name": "Sabrina Young",
            "rating": 5,
            "review_text": "Brandon Gee-Moore is an outstanding realtor. Throughout the past several months, he has been there every step of the way. As first-time buyers, we changed our minds throughout the process. However, Brandon was extremely patient and understanding whilst providing objective advice and answering every question and concern that we had, no matter what time of day or night. He was never concerned about closing a deal; only about finding us the right home in the right neighbourhood for the right price. When we finally found our dream home, Brandon guided us through several rounds of negotiation until reached a price that we were both happy with. This made the whole process incredibly easy and stress-free. His honesty, expertise, exceptional advice, and attentiveness are greatly valued and appreciated. We would highly recommend Brandon to anyone looking to sell or buy a home.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:48.864184",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101127892658582906664/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcHVUOS13RRAB",
            "reviewer_name": "Sumi S",
            "rating": 5,
            "review_text": "Brandon is one of the best real estate agents we have dealt with. He is very professional, knowledgeable and approachable. He helped us find our dream home. I highly recommend Brandon to anyone looking to buy a home.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.866658",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105699685271255303682/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5MUtIVmVBEAE",
            "reviewer_name": "Griffin J",
            "rating": 5,
            "review_text": "Brandon was able to help me purchase my first condo. Throughout the process he was there to answer every single question, give his personal and expert advice on properties, and make sure I was well taken care of. He always kept a positive attitude and make sure the process was as smooth as possible. I HIGHLY recommend using Brandon as a realtor!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.869000",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100168735437428290343/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxa0lQc2J3EAE",
            "reviewer_name": "Cecilia Su",
            "rating": 5,
            "review_text": "Im living in my new, beautiful condo because of Brandon! Working with him made things significantly less stressful, and I truly felt that my needs were being put first. Brandon is professional, patient, and incredibly hardworking. I have already recommended him to all my friends, and Ill be asking for his help later on when it comes to buying a home!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:48.871717",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105710940004951834731/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcnN5N2V3EAE",
            "reviewer_name": "Andrea Zamparo",
            "rating": 5,
            "review_text": "Brandon has been quick, efficient and professional throughout our sale/purchase process. We had some complications, which were solved very effectively by Brandon. He is straightforward and gives you good recommendations based on his expertise. We would definitely recommend him!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:48.873800",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 8,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101835551816476435690/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrcGR6NHFnRRAB",
            "reviewer_name": "Milagros Asuncion",
            "rating": 5,
            "review_text": "I am giving Brandon an excellent service rating! He helped me buy my first ever rental property. In the process, he went above and beyond the call of duty. He did all the work while I was vacationing in Europe and worry nothing until all papers are done. He taught me how to sign my documents electronically with ease. I highly recommend Brandon Gee-Moore for your next property purchase. He is a professional realtor that you can trust all the way. Greatly appreciate all your hard work, thank you Brandon and until the next time.",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 01:35:49.412334",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100501665258679007198/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cGJINUpnEAE",
            "reviewer_name": "Mario Pitacco",
            "rating": 5,
            "review_text": "Brandon was great! Cannot stress that enough. He was courteous and professional but above all else very knowledgeable! Brandon helped me purchase my first place and was very thorough and helpful. The place I purchased already had multiple offers in place. However, Brandons expertise ensured that my offer was the one that was ultimately accepted. Cannot recommend Brandon enough!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:49.415737",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/107580333384609509332/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNHBlZkpBEAE",
            "reviewer_name": "linda fox",
            "rating": 5,
            "review_text": "I came upon Brandon while searching realtor.ca for condos in Brentwood.  He was readily available when I called with questions.  I was impressed with his knowledge during that 1st conversation.  Before hiring him, I looked up reviews and was pleasantly surprised at how many happy and satisfied clients had taken the time to leave glowing reviews.  I knew he was the agent for me!  Exceptionally hard working, always available to answer questions.  Brandon is a young man who knows his stuff.  Never any pressure.  Personality plus.  I highly recommend Brandon, and would hire him again in a heartbeat.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:49.419825",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108647364437724091774/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaGZucU5nEAE",
            "reviewer_name": "Kathryn E",
            "rating": 5,
            "review_text": "Best. Agent. Ever. Ive worked with several real estate agents over the years and Brandon will be the one I go to from now on. If you want a super responsive agent who knows how to negotiate the best possible price, even when the market is moving fast, Brandon is your guy. He will go out of his way to find exactly what you want, get you a great price, and put in hours of work to ensure the entire process goes smoothly and protects your interests. Seriously, call Brandon if you need stellar real estate agent.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:49.423410",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 30,
            "total_number_of_photos_by_reviewer": 28,
            "reviewer_url": "https://www.google.com/maps/contrib/106757736792964832542/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDNm9DbUp3EAE",
            "reviewer_name": "Harshith Vijaya",
            "rating": 5,
            "review_text": "Brandon is a great guy to work with. Me being first time home buyer, he is always available to answer all your questions. Very easy going and never felt pressured. He also have good contacts in the industry and helped me connect with right people for mortgages, insurances and lawyers. He also come from a family great realtors who are big names in the industry. Dont look further, you wont regret.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:49.427247",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 41,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/100343593178796886222/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNmNTZ0pREAE",
            "reviewer_name": "Janice Harrington",
            "rating": 5,
            "review_text": "We highly recommend Brandon to anyone looking for a realtor. He helped us to buy our first home and really took the time to explain the process to us at every step along the way. He helped us balance the pros and cons of the different houses we saw, and we always felt that he really wanted us to find the right home no matter how long that was going to take. He is very patient, and was always quick to respond to our questions, no matter how insignificant. We really appreciated his support while we searched for our new home and always felt that we could trust his advice.",
            "published_at": "4 years ago",
            "published_at_date": "2019-12-01 01:35:49.431062",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101820465820623124061/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzdElxaUlREAE",
            "reviewer_name": "jordon appleby",
            "rating": 5,
            "review_text": "We were introduced to Brandon after he worked with a family member on a condo sale.  Given that this was our first property purchase we had lots of questions, from our first meeting onward,  Brandon was always professional and incredibly patient as we narrowed down our search area and fine tuned our criteria.  Once we identified a target property, he guided us through the offer and subsequently,  the buying process.  We now live in our dream condo and feel very lucky to have had Brandon on our team",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:49.433417",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110388393536653657428/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdEo3SDBnRRAB",
            "reviewer_name": "Scott Pearson",
            "rating": 5,
            "review_text": "My wife and I really enjoyed Brandon s approach to aiding us in purchasing our first place. As first time buyers there was a lot to learn, and Brandon was very informative without it ever feeling overwhelming. Would recommend to anyone looking to buy for the first time and look forward to using his services again in the future.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:49.435783",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106949054242472850834/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDeUpIVzVRRRAB",
            "reviewer_name": "Jane Sun",
            "rating": 5,
            "review_text": "Brandon helped me with my very first purchase. He was always available to answer questions, and explained things in an easy to understand way. He knows real estate inside and out, and I trust his judgement and advice. Never felt pressured during the whole process. I will work with Brandon again!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:49.439329",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111394924736175801960/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdmZMYmRBEAE",
            "reviewer_name": "Aashi Vashi",
            "rating": 5,
            "review_text": "As a first time home buyer in Canada, we were very nervous and didnt know anything about real estate market. Brandon was patient and knowledgeable to answer our rookie questions. He is very responsive and easy to work with. Thank you Brandon",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 01:35:49.442476",
            "response_from_owner_text": "Thank you Aditi! Hope you guys settle in your place soon!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 01:35:49.442476",
            "review_likes_count": 5,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 35,
            "reviewer_url": "https://www.google.com/maps/contrib/107094123993589107808/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5bXVUSVNBEAE",
            "reviewer_name": "Mykola Prychyna",
            "rating": 5,
            "review_text": "We randomly picked Brandon as our realtor and very glad we did. He is exceptionally friendly, shows respect through both his behaviours and language, builds and maintains effective relationships, works effectively all the way with you. He cares about what his clients are experiencing, what they want to accomplish, and the services he provides them. He is accurate and thorough. Acting fairly builds trust and credibility, demonstrates judgment to produce desired outcomes, shows integrity. Communicates effectively, always answers to emails and phone calls right away, punctual. Meets deadlines. Brandon gets the job done.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:49.992698",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116874658102212984470/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjdHBEcWlnRRAB",
            "reviewer_name": "Poonam Tiwari",
            "rating": 5,
            "review_text": "Brandon helped us in buying our house 6 months ago. He was thorough and proactive. Always available on call or emails. He was patient with us as we travelled through different areas over several months in search of our dream house .We appreciate his honesty and transparency. It was a pleasure working with him. We now consider him as a friend and would definitely recommend him to anyone .",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:49.996128",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113299312750763028705/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzZ3VDNWVnEAE",
            "reviewer_name": "Hitomi Dekhtyarev",
            "rating": 5,
            "review_text": "I highly recommend Brandon for someone looking for a realtor! I and my husband had great experience with him. He is very dedicated, honest and also knowledgeable about market. He always gave us quick response when we needed. Brandon is professional realtor that you can trust all the way! We will definitely work with him again!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:49.999327",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104390920531705251048/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cjVLd0FREAE",
            "reviewer_name": "rsyjseo",
            "rating": 5,
            "review_text": "My parents bought a house through Brandon. Very positive experience having Brandon as our realtor. Knowledgeable about the market and he works extremely hard for his clients. Would definitely recommend Brandon to friends and family.",
            "published_at": "5 years ago",
            "published_at_date": "2018-12-01 01:35:50.002390",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117310792591671359124/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5MVBDM01REAE",
            "reviewer_name": "David Skinner",
            "rating": 5,
            "review_text": "Brandon and his team did an exceptional job at selling my condo. His expertise and attention to detail in marketing the condo exceeded his peers. His hustle and excitement to complete the sale was presented and delivered. I would highly recommend him to anyone looking for an energetic, professional and trustworthy agent.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:50.005361",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100332056435756218653/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbWNLdzhnRRAB",
            "reviewer_name": "Ehsan Haghighat",
            "rating": 5,
            "review_text": "Had a great experience selling our apartment in Burnaby! Very professional yet friendly team!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-24 01:35:50.009203",
            "response_from_owner_text": "Thanks Ehsan!!!!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-24 01:35:50.009203",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109528027788682169905/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxOVA2RVpBEAE",
            "reviewer_name": "Kelvin Lui",
            "rating": 5,
            "review_text": "Working with Brandon made what could have been a stressful time easy and painless. Brandon is responsive, knowledgable and went above and beyond to make sure we were informed before making our decisions but never pushed his own opinions on us. We would most definitely work with Brandon again for our next home.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:50.012255",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 54,
            "reviewer_url": "https://www.google.com/maps/contrib/113619701607778007386/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjc1BEa3VRRRAB",
            "reviewer_name": "BOBBY PURBA",
            "rating": 5,
            "review_text": "Brandon has been an amazing Business Partner and continues to be a Trusted Advisor in all our dealings.  Hes sincere, courteous, understanding and makes the time to have the necessary conversations.  Hes truely one of a kind.  Were grateful to Brandon time and time again.  Thank you!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:50.015729",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100983264040834653525/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaGE2UVh3EAE",
            "reviewer_name": "Melinda Maningas",
            "rating": 5,
            "review_text": "Brandon helped me buy me, my sister and my husband buy our first property. With our financing situation it was not the easiest to get into the market with hot condo market. We wrote over 10 offers that we lost out to but Brandon never gave up. He stayed positive and did everything he could to get us into the market! We always will recommend him for his hard work.",
            "published_at": "5 years ago",
            "published_at_date": "2018-12-01 01:35:50.017959",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109654142516151764404/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDZzZLaEZ3EAE",
            "reviewer_name": "Ryan Messmer",
            "rating": 5,
            "review_text": "Brandon is the best in the business. Well informed, responsive, and offered excellent advice through the buying and selling process. Wont hesitate to recommend Brandon to friends and family in need of a realtor.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:50.020056",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104123057390772986213/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNajVleG9BRRAB",
            "reviewer_name": "B C",
            "rating": 5,
            "review_text": "Exceptional service every time we connect! Brandon helped me and my family go through a smooth phase! Couldnt have done it any better without you! He has the hook ups to everything like renovations, installation home development, home inspection to Notary Public. He will try his very best to make things less complicated for you. It didnt take us long to sell our home, and upgrade to the home that we dreamed of. I would recommend him to anyone and everyone!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:50.553266",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/104557829398996712905/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNzVHMmVnEAE",
            "reviewer_name": "Bertha",
            "rating": 5,
            "review_text": "Brandon will guide you every step of the way, and wont leave you hanging. Great customer service! Every meeting. We looked at numerous homes and had countless meetings, were tired but he just makes everything so much at ease. Its not easy looking for a new home, but with his help and ideas, nothing cant be done. I recommend him to friends and family!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:50.556707",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/110926762318849303047/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcXVibFl3EAE",
            "reviewer_name": "Jessica Jordan Su",
            "rating": 5,
            "review_text": "Out of the handful of realtors Ive known, Brandon made my family and I feel very comfortable and was easy to talk too. He found the perfect place for us and got us everything we wanted, would definitely use him again in the future!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:50.560015",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101037653356772735408/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMmRDM1JREAE",
            "reviewer_name": "Conrad Poon",
            "rating": 5,
            "review_text": "Brandon was a pleasure to deal with! Not only did he find us the property himself (it was not listed on MLS), but he also helped us negotiate a great price and addressed all of our questions and concerns quickly. Highly recommended!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:50.564278",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117357533449468962582/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2czg3NEJREAE",
            "reviewer_name": "Leanne Brown",
            "rating": 5,
            "review_text": "Brandon is very knowledgeable and assisted us through the many phases of selling our fathers home. It was a pleasant experience from start to finish. Thank you for your excellent service!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:50.567869",
            "response_from_owner_text": "Thank you Leanne! It was a pleasure helping you guys!! :)",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 01:35:50.567869",
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114641380239387443072/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dnFiOUJREAE",
            "reviewer_name": "Sushant Khurana",
            "rating": 5,
            "review_text": "Brandon is a true professional who does justification to every aspect of his job. He offered his assistance as needed and on when needed, especially with us being out of province buyers. Brandon assisted us with even referred us to professionals he trusted, all of them being superstars in their way. Thanks, Brandon, for all your help.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:50.571953",
            "response_from_owner_text": "Thank you Sushant! It was a pleasure helping you guys!!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 01:35:50.571953",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115254896091369013846/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBM05yS213RRAB",
            "reviewer_name": "Lindsey Cote",
            "rating": 5,
            "review_text": "Brandon was excellent in helping my fiance and I find our first home. He was friendly and professional and answered so many questions we had. He found lots of different options for us including some we probably wouldnt have looked at otherwise. Great guy and great realtor.",
            "published_at": "5 years ago",
            "published_at_date": "2018-12-01 01:35:50.575394",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112301234123521446254/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNmViai1nRRAB",
            "reviewer_name": "Andrew P. Golin",
            "rating": 5,
            "review_text": "Brandon was a true pleasure to work with. Honest, dedicated, kind, and punctual. He wants the best for you and will offer his opinion, but also respects the opinions of his client. He works hard for you and truly cares. I highly recommend Brandon!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:50.577799",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105121299442827385004/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbHRHQkxnEAE",
            "reviewer_name": "Russill Glover",
            "rating": 5,
            "review_text": "Brandon helped me find an apartment that checked all the right boxes in a competitive market, and provided me with the insight needed to be comfortable in my purchase. An absolute pleasure to work with, Brandon will be able to guide you through the murky waters of purchasing real estate. Totally satisfied customer here!",
            "published_at": "5 years ago",
            "published_at_date": "2018-12-01 01:35:50.580059",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108454714372227357988/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHeUxuWTRRRRAB",
            "reviewer_name": "Javier Mah",
            "rating": 5,
            "review_text": "Brandon was accommodating, straightforward throuhout the sales process. Any questions or requests ---> non-complicated, non-fussy solutions. He is well liked for his demeanor, knowledge, professionalism, plus simplicity. It was a contentment in working with him, and were sure - again in the future~",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:50.582265",
            "response_from_owner_text": "Thank you for the kind words Javier!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 01:35:50.582265",
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109145530111409083149/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cXJDVGhBRRAB",
            "reviewer_name": "Dakota Capital",
            "rating": 5,
            "review_text": "Brandon has helped us purchase a beautiful condo in Burnaby for me and my son, hes been absolutely pleasant to work with and I will be recommending him to anyone I know looking to buy or sell a home! Thank you for all your hard work Brandon!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:51.127106",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110108061314547413890/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURpa3BvdhAB",
            "reviewer_name": "Luiz Augusto Manfre",
            "rating": 5,
            "review_text": "Great experience! As first-time buyers we needed sound guidance through the buying process and Brandon offered great support and advice. It was a pleasure to work with such a professional, responsive and helpful person! Would definitely recommend him.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:51.131456",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105080448309992108195/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpdHZpNi13RRAB",
            "reviewer_name": "Fan Wu",
            "rating": 5,
            "review_text": "Brandon always comes with a bright smile and pays attention to our needs and wants. He spends a great deal of time marketing our property and promptly follows up with all the potential buyers. He is everything that I expected from a realtor.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:51.135636",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 25,
            "reviewer_url": "https://www.google.com/maps/contrib/108886513845619115640/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpemJyUWRnEAE",
            "reviewer_name": "D K",
            "rating": 5,
            "review_text": "Brandon has provided me with the best experience a first homebuyer could ever ask for. Stunned beyond belief at how diligently hes worked to secure a home for me at the low price I wanted. I wouldnt ever consider a different realtor moving forward! Appreciate your hard work Brandon!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:51.139622",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 22,
            "total_number_of_photos_by_reviewer": 31,
            "reviewer_url": "https://www.google.com/maps/contrib/110728524985674855455/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLN2ZMUWJBEAE",
            "reviewer_name": "Victory L",
            "rating": 5,
            "review_text": "Brandon is trustworthy and knowledgeable.  He helped me to sell my condominium fast  with excellent price. The process was smoother than I thought. I highly recommend him to my friends.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:51.142700",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111517384987933947608/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLaGF1M0xREAE",
            "reviewer_name": "Mons Dela Cruz",
            "rating": 5,
            "review_text": "Selling property is one of the most stressful event in one s life but working with Brandon and Liana made it stress free and very easy.  They are professional, responsive and transparent.  They answer all our questions (and more) and explained to us the entire process.  They guided us each step of the way and keeping us informed of the progress.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:51.146219",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105462380501646520631/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNdm9lQ09BEAE",
            "reviewer_name": "Ray Zhou",
            "rating": 5,
            "review_text": "For 24/7 attention to your real estate needs, Brandon is the person to call. He helps out with purchases of all sizes and has good understanding of the market. We were able to quickly close on a small condo purchase with his negotiation.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:51.149052",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 37,
            "reviewer_url": "https://www.google.com/maps/contrib/109895570012522821657/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDNWUyMVNBEAE",
            "reviewer_name": "Antonia Buono",
            "rating": 5,
            "review_text": "If you are looking for an amazing realtor who takes the time to work WITH you, support you along the way and answer any questions you may have, at any hour of the day (Literally was 12:30AM once), look no further. Brandon Gee-Moore  went above and beyond his role as a realtor. They (him and his partner Liana) seriously have every connection you can imagine. From Mortgage Specialist to House Inspectors and everything in between. Whether you are thinking about buying, selling or both, send them a message. I promise you you won t be disappointed. Thank you for everything you have done for us!",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:51.151354",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113656737111113039290/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjOXNXR0RBEAE",
            "reviewer_name": "Crommuel Marquez",
            "rating": 5,
            "review_text": "Great to work with, he understand our family needs. His work ethics is totally valuable that we didnt see in other realtor that we work with. If your buying your house we recommend Brandon to choose as your realtor.",
            "published_at": "3 years ago",
            "published_at_date": "2020-12-01 01:35:51.154193",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111212319196317814475/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OWNmX2FREAE",
            "reviewer_name": "Jacqueline Li",
            "rating": 5,
            "review_text": "Brandon was very professional, responsive and easy to get along with! He was a pleasure to work with and I would definitely recommend him to anyone looking to buy to sell.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 01:35:51.156750",
            "response_from_owner_text": "Thanks Jacqueline!!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 01:35:51.156750",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114834092184105412015/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}