{
    "place_id": "ChIJv9NYzTZ3hlQRnZodIh1fxlM",
    "reviews": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOE1HX2NBEAE",
            "reviewer_name": "Drew Bonnell",
            "rating": 5,
            "review_text": "Recently, Tarum and Vancouver Solar completed our solar installation, which was a major component for our new home to gain a national, Net Zero certification.  Tarum made it easy for us and performed admirably.  We are delighted on a job well done!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-21 21:11:44.538753",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/115904223399296075976/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdTZDV1pnEAE",
            "reviewer_name": "Grant S",
            "rating": 5,
            "review_text": "Tarum & his team were hired to install what was supposed to be a pretty straight forward 190+ solar panel installation.  The hicup was the delay of the new roof installation on the facility.  As a result Tarum had to work closely with the roofing contractor to make sure his installation met the warranty requirements.  I have to say that Vancouver Solar did an exceptional job of doing quality work despite the obstacles.  Tarum took care of all permits & dealing with BC Hydro to join its grid.  He made sure that the job was done right.  We are pleased with the finished product & would highly recommend Vancouver Solar.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-21 21:11:44.542526",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107773690315493480043/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaHByLVlREAE",
            "reviewer_name": "Kornelis Kuiper",
            "rating": 5,
            "review_text": "Vancouver Solar was the best out of three quotes. I compared not only price per watt, but type of system and warranty. Our roof has many segments and some skylights, which added complexity, but the installation was done well and looks very clean. There are no visible wires on the roof although the system has 9 separate panel locations. Tarum the owner made the whole process easy including the permit application and the setup for net metering with hydro. He was happy to give me detailed explanations on the types of solar, we went with optimizers and an inverter, and answered many questions of mine. We re now 2 months in and the system is working really well. We ve had no issues and the app is easy to use. I m so happy to see our credits at BC Hydro building up this summer for when we need it in the winter. In the end I cannot recommend Vancouver Solar enough. Great job guys!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-21 21:11:44.545690",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 40,
            "total_number_of_photos_by_reviewer": 28,
            "reviewer_url": "https://www.google.com/maps/contrib/112415571021132650819/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNWYybW1RRRAB",
            "reviewer_name": "Sean Prendergast",
            "rating": 5,
            "review_text": "My wife & I researched the system, received quotes from 5 different contractors. Tarum made a big difference with his proposal, he performed an aerial site survey and thoroughly explained his design from the electrical service connection down to placement of each solar panel.All permitting completed, Engineer s sign-off, coordination with BC Hydro for our net-metering application, all taken care of and the installation completed promptly with a clean site each day. I would highly recommend Tarum & his team at Vancouver Solar & Electrical.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-21 21:11:44.548659",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108663957484018984341/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtamVMZDJBRRAB",
            "reviewer_name": "Megan Stowe",
            "rating": 5,
            "review_text": "We researched and compared solar companies for about 6 months. I had spreadsheets cost comparing cost of installation with panels against the impact of the system. My husband researched panels and system set up. We were utterly careful, cautious and very deliberate and probably a little annoying to work with. Tarum was EXCEPTIONAL - and so thoughtful, patient and willing to share. He was flexible with system set up, thoughtful about our needs and utterly reliable. He was super careful with our roof, and handled all the paperwork with the city. I would absolutely recommend him! Exceptional experience and were THRILLED with our system!! It was affordable, designed well and brilliantly completed. I also waited for a windstorm before posting my review - just to be certain!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:44.551326",
            "response_from_owner_text": "Hi Megan, thanks ever so much for leaving such kind words. We re so glad that you re happy with your new solar array and we ll be keeping our eye on it on our remote monitoring software for years to come. All the best to you and Mick, you were such pleasant customers to work with. Tarum",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-21 21:11:44.551326",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102332106579632436143/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMXFmSnB3RRAB",
            "reviewer_name": "D JS",
            "rating": 5,
            "review_text": "We purchased 2 commercial systems from VSE, one in the city and one in a rural location in the interior of BC.  Tarum and his crew were fantastic from start to finish, great recommendations, very good value, fantastic attention to detail on the installation.  We are going to use them again for a 3rd system and would recommend them to anyone!",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-21 21:11:44.554338",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106060275335193519708/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdHNUd0hREAE",
            "reviewer_name": "Mark Dorini",
            "rating": 5,
            "review_text": "Installation was on time and on budget ! Our last bill was negative -$82 including all our electric Car charging. We would definitely recommend Tarum and his Vancouver Solar Team",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-21 21:11:44.556722",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103859536193702732588/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5cHEyQXV3RRAB",
            "reviewer_name": "M Y",
            "rating": 5,
            "review_text": "We were building a new home and wanted to go all solar. We contacted some other companies, but Tarum was the most professional in explaining our options and had competitive pricing. Tarum took care of all the ordering, permits and schedules, and worked with our builder for the installation.  He also contacted BC-Hydro to setup the net-metering account. It was a hassle-free and smooth process. As we were the first solar in our area, Tarum had to spend a day tutoring to the electrical inspectors how the solar system worked. We now have 44 solar panels installed on our roofs along with a battery backup system and it has been working great.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-21 21:11:44.559347",
            "response_from_owner_text": "Hi Michael, thanks ever so much for your kind words and for being a great customer to work with. Ill be keeping an eye on your Solaredge EV charger inverter monitoring system for the solar array and built-in Tesla EV charger, aswell as your 3x Tesla Powerwalls with whole-home backup. Enjoy hour energy Freedom as the grid is now your backup!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-21 21:11:44.559347",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102777552461019205826/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbmJ6NjhRRRAB",
            "reviewer_name": "paula gallagher",
            "rating": 5,
            "review_text": "We wanted to install solar panels and contacted several providers. When contacting VSE we were immediately impressed with Tarum s knowledge and experience. He offered a site visit and came out the same day. He used a drone to capture the roof capacity and within a day had a plan to us. Within two weeks from start to finish we had a 33 panel system. His staff are courteous and friendly. Our system is now functioning efficiently with a user friendly app for tracking output. We are pleased with our choice.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-21 21:11:44.562261",
            "response_from_owner_text": "Hi Paula, thanks ever so much for being great customers and also for positive feedback. Over the next 25 years I shall keep an eye on your Solaredge monitoring to ensure all is operational and that its meeting its predicted generation targets. Im glad your very satisfied with your new system and all the best to you and Nick. Best regards Tarum Lloyd",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-21 21:11:44.562261",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112779872932801153759/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaDV1SVpREAE",
            "reviewer_name": "Garfield THOMSON",
            "rating": 5,
            "review_text": "Vancouver Solar installed my solar panel system. The install went really well and I can say the workmanship and system is top notch! Tarum is very professional and always kept me apprised of everything. Tarum has a huge amount of experience and knowledge in solar systems worldwide and it shows when you observe him in action. I would recommend Vancouver Solar to anyone!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-21 21:11:44.564893",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 34,
            "reviewer_url": "https://www.google.com/maps/contrib/103464476706350228181/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURteUpxVEF3EAE",
            "reviewer_name": "Ted Li",
            "rating": 5,
            "review_text": "Vancouver Solar & Electrical Ltd (VSE) was the 3rd company I contacted to add more solar panels and how much would it be for a battery? 1st company, said, that I dont need a battery because, I got net metering from the power company. But did give me general price without too much details. And never got back to me on the cost of addition solar pannels. The 2nd company quoted me $25,000 for one Teslas Powerwall. After supplying them with pictures and diagrams of my exisiting system. But did not visit me to see my requirements. Only VSE quoted me and visiting my site and told me the addition requirements need to meet the current code. So after getting an engineers report (extra $), an upgrade to a 200 AMP electric service panel two handle my two electric cars ($5200) plus $1400 to the power company to disconnect the power on request, (blackouts are for free, and on the Sunday we had to change our clocks, we had four extra practices due to power backouts for about 10 minutes each, there was a major wind storm that day). The extra solar panels were installed within a month of contracting. But we waited three months for the transfer switch (Telsas Gateway) to arrive, but never came. So we had to disconnect two circuits to make room in the 100 amp panel for the solar power. The addition solar give me a total of 12.5 KWatts. During the summer months we had a large credit with the power company after the hotest summer on record and all the power we used for the AC. And was not until fourteen months later due to supply chain managment problems that the battieres came and were installed. During the installation of the solar panels, VSE did extra free not solar work for me. By installing a mounting bracket on the side of the roof. Saving me from hanging upside down over the edge of the roof 10 meters above the ground. We shall monitor our power usage and needs here to see if we may get a third powerwall in the future. In our home we have two adults working from home online, one going to school online, two RADAR stations (24 hrs/day), HF/VHF/UHF/SHF radio station, and emergency Internet. So our power requirements are unique that other companies would of gotten the business if they came over for a site inspection. VSE was the only company to do that and give a detail quote, and a report of the payback. Therefore VSE got the business. The Covid19 and supply chain management delays had nothing to do with VSE. Therefore I would recommend VSE for your power and Solar needs.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:45.125751",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 105,
            "total_number_of_photos_by_reviewer": 1282,
            "reviewer_url": "https://www.google.com/maps/contrib/108790942953721222885/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc19PRWtnRRAB",
            "reviewer_name": "Peter Beckman",
            "rating": 5,
            "review_text": "When Looking for a Solar Solution We had many estimates. VSE took the time to explain the different equipment options and guided us through the whole process. They made it very simple and were professional throughout. They arranged all the permits and registration for net-metering. We are very pleased with the work carried out and the follow up since.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-21 21:11:45.129966",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 15,
            "reviewer_url": "https://www.google.com/maps/contrib/112045251067723230363/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cnAzcTJRRRAB",
            "reviewer_name": "Matt Bieber",
            "rating": 5,
            "review_text": "Tarum and VSE is great to deal with, they answered all my questions, moved quickly for the install, and dealt with issues that arose due to a convoluting permitting process immediately. I would recommend their services for anyone looking for a solar installation.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-21 21:11:45.133915",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112701369535604201123/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcUp2cDNnRRAB",
            "reviewer_name": "Keith Riding",
            "rating": 5,
            "review_text": "When I contacted Vancouver Solar & Electrical Ltd., I received a prompt response and Tarum proved to be very knowledgeable, answering all our questions. Installation was swift & efficient. Tarum also helped me with the City Hall requirements. I can now make electricity even in the rain!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-21 21:11:45.137142",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110342559845574539710/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVLWY3OVBnEAE",
            "reviewer_name": "James Wilson",
            "rating": 5,
            "review_text": "Tarum did an excellent job of installing my 31 solar panels quickly and thoroughly. His recommendations  for what I required were spot on. So far the panels have generated close to 3MWh and are great for charging my electric vehicles.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:45.140571",
            "response_from_owner_text": "Hi Jim, Thanks for the positive feedback and for being a great first Tesla Powerwall customer. Its been over a year now since we completed the installation of your 33x LG NeonR Solar Panels, Solaredge EV charger inverter and the 3x Tesla Powerwalls which now backup your entire home. On our Solaredge & Tesla mobile apps, I can see that everything is still working perfectly and that youve been charging and discharging your Powerwalls every evening, so that you avoid the higher BChydro tariff brackets. Im glad that your still happy with your system and that you enjoy your energy independency and Net-metering payments for the next 24 years. Kind regards Tarum Lloyd",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-21 21:11:45.140571",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114984884115019042933/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1Mk8zcWdnRRAB",
            "reviewer_name": "Terry Allen",
            "rating": 5,
            "review_text": "I got excellent, knowledgable service from Tarum at VSE.  He was available and helpful at every step of the process and Im very pleased with my solar system.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:45.144550",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104311467284528991389/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjcHRYNzFRRRAB",
            "reviewer_name": "Scott Weinrich",
            "rating": 5,
            "review_text": "WOW! From the word go this company was extremely Professional, Knowledgeable, and Helpful. From the second I called they were able to understand what I was looking for, put together a plan, deal with permitting, and give my home a high quality installation with the industries most superior products. If you need anything with solar or battery back up I 1000% recommend this company!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-21 21:11:45.147494",
            "response_from_owner_text": "Hi Scott, Thanks for being a such a fantastic customer and your support towards me and the team. You were truly the best customer to work for. Its been 6 months now since we installed your system. I can see that each of your 50x 325W Canadian Solar panels are still producing correctly on the Solaredge app. Also your 3x Tesla Powerwall batteries are charging and discharging as they should be, aswell as backing up your entire home during your regular Grid outages in Alberta. Im proud of this flawless installation we did. I promise to keep an eye on your system for many years to come and that it meets its calculated predictions. Kind regards Tarum Lloyd",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-21 21:11:45.147494",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/116755225980388978338/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}