{
    "place_id": "ChIJJ3LtPBR1hlQR6YmzsI-mh2k",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGallhQTN3RRAB",
            "reviewer_name": "Andrea Walker",
            "rating": 5,
            "review_text": "We were very happy with Ashton when we had a new furnace, heat pump and demand water heater installed. Their entire team showed great attention to detail and high quality workmanship throughout the whole process. Any questions we had were promptly addressed. I highly recommend this company. Special thanks to Mo for the detailed assessment/estimate, and Shahed and Japn for the installation. Service:",
            "published_at": "a week ago",
            "published_at_date": "2023-11-14 21:09:31.684642",
            "response_from_owner_text": "Thanks Andrea! Thank you for trusting us with your heat pump and tankless  water heater installation! Ill be sure to let the team know you left them a review, theyll be trilled to hear from you. Thank you again!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:31.684642",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117068374982266892495/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdnJiSEFREAE",
            "reviewer_name": "J X",
            "rating": 5,
            "review_text": "5 stars. I d give 10 if I could for Jason C. If you re in Vancouver give Ashton a call and ask for Jason C. Jason s not only efficient but honest and reliable. My parents had a leaking sink and two bad toilets. He fixed all their issues and even replaced the two bathroom faucets that were noisy in under 2 hours. Everything works great now and the price was reasonable for the work he did. Couldn t recommend Ashton and Jason C. enough. Truly a great experience",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-21 21:09:31.693884",
            "response_from_owner_text": "Thank you so much for your review, JX! Were so glad Jason was able to resolve your parents leaking sinks and toilets! Thank you for choosing Ashton!",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-21 21:09:31.693884",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 360,
            "total_number_of_photos_by_reviewer": 593,
            "reviewer_url": "https://www.google.com/maps/contrib/107078447103690108035/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacko2dkh3EAE",
            "reviewer_name": "Ka Wai Yip",
            "rating": 5,
            "review_text": "We had an issue with draining and tried to clear it ourselves, which ended with a dislodged sink. We called Ashton after searching online and they connected us with Carlos within a day. Carlos was professional with his work, fixing our sink and doing a major flush with the kitchen pipes. He also provided useful information that helped us understand our plumbing more. Appreciate the knowledge and the assistance!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:31.697218",
            "response_from_owner_text": "Hi Ka! Thank you for leaving Carlos a review! Were glad he was able to help reseat your sink! Plumbing problems are never fun, but were here to make repairs and painless as possible. Thank you again for choosing Ashton! I will be sure to let Carlos know you left him a review. Thank you, Ka!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:31.697218",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/107730574080413774013/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwME03Q2V3EAE",
            "reviewer_name": "Allan Chang",
            "rating": 5,
            "review_text": "Update: Bejau and Connor came back the last couple of days to finish up the installation. Just like before they re an amazing team and extremely great at what they do. While there was a bit of miscommunication that led to a bit of delay on the installation (set-up logistics mishap from not seeing the layout of my condo prior to the install team coming in), overall experience on everything else was superb. The reps on the phone were very nice and helpful. The install team that showed up were very professional, nice, and worked very hard to problem-solve the logistics issue while ensuring all strata codes are followed and I was fully satisfied with their proposed solutions (trust me, you dont want to fall out of compliance from Strata rules). Would highly recommend their services to anyone.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-21 21:09:31.700872",
            "response_from_owner_text": "Hi Allan, thank you for your review; we really appreciate it. Ac installation for Strat can often be difficult, but our office and field team have the knowledge and know-how to do it! I will be sure to let everyone in the office and the team that worked on your installation know what a great job they did for you. From everyone here at Ashton, thank you again for choosing us for your heat pump installation.",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-21 21:09:31.700872",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 55,
            "total_number_of_photos_by_reviewer": 260,
            "reviewer_url": "https://www.google.com/maps/contrib/114397914303990257810/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGalliUzBnRRAB",
            "reviewer_name": "Sunny Yum",
            "rating": 5,
            "review_text": "Ashton Technician Shawn Taylor came to perform a diagnostic of my heat pump which wasnt running. He figured it was a faulty thermostat and quoted for the supply and install of a new one. Ashton pricing is definitely pricey, but Shawn was a true professional and is able to find fix my problem quickly. He explained everything he was doing and involved me in his findings. He took the time to diagnose the issue properly unlike other technicians Ive had before who diagnosed wrong. He kept the workplace tidy and clean. He also offered a service membership which I signed up for considering it gave a 15% service discount immediately. Shawn is the guy you want to call if you have hvac issues, 10/10 service and expertise.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-10-31 21:09:31.704246",
            "response_from_owner_text": "Good morning Sunny, thank you for taking the time to leave us a review!",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-07 21:09:31.704246",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": 255,
            "reviewer_url": "https://www.google.com/maps/contrib/105956202872442081979/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaWI3M0R3EAE",
            "reviewer_name": "Tim Au",
            "rating": 5,
            "review_text": "Mo, Brent, Karan and Dominic and everyone else at Ashton was awesome. I had an electrical panel, tankless hot water, and a HVAC to be done over 3 days which I thought was impossible but they got it done in 2 and cleaned my place as well. Would strongly recommend.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:31.707156",
            "response_from_owner_text": "Hi Tim! Thank you for your glowing review of our installation team! Were so glad you decided to trust Ashton with your HVAC project!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:31.707156",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/106404775227686899146/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabS1LbVh3EAE",
            "reviewer_name": "Ganesh Kumar",
            "rating": 5,
            "review_text": "We had our split a/c installed by Karan and Dominic from Ashton. Both were very knowledgeable , did a very good job, and answered all our queries throughout the process and explained in a way we could easily understand. They were punctual and also finished the job earlier than promised & gave good advices on how to efficiently use the unit. Job well done and we are very happy with their service.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:31.711083",
            "response_from_owner_text": "Thank you, Ganesh! Its out goal to ensure all our clients fully understand their system and are 100% comfortable in the process! Thank you again for choosing Ashton for your heat pump installation. I will be sure to let Dominic and Karan see your review! Thank you!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:31.711083",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/116348281592037074044/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGME12bnVRRRAB",
            "reviewer_name": "Tatyanna SC",
            "rating": 5,
            "review_text": "5/5 would recommend and use their services again. Johnny was very informative and did the job fast and efficiently. He evaluated the issue, went to get a new toilet and installed all in the same day.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:31.713946",
            "response_from_owner_text": "HI Tatyanna! Thank you for the kind words! Johnny was so happy to hear from you this morning! Were so glad he was able o install your new toilet =).",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-07 21:09:31.713946",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/109660368107900902188/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadklfWllBEAE",
            "reviewer_name": "Tim Chaput",
            "rating": 5,
            "review_text": "I called Ashton for a quote, they sent Mo who was very knowledgeable about air flow. He designed a system that should greatly improve the comfort of our house. Their quote was the highest, but I felt the improvements were worth the cost. On Monday, I had a team of 4 desend on my home to begin the installation.  I felt their work was top shelf, very efficient. The left the work area very clean.  Big shout out to Mo Meherzad, Comfort Advisor and Installers: Karan, Japn and Dominic.  Thanks for the great job.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:31.716640",
            "response_from_owner_text": "Hi Tim! Thank you for your review of our installation team! I will be sure to let Mo, Japn, Karan and Dominic what an amazing job the did on your heat pump ac installation! Please dont hesitate to reach out to us if you have any questions or concerns. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:31.716640",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 143,
            "reviewer_url": "https://www.google.com/maps/contrib/100849376507612509590/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNTh1cWxRRRAB",
            "reviewer_name": "Bobbie Dhaliwal",
            "rating": 5,
            "review_text": "I had to turn to Ashton to fix a leak which another company was not able to repair.  The leak had sprung again within a week of their  - the other company s work. Ashton phone staff were very friendly and set up appointment quickly as the water was totally shut off due leak and task was assigned to Carlos. The leak was in awkward spot and Carlos had to come up with a creative way to get the job done. Carlos is a true professional I could easily see that this time the repair to the pipe was done correctly.  He also recommended to update poly b pipes and took the time to explain the reason for his suggestion, he encouraged me to do my own research so I could make an informed decision.   I felt at ease and Carlos was able to answer all my questions. All work has now been completed including replacement of pressure reducing valve and poly b pipes. Carlos has sound experience in his trade and truly cares about his customers.  Thank you Ashton and Carlos, I know I can count on you. :) Bobbie Dhaliwal",
            "published_at": "a week ago",
            "published_at_date": "2023-11-14 21:09:31.719352",
            "response_from_owner_text": "Thank you, Bobbie! Ill be sure to let Carlos know what a great job he did for you!",
            "response_from_owner_ago": "6 days ago",
            "response_from_owner_date": "2023-11-15 21:09:31.719352",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102119168137234253670/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1enBHaWNnEAE",
            "reviewer_name": "Stef Kapko",
            "rating": 5,
            "review_text": "I called 6 different plumbers and no one was available for almost a month since my issue wasnt an emergency. Ashton was able to send a tech out the next day. Brent arrived right on time to the minute. He was very professional and knowledgeable. He worked with the company for me to be able to use my warranty without me having to lift a finger. And best of all, there was no $200 charge for walking through my door like other companies charge. I will definitely be using Ashton from now on!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:32.506427",
            "response_from_owner_text": "Hi Stef, thank you for leaving a review for Brent!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:32.506427",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/113482275307905697079/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMmVpN2tBRRAB",
            "reviewer_name": "Carmen Pereira",
            "rating": 5,
            "review_text": "Bejan and Amir have been a great team and doing excellent job installing heat pump at my place. I have been advised at every step of the job, and Bejan was very personable and great in explaining the technical side of things to me and provided his expertise.  I actually met him when he was working on my neighbour s unit. Bejan was the reason I went with Ashton!  Both are always on time, and very tidy. They deserve 5 stars from me!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:32.511591",
            "response_from_owner_text": "Hi Carmen! Bejan and Amir were both trilled to hear from you this morning! Thank you so much for choosing Ashton for your Heat Pump Ac installation!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:32.511591",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/104800936824862540275/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNXVMdGhBRRAB",
            "reviewer_name": "Sophia Chang",
            "rating": 5,
            "review_text": "Sean P came for a furnace inspection. Super friendly and easy to talk to. He s thorough with his inspection, and most importantly, answered all my questions in ways that s easy to understand. He also took time to understand my needs/usage prior to making his recommendation on a new furnace based on the various models. Ashton would be my go to for all future plumbing/heating needs!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:32.515791",
            "response_from_owner_text": "Good morning, Sophia! Thank you for the kind words and thank you again for choosing Ashton!. Please do not hesitate to reach out to us if you have any questions about your home.",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:32.515791",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/106788934378209793077/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ1pUSGtBRRAB",
            "reviewer_name": "Mani P",
            "rating": 5,
            "review_text": "I had an issue with water draining very slowly in my kitchen sink. I didnt have any luck resolving it myself so I called a few places, Ashton being of one them to get an idea how soon I could have a technician take a look but also how they quote.  Every company quotes differently meaning some based on the job and then hourly or every half hour plus a call out fee, etc.  If theyre trying to resolve an issue without actually being on site thats where it could impact you financially when you get the invoice and they dont disclose what charges you may expect upfront.  Originally a tech was scheduled for later in the afternoon next day.  I received a call quite early this morning informing me they had a cancellation and a tech could be at my place in half an hour. Johnny B arrived within 30 minutes of that phone call and the service provided was definitely appreciated.  He took a look then informed me what he recommended should be done and gave me an approximate cost before proceeding.  He was upfront about the fact that it may take longer due to the fact that the pipes were clogged and depending on how far down the line the clog was it may take time to completely resolve the issue.  Again transparent and upfront with the potential for extra charges.  Once the clog was removed he tested a few times to ensure water was draining as it should.  Site was cleaned as if nothing ever happened.  As for the most important part the invoice - that was as quoted so no surprises.  This is the second time Ive used Ashton for plumbing services and both experiences for me were great.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:32.519846",
            "response_from_owner_text": "Thank you so much, Mani! Were so glad you were able to take advantage of our transparent pricing; no hidden costs! Johnny was trilled to hear from you this morning and wanted to say Thank you!.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:32.519846",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105867419489577262301/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNTUtcnFnRRAB",
            "reviewer_name": "Frazer Roland",
            "rating": 5,
            "review_text": "My mother-in-law recently had the pleasure of working with Johnny from Ashton Plumbing, Heating & Air Conditioning, and she cannot recommend his services enough. Johnny didnt just meet her expectations; he exceeded them in every way. She was first impressed by Johnny s punctuality. He arrived right on time, something that s unfortunately not common these days. He was immediately ready to assess the situation with her sink and furnace. After listening to her concerns, Johnny quickly diagnosed the issues. Her sink faucet was broken and her furnace was overdue for servicing. With expertise and skill that can only come from experience, Johnny walked her through his planned steps to resolve the issues, ensuring that she understood what needed to be done and why. Johnny wasted no time getting to work. He efficiently replaced the faucet, ensuring that the pipes were clear of any obstruction. Then he moved onto the furnace. she was genuinely impressed by how thorough he was in servicing it, even identifying a minor issue that could have turned into a major problem down the road. He fixed it right away, saving my mother-in-law future headaches and potential costs. After completing the job, Johnny made sure the work areas were cleaner than when he arrived. There were no traces of debris or any mess, which she greatly appreciated. Throughout the process, Johnny was communicative and friendly. He answered all her questions and even gave her useful tips on maintaining her plumbing and heating systems, which was invaluable advice that she plans to follow. Johnny s expertise, professionalism, and exceptional customer service make him a standout technician. She wholeheartedly recommends him and Ashton Plumbing, Heating & Air Conditioning for any household repair and maintenance tasks. Its service providers like Johnny who turn a potentially stressful situation into a seamless and even enjoyable experience. If youre in need of plumbing, heating, or air conditioning services, do yourself a favor and ask for Johnny. You wont be disappointed! Frazer Roland on behalf of Christa Thews",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:32.524009",
            "response_from_owner_text": "WOW! From everyone here at Ashton, we want to say thank you for leaving Johnny a review! Ive shared your kind words with the entire company and everyone here is so happy to hear Johnny exceeded your expectations and more! Thank you again for choosing Ashton and Johnny!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:32.524009",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/111352160649587591391/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGd1l1RjJ3RRAB",
            "reviewer_name": "Matt",
            "rating": 5,
            "review_text": "I was recommended Ashton Plumbing after several other plumbers were unable to assist in an extensive shower repair that needed to be done. Carlos was able to find a solution and did a great job repairing our shower. He was knowledgable and pleasant to deal with throughout the entire process. I would highly recommend Ashton Plumbing to anyone I know.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:32.528187",
            "response_from_owner_text": "Thanks Matt! Were so glad Carlos was able to solve your extensive shower issues! Ill be sure to let Carlos know you left him a review. Thank you again for trusting Ashton!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:32.528187",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106659667488114622852/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscm9iSThBRRAB",
            "reviewer_name": "Nicholas Dow",
            "rating": 5,
            "review_text": "I had an issue with a leaking pipe in my ceiling late Friday night.  I called Ashton and a plumber was onsite very quickly to help deal with the situation.  Jerry was amazing.  He was professional, knowledgeable and was quick to find the issue and help resolve it.  I highly recommend Ashton.  I had installed a heatpump through Ashton this year and cant say enough good things about this company.  And if you require any plumbing, I hope they send Jerry, you wont be disappointed.",
            "published_at": "2 days ago",
            "published_at_date": "2023-11-19 21:09:32.531417",
            "response_from_owner_text": "Thank you, Nicholas! Jerry was so happy to hear from you this morning and wanted to say Thanks!. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "a day ago",
            "response_from_owner_date": "2023-11-20 21:09:32.531417",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/104095259308986780901/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN2E2V1hREAE",
            "reviewer_name": "Armando Pereira",
            "rating": 5,
            "review_text": "Very good work, on time and job done with quality earlier than expected. This is the second job with Ashton within my family.  Thanks to Bejan, Amir and Vinnie. They delievered amazing professional work. Bejan is exceptionally attentive. Really appreciate you guys!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:32.534190",
            "response_from_owner_text": "Thank you for the review and photo of the team, Armado! Were so glad the team was able to get your new heat pump installed before the weekend! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:32.534190",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/107397627191543633103/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtc3NpUkhnEAE",
            "reviewer_name": "Janet McDonald",
            "rating": 5,
            "review_text": "The time was right to finally replace my old furnace & hot water tank. From start to finish (& it was 2 very long days due to our very long garage & strata requirements) Mo, Abhi, Dominic and Vinnie all played a role in making the whole process very smooth. The workmanship is excellent & their communication   - Noodles the cat followed them around trying to help, which any cat owner will tell you is a true test of character. Thanks again. Janet, Rex & Noodles Dec. 2020 Big thank you to Mo and everyone at Ashton for helping me keep the heat on. As you know, trust is more important than ever. & I would gladly hire them for work in my home. One more thing, as a single woman home owner you feel more vulnerable to being overcharged or being sold something you don t need. This is not the case with Mo. He helps you make the best decision for you. Thanks again, Janet",
            "published_at": "a week ago",
            "published_at_date": "2023-11-14 21:09:32.537266",
            "response_from_owner_text": "Hi Janet, were so glad Mo was able to resolve your heating issues. We pride ourselves in transparent service and were so glad you felt the same way. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-21 21:09:32.537266",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/104778547962632614806/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNWV6ZjNRRRAB",
            "reviewer_name": "Keith Daniel Leano",
            "rating": 5,
            "review_text": "Carlos helped me with my service request and he literally was in and out in about 20 mins and the job was well done and clean. He started by explaining the issue and provided the solution and a quote while considering the budget that I hoped for. Would definitely look at having Carlos and Ashton Plumbing for future services!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-14 21:09:32.540122",
            "response_from_owner_text": "Hi Keith! Carlos just wanted to say Thank you!. He read your review this morning and was so happy to hear from you again. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:32.540122",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108841611554393878432/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMjZ6QlZnEAE",
            "reviewer_name": "stewart woo",
            "rating": 5,
            "review_text": "Had the annual plumbing inspection as part of our No Problems Plan package. Great experience: - booking the appointment was easy, the call center staff are very friendly and responsive - got a call the morning of the service noting the tech was 40 minutes out and he showed up within the announced time - our tech, Johnny, was very thorough and professional. He answered all of our questions and gave us some good tips on maintenance. The written report provided is very comprehensive and is a good reference. - he explained the suggestions for any repair/preventative maintenance (which was also delivered by email so we could review and consider).",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:33.098209",
            "response_from_owner_text": "Hi Stewart! Thank you for taking the time to leave Johnny a review! Were so glad you took advantage of the free NPP annual inspections!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:33.098209",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111628618973684445985/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGa2FIZWNREAE",
            "reviewer_name": "denise halverson",
            "rating": 5,
            "review_text": "Excellent service by Johnny Bingham. Very friendly & efficient service. Had old leaky garburator removed & very nice re-plumbing job done.  Thank you!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:33.101771",
            "response_from_owner_text": "Good morning, Denise! Thank you so much for taking the time to leave Johnny a review and thank you again for choosing Ashton for your plumbing needs!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:33.101771",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106742203648330177011/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac3BMU2pBRRAB",
            "reviewer_name": "Chan Ed",
            "rating": 5,
            "review_text": "Johnny is just so detail oriented in taking care of my home.  He is 6 out of 5 stars.  I will definitely refer him to my family and friends.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:33.104592",
            "response_from_owner_text": "Thank you, Ed! 6/5 is what we love to hear! I will be sure to let Johnny know you left him a review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:33.104592",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/104990901031382488901/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdk5HaE5REAE",
            "reviewer_name": "Caryn Barbosa",
            "rating": 5,
            "review_text": "Brent was fantastic!!  Talented and knowledgeable :)  We had a plugged kitchen sink on the garburator side, he taught my husband a trick of the trade in case it happens again.  Thank you so much for sending him, he s a great asset to your team & a pleasure to deal with.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-14 21:09:33.107562",
            "response_from_owner_text": "Thank you, Caryn! Brent was trilled to hear from you this morning! Thank yo again for choosing Ashton!",
            "response_from_owner_ago": "6 days ago",
            "response_from_owner_date": "2023-11-15 21:09:33.107562",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104561867955742540418/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmRTaWh3RRAB",
            "reviewer_name": "Shirley Robertson",
            "rating": 5,
            "review_text": "Carlos and Vinnie were both extra ordinarily competent, hard working professional and super nice to deal with. I was especially pleased with their neatness. They used their little vacuum to clean as they went.  They did a great job of cleaning everything up afterwards. They even cleaned the walls!!!!!  They also took time to explain to me how everything worked once the installation was complete,",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:33.110404",
            "response_from_owner_text": "Thank you Shirley!  We love hearing from our clients and were so glad Vincent and Carlos were able to resolve your issues and do a little tidying up for you! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:33.110404",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111919441613829360377/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGX1lPZy1nRRAB",
            "reviewer_name": "Gjaymie Fandialan-Echavez",
            "rating": 5,
            "review_text": "Johnny Bingham has repaired our sink and the service was awesome!  Explained everything clearly and solved our sink problem. Highly recommend Ashton services for everything!",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-10-31 21:09:33.112527",
            "response_from_owner_text": "Hi Gjaymie! Thank you so much for the kind words! I will be sure to let Johnny know you left him a review =)",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-07 21:09:33.112527",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/111809761765599706233/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGX2JTc2RBEAE",
            "reviewer_name": "Lynne Davis",
            "rating": 5,
            "review_text": "We have had a long and satisfying relationship with Ashton, not only for annual service to our furnace and hot water heater but also quick responses when needed for emergency situations.  Arranging an appointment for the annual service has always been easy and compliant with our own schedule. For this years pre-Fall service of our furnace, aged 13, George and Sean arrived on time, and started promptly.  Try as they both might from every angle over hours that extended beyond the usual time for such a service, they could not get the furnace to fire up; only the fan was working.  So, with great regret on their part, they spoke about and explained in detail various replacement options.  Ultimately, we arranged for the purchase and delivery of a new furnace.   Despite the severely bad news, we enjoyed having George and Sean in our home, and very much appreciated their hard work, professionalism, friendly interaction with us, and expertise. Service: Heating system maintenance",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:33.114662",
            "response_from_owner_text": "Good morning Lynne, were so glad George and Sean were able to make the best out of an unfortunate situation with your furnace. Thank you for trusting Ashton with your home for so many years. Please do not hesitate to reach out to us if you have any questions. I will be sure to let George and Sean know what a great job they did for you!",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-07 21:09:33.114662",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113257690519902053943/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeU9mWEVnEAE",
            "reviewer_name": "Alison Petrie",
            "rating": 5,
            "review_text": "I recently had my AC and furnace serviced by Shawn at Ashton s Plumbing and Heating. I was very impressed with both Shawn and the office staff. I spoke to both Brandon and Lindsay and they were very friendly and helpful. For each appointment they updated me on the Shawn s arrival time so that I was able to stay at work until Shawn was about 30 minutes away. Shawn did a thorough inspection of my AC and furnace and went over the results in detail. He also gave me information on your Maintenance Program which I signed up for. It s evident that Ashton s makes great customer service a priority! Thank you  I m very happy to have a company that I can rely on for future services.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-21 21:09:33.117265",
            "response_from_owner_text": "Hi Alison, I showed the office and Shawn your review, and they all want to say Thank you!. We appreciate you taking the time to leave us a review; it means a lot to us to hear from our customers. Were so glad Shawn was able to give your AC and furnace a tune-up to ensure working order. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-21 21:09:33.117265",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115153035900909226278/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadGRlMGF3EAE",
            "reviewer_name": "Raj Lally",
            "rating": 5,
            "review_text": "I requested a service call for a low pressure water issue with our kitchen faucet. The plumber who came to our home was Johnny. He was prompt, courteous, very knowledgeable  and  professional. He even did an overall inspection of all of our faucets and prepared an invoice with three options so we could choose the service that best suited us. I appreciated the no- pressure and the peace of mind knowing I would not be billed until I gave the go ahead.  Ashton Plumbing has gained my full trust and I ll definitely be hiring them for  plumbing repairs or renos done in the future. Highly recommended!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:33.119922",
            "response_from_owner_text": "Hi Raj Lally, thank you for taking the time to leave Johnny a review! He was trilled to hear from you this morning. Were so happy he was able to provide you with a few options for your repair! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:33.119922",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105165076559375000824/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1X042VDR3RRAB",
            "reviewer_name": "Hiroko Stuart",
            "rating": 5,
            "review_text": "Outstanding! Arde our technician sales made an impression bye listening and educating us on our needs. He was previously an installer before moving into sales which made us more comfortable knowing he knew the technical side of it. Vinny, Connor and Eifion came to install our unit. Did a fantastic job with clean and precise workmanship. Shows they take pride in their craft. We would highly recommend Ashton and this team to anyone. The office staff was as equal. Overall cost, workmanship are exceptional!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:33.122420",
            "response_from_owner_text": "Thank you Hiroko! We hope youre enjoying your new AC!",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-10-31 21:09:33.122420",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109470602563129795232/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bzZMTXd3RRAB",
            "reviewer_name": "Naomi Linklater",
            "rating": 5,
            "review_text": "Called Ashton and set up an appointment to have someone come out to fix my kitchen faucet.  Got a call from the technician who had carefully reviewed my written concern about the low pressure for the cold water.  By asking quite specific questions, Carlos M was able to diagnose what needed to be done (new faucet) and rather than charging me to come out for an unproductive service call, he made suggestions about the best ways and brands to replace the faucet.  He also knew which faucet companies had the best warranties etc. It is reassuring as a homeowner to work with a company that has people who are both professional and honest.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:33.810436",
            "response_from_owner_text": "Hi Naomi, thank you so much for the glowing review for Carlos. He was beyond trilled to hear from you this morning and wanted to say Thank you!. Helping home owners during stressful times is out number one priority here at Ashton. Were so glad we could be of service!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:33.810436",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/110255257692096852143/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNnNHWFNBEAE",
            "reviewer_name": "Christine Kim",
            "rating": 5,
            "review_text": "Lindsay was excellent  for scheduling the service and after service follow up. Great customer service! I would return to this company thanks to her. Danny, technician was super excellent. Experienced and tried fix extra stuff for us. Super efficient with long time experience. He did the job in such a short amount of time. I would recommend this company. Thanks Lindsay and Danny!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:33.812953",
            "response_from_owner_text": "Hi Christine! Thank you very much for leaving some kind words for Danny and Lindsay! Were so proud of our office team and technicians! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:33.812953",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108335644881395304601/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4LXVlRUV3EAE",
            "reviewer_name": "Kerri Gardner",
            "rating": 5,
            "review_text": "Ashton installed a Mitsubishi heat pump and four units in our townhome. Mo Meherzad sold us the units and he was a delight to work with; he was very friendly and straight forward. He checked in on us throughout the installation and even afterwards, to make sure we were satisfied. Qasim Sarwar was our lead installer and he was great. He was a delight to have in our home each day: very friendly and hard working. Its a big job to install a heat pump in a townhome, because of all the shared walls and strata rules, but Ashton problem solved and made it work so we were happy with how it looked. Their customer service was top notch and everyone we dealt with was great. On top of that, the air pump works great so were happy customers!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-21 21:09:33.814804",
            "response_from_owner_text": "Hi Kerri! Thank you for the amazing review! Mo and the installation team were trilled to hear from you this morning, and were all so glad youre enjoying your brand new heat pump!",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-21 21:09:33.814804",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 124,
            "reviewer_url": "https://www.google.com/maps/contrib/101155543996942738933/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadTRUUWRREAE",
            "reviewer_name": "Demitri",
            "rating": 5,
            "review_text": "We had an urgent situation and our issue was diagnosed very quickly by Danny, who told us specifically what parts were required. Jerry then stepped in the very next day and did a speedy fix of our wall-hanging toilet. In the office, Carlos and Lindsay were helping to coordinate the whole thing. The team was able to understand the urgency of our matter and ensure that the job was completed on time and effectively. Thanks to everyone!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:33.817240",
            "response_from_owner_text": "Good morning Demitri! Thank you for the review for Danny and Jerry!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:33.817240",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102228921903217640025/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM2IzbTl3RRAB",
            "reviewer_name": "Virginia Evans",
            "rating": 5,
            "review_text": "Ashton has made me overcome my nervousness about plumbers.   Jason C has done excellent work here before, and today he and Johny Bingham handled some very old plumbing and got it all fixed up.  I appreciate their patience with an older home, their giving me the option of a higher quality product in fixtures and that they always cover their shoes in the house.  They are also patient in explaining things to this old lady.  Thank you Ashton.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:33.819135",
            "response_from_owner_text": "Thank you so much, Virginia! Were so glad Jason was able to put your nervousness at ease!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:33.819135",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100324564030115796880/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ODgzenJBRRAB",
            "reviewer_name": "C Wu",
            "rating": 5,
            "review_text": "We hired Ashton to install a new furnace and AC system in our home last week.  After the initial phone call, they sent a sales associate (comfort advisor) to our home to look at and advise what would best suit our situation.  Our advisor Arde was very patient in explaining and addressing our needs and concerns, which was the main reason we decided to go with Ashton. At our install, the lead technician Bejan was very professional and did a top-notch job.  He and his team were able to troubleshoot challenges that came up and explained things to us every time we had a question or concern.  Throughout the entire project, Bejan was very detail-oriented and did the job the right way.  Everything was done to code (or better), no cutting corners. Overall, the service was excellent from start to finish.  Its only been a few days, but the system is working perfectly, as a brand new system should.  I also liked the fact that they give you the price upfront, with no hidden costs.  What I paid at the end was exactly what was quoted at the beginning.  I 100% recommend Ashton and would use them again in the future. Services: Heating system installation , Install thermostat",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-21 21:09:33.821697",
            "response_from_owner_text": "Hi, C Wu! On behalf of Ashton, I would like to express our sincere gratitude to you for purchasing a new air conditioning system from our company. Your trust in us is truly appreciated, and we are thrilled to have you as a valued customer. At Ashton, we take immense pride in delivering top-notch products and services to our clients, and your decision to choose us for your air conditioning needs reaffirms our commitment to excellence. We understand the importance of a well-functioning and efficient cooling system, especially during the warmer months, and we are dedicated to ensuring your complete satisfaction. Our team of experienced professionals is known for their expertise in providing high-quality installations. They strive to go above and beyond to ensure that your new air conditioning system is installed with precision, efficiency, and meticulous attention to detail. We believe that a properly installed system is essential for optimal performance and longevity, and we are committed to delivering the best possible results. If you have any questions or require any assistance regarding your new air conditioning system, please do not hesitate to reach out to our customer support team. We are here to provide you with continued support and address any concerns you may have.",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-21 21:09:33.821697",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/109367093689830641628/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdW95M1dBEAE",
            "reviewer_name": "Jen Eric",
            "rating": 5,
            "review_text": "Awesome team   from Mo, their Sales rep, Admin folks and Installers/Technicians! They are all very professional and they know their stuff really well. Thank you Ashton team for the excellent service!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-21 21:09:33.825022",
            "response_from_owner_text": "Hi Jen! We would like to express our sincere gratitude for taking the time to leave a review of your recent furnace and hot water heater installation. It was a pleasure serving you and we are thrilled to hear that you were satisfied with our services. At Ashton, we strive to deliver the highest level of service and quality workmanship to our customers. We are grateful for your trust in our team and we hope to continue to exceed your expectations in the future. If you have any further questions or concerns, please dont hesitate to reach out to us. We appreciate your business and your feedback.",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-21 21:09:33.825022",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/112170591620096564852/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGeTlqQURBEAE",
            "reviewer_name": "Jenn S",
            "rating": 5,
            "review_text": "I had Mo visit today to check on a broken fan belt in our furnace, and he was able to point out several problems with several different appliances that need to be addressed.  Mo was courteous, professional, and kindly explained in laymans terms what the situation is with our various issues.  Thank you, Mo, for being so kind, knowledgeable, and understanding!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-14 21:09:33.828273",
            "response_from_owner_text": "Thank you Jenn! I was speaking to Mo this morning and he was so happy to see your review! Thank you so much for taking the time to give us some feedback!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:33.828273",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110177661848952855522/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdE9xc0NREAE",
            "reviewer_name": "William Shippam",
            "rating": 5,
            "review_text": "We are in the process of getting a heat pump installed with Ashton. Mo, our advisor and point of contact has been fantastic and we are very impressed so far with the customer service. Mo initially gave us a quote for 2 systems, including $15,000 of rebates and coordinating the additional quotes for the electric panel upgrade to 200amp (which maybe required depending on the property) and drywall repair. We planned to chose the cheaper system but by the time we received the additional quotes and agreed to proceed the cheaper heat pump was on back order and one of the rebates was full subscribed. Ashton kindly agreed to supply the higher priced unit for no extra charge with an additional discount due to the unexpected sudden loss of the rebate. Mo was always contactable and answered all our questions. Ashton and Mo have given us exceptional service. We are currently having the heat pump installed and so we plan to write another review once complete. Update: 3 months after initial installation (July 2023) of the heat pump. Our electric upgrade has now completed. It took about 3 months due to technical reasons from BC hydro. Most of the delays were waiting for inspectors to review the electric upgrades during the process and BC being available within their 3 month predicted completion date. Over all we were very happy with both the electric up grade and heat pump. Ashton returned to our property to complete a final inspection of all the work done. We are now only waiting for the city to provide permits for all the work which we have been told can take several months. The quality of the workmanship has been excellent and on the whole Ashton remained quick to reply to questions/emails throughout. I would recommend using their services and will continue to use them in the future. Service: Heating system installation",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-10-31 21:09:33.830993",
            "response_from_owner_text": "Thank you, William! Were so glad Mo was able to get you the maximum rebates possible for your heat pump installation! Your comfort and enjoyment if your new AC is our number one priority for us; were trilled we were able to upgrade your system with no extra costs! Thank you again for choosing Ashton for your heat pump installation!",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-21 21:09:33.830993",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/109732132308385475002/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MGNDYWtRRRAB",
            "reviewer_name": "Linghan Wang",
            "rating": 5,
            "review_text": "As a realtor I ve seen a lot of utility rooms. After this upgrade I believe my utility room is one of the best. Brent is not only a expert but also a artist. His work is not only professional but also beautiful! I ll definitely recommend him and his team to anyone who wants to upgrade their heating system.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-10-31 21:09:33.833444",
            "response_from_owner_text": "Thank so you much, Linghan! Were so happy we recognize the quality of installations!",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-10-31 21:09:33.833444",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102266826962022215471/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGanJEdVl3EAE",
            "reviewer_name": "Sue Steele",
            "rating": 5,
            "review_text": "I wasnt home but my son was & he says Sean did a great job fixing the problems in a really fast turn around time. When I got home. The was finally great on the main floor! Thank you so much Sean! Much appreciated!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:34.554027",
            "response_from_owner_text": "Thank you, Sue! Glad he was able to get your heat up and running again!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:34.554027",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106228546431130661917/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMVpfZFpBEAE",
            "reviewer_name": "Bradley Rowell",
            "rating": 5,
            "review_text": "Huge thanks to vinnie, Jacob, jay lin and abhi for the great install on our new furnace and central air. Excellent group of guys and amazing customer service and workmanship. Thanks again guys ! Services:",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:34.557063",
            "response_from_owner_text": "Hi Bradley! Were so glad you got the meet our incredible install team. Vinnie, Jacob and Abhi were over the moon to hear from you. Thank you for leaving them a review, it means a lot to everyone here! Thank you again for choosing Ashton and enjoy your new heat pump ac system!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:34.557063",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/100260782567464829009/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaek9hSW53RRAB",
            "reviewer_name": "Gaurav Mehra",
            "rating": 5,
            "review_text": "Couldnt be happier with my new mini split system Karan and Abhi from Ashton took the time to install my unit on time, answered all my questions, and clean up all the dust / debris before leaving My main concern was how the refrigerant and power lines would be run through my unit but the installers came up with a great route where it looks as non invasive as possible Definitely recommend Ashton and their team to get this done, best money I ever spent Services: Installation , Heating system installation , Install AC",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:34.561188",
            "response_from_owner_text": "Good morning Gaurav! Thank you for your review and photo of your new heat pump AC installation! Were so glad you noticed the quality of your installation! We take pride in every project and treat your home as if it was our own. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:34.561188",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/111098336493337268114/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNGRDUklBEAE",
            "reviewer_name": "Andrea Craig",
            "rating": 5,
            "review_text": "Keegan was great! He took the time to explain the issue with our thermostat and showed us how it would be resolved quickly. Keegan provided excellent service - he was timely, professional, and offered thoughtful advice too. Keegan was kind to our noisy dog and curious preschooler also!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:34.564855",
            "response_from_owner_text": "Keegan says he loved your dog! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:34.564855",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109927647486423168863/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dUxtbzh3RRAB",
            "reviewer_name": "Karim Suleman",
            "rating": 5,
            "review_text": "I was recommended to Ashton from a friend of ours, and from the initial consultation with ARDIE it was top customer service quality.  We did a two-stage upgrade, first was our old furnace which needed to be replaced and technicians CONNOR and SHARED were professional, thorough, and most importantly did a quality installation.  Our second part was to upgrade our hot water tank, done by JAPN and KARAN.  Both were once again extremely competent and professional.  All communication with Ashton from the set-up consultation to the completion of the project was wonderful.  Prices were set up to meet our needs and there was no pushy salesperson.  I highly recommend Ashton, and the technicians mentioned above.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:34.568886",
            "response_from_owner_text": "Hi Karim, Arde just wanted to say Thanks!. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-10-31 21:09:34.568886",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116909503038301262543/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbk9PZHNnRRAB",
            "reviewer_name": "Sarah Lewis",
            "rating": 5,
            "review_text": "Johnny did a 12/10 job in replacing our kitchen sink hose! He specially ordered in the part for our old sink and efficiently fixed our problem. He was very friendly, helpful, and did a great job explaining where our trouble issues were coming from. He even helped us tighten up some other parts of our sink at the end of his work. Great service and job!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:34.572037",
            "response_from_owner_text": "Hi Sarah, thank you so much! Johnny was trilled to hear from you!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-21 21:09:34.572037",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117051076791739840395/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGa2RXM2lnRRAB",
            "reviewer_name": "E. Dobrzensky",
            "rating": 5,
            "review_text": "Ashton has a well deserved reputation of excellency in costumer care and professional services. Lindsay von Hockauf is a welcoming voice on the phone and Jerry Chen is a competent and diligent technician for the on site job. Service:",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:34.574375",
            "response_from_owner_text": "Hi E, thank you for the kind words. Our customer service team are the un-sung heroes here and were so glad you noticed! Ill be sure to let both Lindsay and Jerry know what a great job they did for you. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:34.574375",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102799555525613943245/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKemFPNzl3RRAB",
            "reviewer_name": "Gillian Jaffer",
            "rating": 5,
            "review_text": "This was our first time using Ashton and decided to go with them, based on the reviews. Very happy that we did ~ Jason was professional, efficient, courteous and did an excellent job on both occasions.  We very much appreciated the service we received and will have no hesitation in using Ashton Plumbing in the future! Appreciated the Shoe Booties  too!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-21 21:09:34.578252",
            "response_from_owner_text": "Hi Gillian, it was our pleasure! Its our goal to deliver a 5 star service, and that means treating your home as if it was our own. =) Thank you again for choosing Ashton, I will be sure to let Jason know what an amazing job he did. =)",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-21 21:09:34.578252",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116107801154514501459/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGX2FDMndnRRAB",
            "reviewer_name": "Tessie Camangeg",
            "rating": 5,
            "review_text": "Johnny was wonderful. He did the right thing and helped us solve our plumbing issues.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-10-31 21:09:34.581614",
            "response_from_owner_text": "Thank you, Tessie!",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-10-31 21:09:34.581614",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/114240109471771608219/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGemFiRUxnEAE",
            "reviewer_name": "Chad Fox",
            "rating": 5,
            "review_text": "Mo, Vinnie and Abhi at Ashton were helpful from start to finish. I was very specific with how some of the work needed to be done when installing my heat pump and they delivered where it was possible. Glad to have Heat and AC now!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-14 21:09:34.584825",
            "response_from_owner_text": "Good morning Chad, thank you for the kind words! Were so glad youre enjoying you new heat pump!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:34.584825",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/105708495092717646726/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaX0xfay1BRRAB",
            "reviewer_name": "Dale M",
            "rating": 5,
            "review_text": "Once again, Ashton Plumbing, Heating & Air Conditioning came through when I needed them. Jason was friendly, efficient and knowledgeable about my options for repair or replacement. He did the job in record time, in spite of the number of nasty surprises he encountered. He left the area cleaner than when he started and I could not ask for anything more. Ashton has been, and continues to be my plumbing provider of choice.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:35.248185",
            "response_from_owner_text": "Good morning Dale, thank you so much for the review! Were so happy that Jason was able to take care of your plumbing issues! Thank you for choosing Ashton!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:35.248185",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115418111141305121280/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMXVpR1R3EAE",
            "reviewer_name": "Jim F.",
            "rating": 5,
            "review_text": "Keivaan & Jayden came to service our units. There were very professional and answered all of my questions as I am not to familiar with our system. Ashton should be so lucky to have these two men working for them! Thanks again.",
            "published_at": "4 days ago",
            "published_at_date": "2023-11-17 21:09:35.253200",
            "response_from_owner_text": "Thank you Jim and thank you for the photo! Keivaan and Jayden were both so happy to hear from you this afternoon! Thank you again for choosing Ashton and have a wonderful weekend!",
            "response_from_owner_ago": "4 days ago",
            "response_from_owner_date": "2023-11-17 21:09:35.253200",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/105588534512286497685/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNnFxcmxBRRAB",
            "reviewer_name": "Antony Mannie",
            "rating": 5,
            "review_text": "Johnny was an excellent representative of Ashton plumbing. Very prompt, polite, informative. Explained what was needed and spelled out all our different options with extensive quotes. He was a delight to deal with! Very well done!!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:35.256999",
            "response_from_owner_text": "Thank you, Antony!  Johnny on the spot!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:35.256999",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/110391473985505671043/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadWZXbFJREAE",
            "reviewer_name": "tyler smith",
            "rating": 5,
            "review_text": "Ashton heating and cooling did a great job installing my HVAC system. The team did an outstanding job taking care that everything is running smoothly. One of your service technicians in particular, Connor S, goes out of his way to ensure all jobs he performs are completed to the customers full satisfaction; he is polite, professional, meticulous, knowledgeable, and dedicated to his work. Ashton s heating and cooling should be proud to have such great employe working for them!! Services:",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:35.261259",
            "response_from_owner_text": "Hi Tyler! Thank you for the glowing review. Connor was trilled to hear from you this morning and wanted to say Thank you!. Were so proud to have Connor on our team! Thank you again for choosing Ashton for your heating and cooling project; please do not hesitate to reach out to us if you ever have any questions!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:35.261259",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 15,
            "reviewer_url": "https://www.google.com/maps/contrib/118177861540499923860/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbFlQRUd3EAE",
            "reviewer_name": "Andrei David Radu",
            "rating": 5,
            "review_text": "The quality of work from Ashton was 10/10. The two technicians specifically, bejan and jack were amazing . They were extremely tidy, respectful and willing to explain installation process for us. We will definitely be recommending Ashton and specifically these two technicians to our friends and family. 5 star rating for them ! Thank you !",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:35.266060",
            "response_from_owner_text": "Thank you, Andrei! Were so glad youre enjoying your new heat pump!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:35.266060",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105775651146702995368/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1ME1TQWx3RRAB",
            "reviewer_name": "Brandi Kirk",
            "rating": 5,
            "review_text": "Shawn and Keivaan were amazing. Not only did they give great advice about their services and how to make the most out of it, but they were super friendly and professional and took the time to answer all our questions properly. Would be happy to have them come back to help us in the future.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:35.268794",
            "response_from_owner_text": "Good morning, thank you so much for leaving a review for Shawn and Keivaan. Keivaan just joined our team and was trilled to hear from you this morning. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:35.268794",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109082016577170397248/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bmV2WlJREAE",
            "reviewer_name": "Sandeep Edara",
            "rating": 5,
            "review_text": "I had a fantastic experience with Rajs plumbing service at my house. His expertise and professionalism truly impressed me. Raj arrived promptly and assessed the plumbing issue with precision. He explained the problem and the necessary repairs in a clear and understandable manner. Throughout the process, Raj demonstrated exceptional skill, completing the work efficiently and effectively. Not only did he fix the problem, but he also provided helpful advice to prevent future issues. I greatly appreciate Rajs dedication to his craft and his commitment to customer satisfaction. I highly recommend his services to anyone in need of a reliable and skilled plumber.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-21 21:09:35.271722",
            "response_from_owner_text": "Hi Sandeep, thank you so much for the review! We love hearing from our customers! I will be sure to let Raj see the review and let him know how great of a job he did for you!",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-21 21:09:35.271722",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/107968028446294006998/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdm9DZENREAE",
            "reviewer_name": "JONATHAN RUBENSTEIN",
            "rating": 5,
            "review_text": "Plumber Johnny was thorough and able, performed full plumbing inspection, drain clearing, water pressure check and analysis, repaired two leaky valves, repaired garburator; A/C man Vic who changed the filter was quick and helpful, Heating expert Klaus was extremely knowledgeable, efficient and effective.  All were very personable and professional.  All 5 stars! Office staff Erin and Ellen were friendly, courteous, efficient and were great at follow up.  5 stars for them, too. We also had additional plumbing work done by Danny a few weeks later, when our toilet started leaking.  Danny was also prompt, friendly, helpful, efficient and professional.  He kept at, including a trip out for a seal.  5 stars!  Thank you, Danny! Ashton have been fantastic.  We will use them now for all our household work.  Thank you, Ashton! Services: A/C system maintenance , A/C filter replacement ,",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:35.274429",
            "response_from_owner_text": "Thank you for the big shout-out Jonathan! I will be sure to let the team know what an amazing job they did for you! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:35.274429",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105558995969666407757/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMzhhN3hnRRAB",
            "reviewer_name": "Margrit Himmel",
            "rating": 5,
            "review_text": "Furnace delivery on time with status call by Arde prior to delivery. No wondering where things were at. Outstanding service installation by Vinnie and Abhi V. Would definitely recommend this company for furnace installation. Personal walk through after installation was much appreciated. Cleaned up everything on leaving! Well done!!! Very thorough! Services:",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:35.277928",
            "response_from_owner_text": "Good afternoon Margrit! Thank you for the kind words and trusting us wth your furnace installation! Were so glad you were happy with our service from start to finish! Thank you again!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:35.277928",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110152737959790273143/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMG9mZjJ3RRAB",
            "reviewer_name": "T J",
            "rating": 5,
            "review_text": "Johnny was on time and very professional in his inspection of our plumbing and drainage. He answered all questions and left us with a series of options for how we could address a few issues. No hard sell or anything like that which was good to see. We would 100% recommend Johnny and Ashton to anyone who has plumbing or drainage needs.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:35.281254",
            "response_from_owner_text": "Thank you, TJ! Johnny was trilled to hear from you this morning!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:35.281254",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107909568397888153350/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMl91TVBnEAE",
            "reviewer_name": "kaiya senecal",
            "rating": 5,
            "review_text": "I cant say enough about Carlos! Hes an absolute lifesaver. When we were dealing with a troublesome shower head leak, Carlos came to our rescue. Unlike a previous contractor from a different company who quoted us an exorbitant price for water damage repair, Carlos not only fixed the issue swiftly but also educated us on how to prevent future problems. As young first-time renters with limited experience, Carlos went above and beyond to guide us, offering invaluable advice on maintaining our plumbing and protecting ourselves as renters. His kindness and fair pricing were truly remarkable. Were incredibly grateful for Carloss expertise and professionalism. Hes our go-to for any plumbing issues in the future. Thank you, Carlos, for saving the day!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:36.112465",
            "response_from_owner_text": "Hi Kaiya! I shared your review with our office and field team today and they were so happy to hear from you. Were all so glad Carlos was able to assist you during a stressful time.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:36.112465",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117470835633521682810/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGM09XS3pRRRAB",
            "reviewer_name": "Ian Hall",
            "rating": 5,
            "review_text": "After many delays in a warranty replacement hot water tank; Brent from Ashton came and did a thorough job of installing the new tank and communicating all the information to me. I really appreciate that the company followed through even though it was very costly to them.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-10-31 21:09:36.116147",
            "response_from_owner_text": "Hi Ian, it was our pleasure! Our goal is to ensure you are 100% happy with your installation!",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-10-31 21:09:36.116147",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116962095913179611923/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1M1B6RGVREAE",
            "reviewer_name": "EWu",
            "rating": 5,
            "review_text": "We had an air conditioning/ heat pump installed in our condo. It was a big job to install in 2 rooms. Ashton sent a whole team to work on the project. They were very efficient and professional. Big shout out to the team: Connor S., Vinnie, Dominic, Bejan and Shahed. Thank you!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:36.120633",
            "response_from_owner_text": "Thank you Ewu! The entire team was trilled to hear from you today!",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-10-31 21:09:36.120633",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116787159660062845611/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MWZpcld3EAE",
            "reviewer_name": "Jason Wong",
            "rating": 5,
            "review_text": "Shawn and George came by to inspect and clean my homes furnace.  They were both very professional and knowledgeable.  They took the time to clean the furnace well and highlighted any potential issues that I might need to fix in the future.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:36.124871",
            "response_from_owner_text": "Hi Jason, thank you for the kind words! Were so glad George were able to service your furnace and leave you with some helpful tips!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:36.124871",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115383064357498818778/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaejVmaDRRRRAB",
            "reviewer_name": "Sandra Osiowy",
            "rating": 5,
            "review_text": "Had a technician from Ashton come to our condo to tighten a kitchen faucet this morning.  I am happy with the quick and efficient job he did,  thanks Ashton for your fine service.   I highly recommend Ashton Plumbing, Heating and Air conditioning.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:36.127858",
            "response_from_owner_text": "Thank you Sandra!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:36.127858",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110368739449393697726/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1X2RqZzJRRRAB",
            "reviewer_name": "Jim Horvath",
            "rating": 5,
            "review_text": "A truly wonderful experience from beginning to end with our new climate control system. Vinnie and Connor are exceptional technicians and we appreciate your efforts. Thanks Sean and Ashton for accommodating our requests. We ll done! Services: Heating system installation",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-10-31 21:09:36.131892",
            "response_from_owner_text": "Thank you, Jim!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:36.131892",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106622157485528425411/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabXVXM1BREAE",
            "reviewer_name": "Eric Zukowsky",
            "rating": 5,
            "review_text": "After requesting several changes to the service date and time, Ashton finally came through by sending a technician within the hour. In addition, when a part was required, Ashton arranged for delivery to the door within 30 minutes in order for the technician, Keegan to complete the repair. Impressive. Keegan was very professional and kept us informed on the progress of his maintenance work and completed the work as expeditiously as possible. We are very pleased with Keegan s work.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:36.135286",
            "response_from_owner_text": "Thank you, Eric! Were so glad Keegan was able to assist you with your repair! Thank you so much for choosing Ashton!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:36.135286",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/110761967964465050786/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMjRmR253RRAB",
            "reviewer_name": "Adri Kellerman",
            "rating": 5,
            "review_text": "Carlos Marquez is the best plumber ever! We had a plumbing nightmare, and Carlos saved the day. He fixed the problem super quickly and also dropped some advice on how to prevent this mess in the future. Carlos is not only a pro, but hes also super chill and friendly, which made the whole thing way less stressful. If you ever need a plumber who knows their stuff and leaves you feeling relieved, Carlos is your guy. Also, the receptionist Lindsay did everything she could to get us a same-day appointment when she heard our stress. If youre looking for plumbing help, definitely go to Ashton!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:36.138475",
            "response_from_owner_text": "Hi Ardi, thank you for your review and thank you for the shout-out to our customer service team (Lindsay)! We was over the moon to hear from you this morning!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:36.138475",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/116026463409598346468/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZzR1di1BRRAB",
            "reviewer_name": "Krista",
            "rating": 5,
            "review_text": "Shawn did a great job servicing both our boiler & AC system. He was thorough & a great problem solver looking at potential leak prevention. He wasn t in a rush, answering all of our questions. We are very happy with the work done.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:36.141655",
            "response_from_owner_text": "Good morning Krista! Were so glad you were happy with Shawns service on your AC and boiler! Thank you again for choosing Ashton, and please dont hesitate to reach out to us if you have any questions!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:36.141655",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110238252117116256286/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwclpIRnVnRRAB",
            "reviewer_name": "K W",
            "rating": 5,
            "review_text": "Had my central air conditioner checked up by Shawn T. and couldnt be more satisfied with his service. Not only did he do his work, he took the time to explain to me any questions that I have regarding my A/C unit. Highly recommend him and Ashton.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:36.144708",
            "response_from_owner_text": "Good morning, KW! I will be sure to let Shawn know you left him a review! Thank you for choosing Ashton for your AC repair!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:36.144708",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/107400291568772794307/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MnREVnVnRRAB",
            "reviewer_name": "atahobbi",
            "rating": 5,
            "review_text": "I called Ashton plumbing after tried a few other highly advertised services for our heating was suddenly stopped working and the other companies left us with quite a few cold nights, and while still waiting for their service appointment! Ashton company was the only one sent the real same day repair. The technician, Tyler, also is very polite and professional. Thanks",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:36.916533",
            "response_from_owner_text": "Hi Atahobbi! Thank you for taking the time to leave us a review! Were so glad we were able to get your furnace up and running again! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:36.916533",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104979830390215610849/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Mi11QlBREAE",
            "reviewer_name": "Jane",
            "rating": 5,
            "review_text": "Keegan arrived in the expected time frame and was both friendly and professional. He quickly analyzed the problem with my furnace and repaired it, and also gave it a thorough check up. He explained all his findings to me which I appreciated. I m very satisfied with the encounter and with Ashton s overall service, and will definitely use them  again.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-21 21:09:36.921007",
            "response_from_owner_text": "Hi Jane! Thank you for leaving a review for Keegan. Were so glad he was able to get your system up and running again! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-21 21:09:36.921007",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/106300538715888740072/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNk1Lb2NREAE",
            "reviewer_name": "Michael Matyas",
            "rating": 5,
            "review_text": "Water main broke at my neighbours home at night while they were away and I was taking care of their place.  Contacted Ashton and they were their first thing in the morning.  The technicians Johnny and Sim were friendly, professional, efficient and tidy.  They got the job done and communicated next steps and answered any questions happily without hesitation.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-21 21:09:36.925246",
            "response_from_owner_text": "Thank you, Michael! Broken water mains are never fun, but Im so glad we were able to get it resolved for you in a timely manner. I will be sure to let Johnny and Sim know what a great job they did for you. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-21 21:09:36.925246",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/106320360625383337355/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMl9fNERREAE",
            "reviewer_name": "Kathryn Langsford",
            "rating": 5,
            "review_text": "I had Ashton come by to check my furnace after multiple years of neglecting to do so. Shawn was polite, on time, very informative and helped me sign up for a package that will have us covered for furnace/AC inspection from here on in. Highly recommend!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:36.928864",
            "response_from_owner_text": "Hi Kathryn, thank you for the kind words! I will be sure to let Shawn know you left him a 5 star review!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:36.928864",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105041257659342704276/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab0lyai1RRRAB",
            "reviewer_name": "Nadia Marchant",
            "rating": 5,
            "review_text": "Ashton team have done a great job replacing our furnace and hot water tank. Shai listened to what we wanted and gave us cost-effective options to choose from. Qasim and Carlos arrived on time and explained everything they were doing along the way. Everything has been cleaned up perfectly. Great service, very professional.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:36.932963",
            "response_from_owner_text": "Good morning, Nadia! Thank you for taking the time to leave Shai and the install team a review! Were so glad we were able to find a furnace replacement solution that was right for you!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:36.932963",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104344769481031665008/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNWVfNGhRRRAB",
            "reviewer_name": "Donna Sigurdur",
            "rating": 5,
            "review_text": "Fergus and Jacob were at my home today installing my new furnace.  Such professional young men.  The job they did was phenomenal and they were so tidy afterwards cleaned up the entire area.  Would most definitely recommend these two men and Ashton Plumbing, Heating & Air Conditioning.  Thank you again for such a job well done.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:36.936359",
            "response_from_owner_text": "Thank you, Donna! I will be sure to let both Jacob and Fergus know what a great job the did! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:36.936359",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101460638447548783536/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a05qb1B3EAE",
            "reviewer_name": "Jack Siu",
            "rating": 5,
            "review_text": "Danny from Ashton was knowledgeable, friendly, and professional. He explained things to me in layman s terms; he was responsive and patient to all my questions. He was also very thorough in the post job clean-up.i also want to recognize the great work done by Johnny who was diligent, and response to my requests. This was a big job that took them five days to replace my sewer and storm drainage pipes. They had to work in an area populated with trees and shrubs. They were careful and only removed the minimal amount of tree branches when they hadn t no other choice.",
            "published_at": "4 days ago",
            "published_at_date": "2023-11-17 21:09:36.939718",
            "response_from_owner_text": "Hi Jack, thank you for the amazing review for Danny! I will be sure to let him know you left a review! Thank you again for choosing Ashton.",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-21 21:09:36.939718",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/118160230640773266997/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsc0lDYVZREAE",
            "reviewer_name": "Michael Lingam",
            "rating": 5,
            "review_text": "Recents we installed a heat pump in our home, Karan, Jas and Aghi worked really hard to make sure everything was working well and that we wouldn t be without heat that evening, since we have an elderly person with us. We really appreciated your care and great work thanks",
            "published_at": "a week ago",
            "published_at_date": "2023-11-14 21:09:36.942755",
            "response_from_owner_text": "Thank you for taking the time to leave us a review, Michael!",
            "response_from_owner_ago": "6 days ago",
            "response_from_owner_date": "2023-11-15 21:09:36.942755",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102549666061531803329/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cGJxRmN3EAE",
            "reviewer_name": "Ian OBriain",
            "rating": 5,
            "review_text": "Arde, Vinnie, Connor S. & Eifion were great.  Theyve been working hard all day to get the new furnace installed and up and running.  Their attention to detail, keeping me informed of their progress and instructing me how to use the new thermostat was invaluable plus the work area was left spotless, you couldnt even tell a crew had been working at my home all day.  Ill definitely be spreading the word about the crew and Ashton Plumbing Heating Air Thank you, Ian OBriain Vancouver BC V5V 1T3 Services: Installation , Heating system installation , Install thermostat",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-10-31 21:09:36.946027",
            "response_from_owner_text": "Hi Ian, were so glad youre enjoying your new furnace! Ill be sure to pass on your message to the team. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-10-31 21:09:36.946027",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114502706351668098155/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocjlPY0d3EAE",
            "reviewer_name": "Judy Wind",
            "rating": 5,
            "review_text": "The work was done at my moms condo and the technicians Del and Jerry were very courteous and professional. Del also installed a new faucet and we absolutely love it Del also replaced shut off valves for my sinks and fixed my shower at my condo in April.  Thanks Del! Services: Faucet installation",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-21 21:09:36.949172",
            "response_from_owner_text": "Hi Judy, thank you for the kind words! Were so glad everyone was happy with our service! Thank you both for trusting Ashton!",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-21 21:09:36.949172",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/115468549740602826459/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN183ajRnRRAB",
            "reviewer_name": "Giulio Tarsitani",
            "rating": 5,
            "review_text": "Arde, Karan, Vinnie, Dominic and Abhi V. did a great job installing a two zone system in my condo. Great service",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:37.703384",
            "response_from_owner_text": "Thank you Giulio! Enjoy your new heat pump ac!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:37.703384",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/111869337352719146327/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwejYyYnpnRRAB",
            "reviewer_name": "Pugsies N",
            "rating": 5,
            "review_text": "We re very happy with the installation of Ductless mini split air conditioners and heat pump at our house. The work that Qasim, Carlos and Madur done is thorough and very clean install. The bonus is they cleanup after their work which we never had any technicians or contractors ever done very well. They re highly technical and professional and worked very hard to get the installation done on time. I would definitely use their service again in the future.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:37.708094",
            "response_from_owner_text": "Hi Pugsies! Thank you for noticing! We clean up after each day because we know your home is important to you, and we would want to be treated the same way. Were all so glad were enjoying your new air conditioner heat pump! Thank you again for choosing Ashton! I will be sure to let the team know what a fantastic job they did for you.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:37.708094",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101291859961166057264/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGa1pHRmZBEAE",
            "reviewer_name": "Carolyn Chang",
            "rating": 5,
            "review_text": "I like using them because they always think on behalf of the home owners when working on a site. Keivaan was great!  Gave a thorough look at my furnace and provided valuable suggestions on how to better maintain my unit. Service:",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-10-31 21:09:37.712095",
            "response_from_owner_text": "Good morning Carolyn, Keivaan was trilled to hear from you this morning. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "3 weeks ago",
            "response_from_owner_date": "2023-10-31 21:09:37.712095",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113695302612941062580/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4akxIUWRREAE",
            "reviewer_name": "StephenGray Vision",
            "rating": 5,
            "review_text": "This was heat pump installation. Ashton service group is an excellent company and the whole procedure was done efficiently and with top quality professionalism. The two on-site installers, Karan Sanbhu and Dominic Jatta were both excellent and easy to deal with. The above was from June 2023. Today, November 10, 2023, senior technician Tyler was here to help me figure out the complexities of the thermostat for our Mitsubishi heat pump system. Tyler was great. Hes thoroughly versed in all the technical aspects of the system, and he was cheerful and gracious. Services: Installation",
            "published_at": "a week ago",
            "published_at_date": "2023-11-14 21:09:37.716954",
            "response_from_owner_text": "Thank you so much Stephen! Were so glad Tyler was able assist you with your heat pump! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "6 days ago",
            "response_from_owner_date": "2023-11-15 21:09:37.716954",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114549410689039181772/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKM0lpNjhBRRAB",
            "reviewer_name": "Vishal Singh",
            "rating": 5,
            "review_text": "We had a shower drain that was completely clogged. Dan from Ashton plumbing is a complete expert and a thorough professional. He communicated professionally, explained the issue and rectified it. Thanks to Ashton plumbing and the person taking my calls there, she was courteous and professional and ensured that all the necessary details are captured and that a professional was assigned at the earliest. Thank you!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-21 21:09:37.720590",
            "response_from_owner_text": "Thank you so much, Vishal! It was our pleasure to help you with your clogged drains. I will be sure to let Danny and the call team know what a great job they did for you. Thank you again for choosing Ashton!",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-21 21:09:37.720590",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 27,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/100272091565577401107/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaVBqVVFREAE",
            "reviewer_name": "Timothy Herron",
            "rating": 5,
            "review_text": "We have had a Mitsubishi heat pump installed.  The installation by Jensen and Eugene was superb.  Theyre professional, courteous, know everything about heat pumps, and they engineered a solution for the limited space we had to work with.  Theyre a great team and I recommend them enthusiastically.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:09:37.723183",
            "response_from_owner_text": "Hi Timothy, thank you! I will be sure to pass on your kind words to Jensen and the install team. Were so glad you love you new AC system! Thank you again for trusting Ashton with your installation!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-21 21:09:37.723183",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/109172244148135912839/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaUpEWDlBRRAB",
            "reviewer_name": "Mary Mah",
            "rating": 5,
            "review_text": "Shawn was polite and professional. He listened to my issues patiently and was empathetic. He did maintenance work on my systems and assured me they were in great shape. Thank you Shawn.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:37.727268",
            "response_from_owner_text": "I wanted to take a moment to express my sincere gratitude for choosing Ashton for your HVAC repair needs. It has been a pleasure serving you, and we truly appreciate your trust in our services. At Ashton, we are committed to providing top-notch HVAC solutions, and your satisfaction is our ultimate goal. Your choice to work with us not only supports our business but also reaffirms our dedication to delivering exceptional service to our valued customers like you. If you ever have any questions, concerns, or need further assistance, please dont hesitate to reach out to us. We are always here to help. Once again, thank you for choosing Ashton. We look forward to serving you in the future and ensuring your HVAC system continues to operate efficiently.",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:37.727268",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107793324684287965056/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cDZYMHdnRRAB",
            "reviewer_name": "Maria S. M.",
            "rating": 5,
            "review_text": "Jason came over and gave me an estimate the day before  super nice like everyone else in Ashton. Karan and Japn were the dream team who came to the rescue the following day and install the hot water tank. There were so nice, profesional, and I will definitely recommend them :) Great job guys",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:37.730317",
            "response_from_owner_text": "Thank you so much, Maria!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:37.730317",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/115871214787867003319/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOVktOTNBRRAB",
            "reviewer_name": "Sarosh Muncherji",
            "rating": 5,
            "review_text": "I had retained Ashton to help select an appropriate HVAC system for our home. Ashton staff went through the entire process very professionally, right from preliminary sizing and assessment through to installation and commissioning. Shout out to Arde for his excellent engineering and professional advice. And a very special mention of the installation crew, ably led by Vinnie (Vincent) and wholeheartedly and professionally supported by Dominic and Jag. They did an amazing and very neat job, especially considering the complexities of an older home.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-21 21:09:37.733330",
            "response_from_owner_text": "Thank you so much, Sarosh! I will be sure to let the whole crew know what a great job they did for you Heat Pump AC installation! Thank you again for choosing Ashton and we hope you enjoy your new system!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-21 21:09:37.733330",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107010004821651371194/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M1o2TElnEAE",
            "reviewer_name": "Colin Trigg",
            "rating": 5,
            "review_text": "Danny the plumber from Ashton did an excellent job installing a kitchen faucet, fixing a water pressure issue and recommending a part to help extend the longevity of our dishwasher and it s connection to the water intake. We would definitely use their services again. Always great to receive expert advice and service.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-21 21:09:37.736362",
            "response_from_owner_text": "Hi Colin! Danny was trilled to hear from you!",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-21 21:09:37.736362",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109579394724417716302/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad29HZlJnEAE",
            "reviewer_name": "James T. Smith",
            "rating": 5,
            "review_text": "Jason came by today and fixed the problem in half the time I thought it was originally going to take. He was friendly, professional, and did a great job. I will be using Ashton s services again in the future when a problem arises. Thanks again, Jason!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:38.324083",
            "response_from_owner_text": "Thanks, James! I will be sure to let Jason know you left him a review! Thank you again for choosing us for your plumbing, heating and cooling needs!",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-21 21:09:38.324083",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102360404415446495614/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabDhxV3dnRRAB",
            "reviewer_name": "Ron Fleming",
            "rating": 5,
            "review_text": "Successful installation of Moovair heatpump system. Karan and Dominic did a great and timely job.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:38.326699",
            "response_from_owner_text": "Thank you, Ron! Hope you are enjoying your need heat pump ac! Thank you again for choosing Ashton! I will be sure to let Karan and Dominic know you left them a review!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:38.326699",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/111423163187125540977/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eE83TW13RRAB",
            "reviewer_name": "Alan Sung",
            "rating": 5,
            "review_text": "Jason did a professional job. He did the tank replacement without any disruption to our routine. The workmanship was of high quality. We believe we ll get the value for our money.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-21 21:09:38.329293",
            "response_from_owner_text": "Hi Alan! Thank you for the kind words! I will be sure to let Jason know what an amazing job he did for you! Thank you again for choosing Ashton.",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-21 21:09:38.329293",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/109770793150586404231/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaejRHQld3EAE",
            "reviewer_name": "Fotowonderlust T",
            "rating": 5,
            "review_text": "Carlos, Bejan and the Hatem came to our place to install the heat pump and we also applied for the Canada greener home & BC Hydro rebate. They did an awesome job and we are so glad we install the air conditioning.  Thank you Amazing team!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:09:38.332361",
            "response_from_owner_text": "Hi Fotowonderlust, than you for the kind words! Were trilled we were able to assist you in getting the Canada Greener Homes and BC hydro rebates! Enjoy your ew AC heat pump!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:38.332361",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/114264990356849052970/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcHVlUk93EAE",
            "reviewer_name": "Mariko Jagger",
            "rating": 5,
            "review_text": "Jason came to my home for a minor plumbing issue. He was very thorough and gave me multiple options. I decided to repair all the plumbing in my home. Jason and Johnny were very efficient and professional. I am extremely happy with my experience with ashton",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-21 21:09:38.334300",
            "response_from_owner_text": "Hi Mariko! Thank you for taking the time to leave a review for Jason; we love hearing from our customers! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-21 21:09:38.334300",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112014749922950338873/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHa1lfaWpBRRAB",
            "reviewer_name": "Douglas Alder",
            "rating": 5,
            "review_text": "Jerry was great. In addition to regular maintenance on our hydronic system, he solved a long standing issue in a Grohe tap that we had tried to repair. Very knowledgeable and had the right tools for the job.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:38.336387",
            "response_from_owner_text": "Hi Douglas, thank you so much for taking the time to leave us a 5 star review!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-21 21:09:38.336387",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101284354939158391922/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bE9tcEV3EAE",
            "reviewer_name": "James Powell",
            "rating": 5,
            "review_text": "Carlos was very professional, helpful, and got the job done in a timely manner. Thank you for the great customer service!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-21 21:09:38.339435",
            "response_from_owner_text": "Thank you, James! I will be sure to let Carlos know what a great job he did!",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-21 21:09:38.339435",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/113593808092806649185/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMFktVFZREAE",
            "reviewer_name": "Joanne Murray",
            "rating": 5,
            "review_text": "Johnny Bingham replaced a toilet at my senior aunts home on Oct 30th. Lydia asked me to share he was very professional and her place was spotless after he completed the job. Thanks Johnny!!",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:38.342314",
            "response_from_owner_text": "Thank you, Lydia and Joanne!",
            "response_from_owner_ago": "a week ago",
            "response_from_owner_date": "2023-11-14 21:09:38.342314",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106831422317310048318/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGc09DLVNnEAE",
            "reviewer_name": "Tom Tautorus",
            "rating": 5,
            "review_text": "Johnny did an amazing job unclogging a very plugged toilet. Installed a new toilet. Very communicative and explained all steps. Provided alternative ideas to save costs. Highly recommend.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-07 21:09:38.345135",
            "response_from_owner_text": "Hi Tom, thank you for leaving Johnny a review! Thank you again for choosing Ashton, I will be sure to let Johnny know what a great job he did for you!",
            "response_from_owner_ago": "2 weeks ago",
            "response_from_owner_date": "2023-11-07 21:09:38.345135",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101360909504287549383/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc01uRlpREAE",
            "reviewer_name": "Daniel Simper",
            "rating": 5,
            "review_text": "I used Ashton s recently for a follow up inspection after some recommendations for work we needed in our apartment. Dan came over, was super polite and open about everything that needed doing and our options. It was easy to trust his judgement and the quote came through 30 mins after he d left. Thanks!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-21 21:09:38.347927",
            "response_from_owner_text": "Thank you, Daniel! Were so glad Dan was able to assist you with your plumbing issues! Thank you again for choosing Ashton!",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-21 21:09:38.347927",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/100056549208540169063/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}