{
    "place_id": "ChIJxZR4o3lxhlQRl77O-zPvoD8",
    "reviews": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbGF1Q0R3EAE",
            "reviewer_name": "Amira Aamoumour",
            "rating": 5,
            "review_text": "Since the very beginning I had a wonderful experience. Angela was my first point of contact and assisted me throughout the entire process. Heather was extremely helpful as well. I wanted to get this finished as quickly as possible. Tarlan sent the final email and then I received the email from Addel with the confirmation shipment. KLO Portfolios did an exceptional job and I would order portfolios with them in the near future for my other works. I highly recommend them. I received my portfolio two days in advance and it looked extremely professional and high quality. Its beyond 5 stars. Thank you so much!",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:18.812452",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 22,
            "total_number_of_photos_by_reviewer": 80,
            "reviewer_url": "https://www.google.com/maps/contrib/102222909198809778731/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbjlyYjJnRRAB",
            "reviewer_name": "Melissa Vesosky",
            "rating": 5,
            "review_text": "If your looking to revamp your portfolios I suggest looking into KLOportfolios. I am VERY picky when it comes to the print quality. I wanted something sturdy & not flimsy! I am so impressed. I received my portfolio today & couldn t be happier. Mine is Acrylic Matte in Black with engraving & color fill. But they have different material options, like aluminum or veneer if you don t like acrylic, they have tons of different engraving  options with or without color. The customer service is amazing! You send them your file and they work with you to get it perfect. Also the website is very user friendly. The best part: every portfolio includes overnight shipping, once it s done in production. Below is the  cover  I haven t put my prints in yet. No filters #supportsmallbusinesses",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:18.816467",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/115574302379346537077/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRM29MQkxBEAE",
            "reviewer_name": "Nicholas Bogert",
            "rating": 5,
            "review_text": "What can I say about Klo, their work is phenomenal. I had to get a portfolio to graduate this May with a Advertising & Graphic Design Degree, and wanted to make a bold statement. My professor recommended Klo, as well as one of my friends. The process was super easy to set the file up for whatever finish you were getting (die-cut, engrave, etc.). Klo kept in touch, and usually answered back to keep you notified about the process. All I can say is, I cant wait to show it off at interviews, and even portfolio reviews. Worth every penny!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:18.820115",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/111679031721335804680/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdy16dmxBRRAB",
            "reviewer_name": "Jenna Close",
            "rating": 5,
            "review_text": "I have used Klo Portfolios twice. This is a small business that exemplifies what it means to care about your product and your people. Both times their portfolio quality and customer service was excellent. With my last order I needed some advance information on measurements and Tarlan herself responded quickly and efficiently to every email and phone call I sent. I highly recommend this company both for the quality of their work and their above and beyond care for their customers.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:18.823358",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103845579252022521660/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNl9lekJBEAE",
            "reviewer_name": "Allie Harris",
            "rating": 5,
            "review_text": "I had a very smooth and easy process in ordering my portfolio, Elizabeth was prompt and helpful with the questions I had, and was timely in getting my proof approved and the way I wanted. I paid the rush fee to get the week turnaround, and it came just as expected- was shipped overnight and got here early in the morning with no issues. Klo did an amazing job on my portfolio, it turned out beautifully. Very pleased with the work they did. :)",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:18.826287",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104149603979770028331/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncWU2N0F3EAE",
            "reviewer_name": "Naidin Concul-Ticas",
            "rating": 5,
            "review_text": "Klo Portfolios is honestly the best place in my opinion to purchase your portfolio book, hands down! And this comes from someone who was very nervous and anxious about ordering. But from the very beginning to the end result I wouldnt have changed a thing and will probably revisit them in the future! The team at Klo is so supportive. I probably called quite a few times asking multiple questions about the process, how it works, which book would be best, etc. and they never hesitated to answer my questions. They always made me feel so confident and secure about my book with constant emails about the process and if there were to be any changes made, which I really appreciated a lot. And it so happened my book was engraved instead of a die-cut which worked out so much better! And they made sure to run everything by me first and send my proofs. They were always very professional and friendly. Willing to help accommodate any of my needs. Words cannot describe how AMAZING my book came out. So much better then what I imagined!! So sleek and professional! Packaged perfectly and so cute and personalized with my name all over the wrapping which definitely made me feel special. When I bought it to class, so many students feel in love with it and were blown away! They even decided to go with Klo for their books after seeing mine. Every job interview I have been on has said amazing things about my portfolio. It really leaves an impression. At my portfolio show, Im not kidding jaws dropped. I cannot express how awesome Klo is. From the every aspect they are with you and for you. I love them so very much!!! So please i recommend them so highly to you! And if this helps, I just got a graphic design job and lets just say my book stuck their attention ;) Thank you Klo for your exceptional work!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:18.829063",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/115354259228421373926/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnazlINk5BEAE",
            "reviewer_name": "Haley Drummond",
            "rating": 5,
            "review_text": "As a young graphic designer, Im doing a lot of things for the first time. Designing and ordering my portfolio definitely topped the list of firsts. Luckily, I chose Klo Portfolios to produce my portfolio. The process to order and personalize was very user friendly and it was apparent that they didnt overlook a single detail. I felt confident when I submitted my portfolio design. Shortly after, I received a phone call reviewing my submission. It was apparent that they were in the best interest of the final product being flawless by suggesting and explaining size adjustments to improve my design. Timing was as promised and quality surpassed my expectations. I received an innumerable amount of positive feedback from family, friends, colleagues and professionals at the AIGA Portfolio Review in Raleigh, NC. Klo Portfolios truly made the experience a great one and I couldnt be happier with my portfolio!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:18.832032",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115193009406573341741/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJOGV6bkRBEAE",
            "reviewer_name": "Bahar Nahjavi",
            "rating": 5,
            "review_text": "Great customer service. I used Klo Portfolios for my custom 11x17 portfolio cover and I get so many compliments about my book at portfolio reviews! I would like to thank Tarlan for personally taking the time to answer my questions and assist with my revisions. I absolutely recommend Klo Portfolios and I couldnt be happier with the process or end result!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:18.834616",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/104584499011789990507/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBZ05MN3pnRRAB",
            "reviewer_name": "Nolan Morris",
            "rating": 5,
            "review_text": "I used Klo Portfolios for my custom 11x17 portfolio cover and was really blown away by how good the final product came out. The online process was easy, and they worked with me the whole time to make sure it was done right. I would like to thank their graphic artist Tarlan, for personally taking the time to answer my questions and assist with my revisions. To sum up, I absolutely recommend Klo and I couldnt be happier with the process or end result!",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:18.837140",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 55,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113243022544797191236/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcmEtQ2FBEAE",
            "reviewer_name": "Jordan Pereira",
            "rating": 5,
            "review_text": "My experience with Klo was nothing short of excellent! Their team was incredibly helpful during the process of making my portfolio. It arrived in great time inside a Klo sleeve (and with a cleaning cloth, which was a super nice touch). Every single time Ive gone into an interview since Ive had it, the company will always comment on how much they like my wooden portfolio case. Thanks Klo!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:18.839588",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110163544202695101207/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReEtLTnBBRRAB",
            "reviewer_name": "Pinky Rossini",
            "rating": 5,
            "review_text": "My portfolio was UV printed. Klo Portfolios will not just print what you send them, they make sure your design is of highest quality and perfection. The outcome of my printed portfolio went beyond my expectations. Thanks to customer service I was able to receive it in time for an interview! Truly beautiful portfolio! Very happy and will return again!",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:19.395122",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/116224344947588587373/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaXJqa3VBRRAB",
            "reviewer_name": "Blanca Diaz Picasso",
            "rating": 5,
            "review_text": "My experience with Klo Portfolios has been excellent , I was a little apprehensive about getting a portfolio cover out of the country and also scared because the deadline of my presentation was coming and I didnt know if I would get my cover on time, I bought the rush order and I got my cover the next day. I would definitely recommend Klo Portfolios and give them 10 stars if I could Tarlan and all her team are so good at keep in touch and answering questions. The best experience!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:19.398988",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107260088008173484069/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZb2JEX3hRRRAB",
            "reviewer_name": "Carlee Konz",
            "rating": 5,
            "review_text": "GREAT experience using Klo Portfolios! I was getting one of their products as a gift for a friend and accidentally ordered the same product twice - they refunded my accidental order in less than an hour. Their customer service was very responsive and Allison was super in answering my questions. Definitely recommend using this company and I look forward to seeing the final product! :)",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:19.402566",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116512616874565317462/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneGFHMWtRRRAB",
            "reviewer_name": "Alexander Williams",
            "rating": 5,
            "review_text": "I got my portfolio today in the mail, and I cant tell you guy how thankful I am. It turned out more amazing than I had hoped, and you truly brought my design to life. I was honestly worried about the shipping, since it was over seas, but it arrived right on time and not a day later than quoted. I appreciate the craftsmanship on my new portfolio book, and will continue to use you for future business. Klo Portfolios will be recommended by me to all other creatives in my community. Once again thank you so much! Alexander Williams Graphic Designer Edit: Im curious to know if the 1 star reviews are because the particular designers didnt order their books early enough to receive them on the expected date. I personally live in the U.S, so shipping through customs can be a pain, and very time consuming.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:19.405627",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/112380886585685945349/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdzdERkNnEAE",
            "reviewer_name": "Erica Genece",
            "rating": 5,
            "review_text": "Klo Portfolios is a great company with fantastic customer service. They were able to work with me and deliver a great product within my tight time frame. I get so many compliments about my book at portfolio reviews! Thanks so much Klo!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:19.408995",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108016812318562095883/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOVltaVN3EAE",
            "reviewer_name": "Brendan Mudryk",
            "rating": 5,
            "review_text": "Klo Portfolios did an amazing job on the work I needed done. Yes, the price can be a bit steep for those who might be on a student budget, but were talking about custom crafted work and it is worth every cent. In my line of business, as a graphic designer, a printed portfolio is still an important piece of the puzzle and one of the challenges you face is standing out. Klo solves that. I received nothing but praise for the quality of my portfolio during my portfolio show and it helped make me stand out greatly. Needless to say, I am ecstatic about how it looks. The service, management, and every part in between was also on point. They got back to me in a timely manner, made things very clear, and above all actually made the process feel human with actual customer interaction. I honestly dont know what problems could honestly occur when that kind of treatment is being applied. I am still in aw of the work that was done and how efficient it was. Not to mention the amount of padding that went into keeping this thing safe was astronomical. They also did the printing for all my pages within the portfolio and that too was top quality. Ive had many printers send me prints that came out completely off point but Klo got it done right. Nothing but praise for these guys. If you have the budget and need to stand out, I highly recommend getting Klo to do your portfolio. They are second to none and I have yet to see portfolio crafters like them anyway, especially not online. If I ever need another portfolio done, I am easily coming back, not to mention Im recommending them to everyone at my school to get it done here. Thanks again for all the hard work guys! It was a blast working with you. Regards, Brendan Mudryk of Tyr Designs",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:19.412067",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/110522337391989190653/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX0wza3NBRRAB",
            "reviewer_name": "Jenny Baxter",
            "rating": 5,
            "review_text": "Klos service is fantastic. They helped me meet my very tight deadline and they produced a beautiful product. All four portfolio cases that I have had them create are dead on to my designs and gorgeous. I would highly recommend Klo Portfolios if you want a perfect portfolio case.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:19.415281",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 50,
            "total_number_of_photos_by_reviewer": 36,
            "reviewer_url": "https://www.google.com/maps/contrib/112458899814766076836/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbVlYR19BRRAB",
            "reviewer_name": "marisol guzman",
            "rating": 5,
            "review_text": "I had the best experience with Klo! I had been eyeballing them a few months before I started my last quarter in January and I knew I wanted to order my book with them.  My professor told me that they were good but too expensive and that there were other places MUCH better and cheaper. I checked every place he gave me and even look on Etsy and was NOT close to Klo. The most important part was that they take it so serious. Everything is from scratch, so they know what they are doing! I called beforehand and gave them might ideas and my logo and what I envisioned and they literally made come to life!! On top of that, my book/table was named the best one on my portfolio show. I got incredible comments from so many people!  I was so happy with my book. Ill be ordering a, Ill be making a photo book this time!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:19.418233",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112566418399074222675/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMHNqU2dBRRAB",
            "reviewer_name": "Aislinn Flanagan",
            "rating": 5,
            "review_text": "This company is on top of it, and their product is very high quality. I had my grad portfolio book custom made with them. I was very busy the few weeks leading up to grad and I somehow missed that there was a mistake with my logo on the proof that I had approved. The show was in just a couple of days when I got the book with the mistake on the logo, however Tarlan assured me that they could have another one ready on time. She kept her word and the book was ready within a couple of days, with time to spare before the show. Nothing but good things to say about this company. They are honest, timely, professional, and very high quality.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:19.420636",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116474789854693520027/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbi12LXJ3RRAB",
            "reviewer_name": "Erin Mitrzyk",
            "rating": 5,
            "review_text": "Everything from start to finish was smooth. I got my proof within 20 minutes of submitting my artwork and Tarlan was very helpful with any questions I had. It was ordered and on my doorstep in a week. Not to mention my portfolio is beautifully crafted. I would definitely recommend!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:19.423035",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110280499893447877543/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOXB6b2Z3EAE",
            "reviewer_name": "Tyler Harris",
            "rating": 5,
            "review_text": "I talked with Tarlan and she answered all questions and complications that I had with ease. Their customer service is beyond exceptional; we were on a first name basis by the second phone call! I rush shipped my portfolio and said I needed it by the 7th of April, which I thought was a little too early, but I thought Id give it a shot. It was in my hands by the 9th, much earlier than I thought! Everything turned out beautiful, and my personal experience with them was refreshing. I would recommend Klo to anyone, and they certainly dont disappoint with the wow factor.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:20.004085",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112646020821327878505/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnajhTNi1BRRAB",
            "reviewer_name": "Caitlyn Milot",
            "rating": 5,
            "review_text": "I ordered a KLO Portfolio as a gift for my sisters 30th birthday to display her professional Theatre/Circus Design resume and photos. I was so thrilled with the product that arrived. Tarlan answered all of my many questions and helped me to refine the design. The final product was better than I could have imagined and made my sister cry! Thanks to KLO for the professional and thoughtful work they produce.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:20.008017",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114245522688516179745/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnak1lMzV3RRAB",
            "reviewer_name": "Portia",
            "rating": 5,
            "review_text": "Klo Portfolios was a pure pleasure to work with. They allow you to customize the design of your portfolio uniquely to you. They are with you every step of the way through out the design process. My field is Interior Design and my portfolio is currently the talk of the school.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:20.011425",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/112064500707989385620/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBc2JHWXN3RRAB",
            "reviewer_name": "Kimberly Koltcz",
            "rating": 5,
            "review_text": "My portfolio turned out absolutely beautiful and the employees were fantastic to work with, even when I was at my most stressed out point. Tarlan deserves a raise.  Thank you for going above and beyond and completely assembling it for me!",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:20.014898",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 28,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110300328303170911487/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3X2VtZGhRRRAB",
            "reviewer_name": "Diana German",
            "rating": 5,
            "review_text": "To me one of the things that I love about this company aside from the fact that my portfolio looks amazing is the incredible communication that they have with their clients. I recommend Klo portfolio they are really polite.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:20.018170",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106981104135908673430/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNTRxQlJBEAE",
            "reviewer_name": "Royce Grassl",
            "rating": 5,
            "review_text": "I couldnt be more than happy with the experience that I had with Klo Portfolio. Not only did they make an awesome portfolio, they also had awesome communication skills in order to produce and execute what I had envisioned for my porfolio.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:20.021079",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115165791711632216795/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBc2R6b3FRRRAB",
            "reviewer_name": "Elizabeth Lafontant",
            "rating": 5,
            "review_text": "Great customer service. I was assisted with last minute changes. Quality work. My portfolio was delivered fast. I will use them again and I strongly recommend.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:20.023989",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110244512826493616042/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbjhlNFRBEAE",
            "reviewer_name": "Michael McLaughlin",
            "rating": 5,
            "review_text": "Love the two portfolios Klo did for my company.  Very cool, great quality, amazing value.  Love them!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:20.026791",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113757922203179676883/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnay1udEhBEAE",
            "reviewer_name": "Anthony Smith",
            "rating": 5,
            "review_text": "Klo beat my expectations! Efficient and precise product by a family run local business.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:20.029365",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 291,
            "total_number_of_photos_by_reviewer": 317,
            "reviewer_url": "https://www.google.com/maps/contrib/117827799897842016841/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNFBhc3lnRRAB",
            "reviewer_name": "Saniya Shaaban",
            "rating": 5,
            "review_text": "Really good quality, and great team and service.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:20.032088",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/116804318758014850704/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndDR2NWJ3EAE",
            "reviewer_name": "Jules BC",
            "rating": 5,
            "review_text": "",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:20.570938",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118245820937647712237/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaHVTaDRRRRAB",
            "reviewer_name": "Saints Faith Design",
            "rating": 4,
            "review_text": "The portfolio I received from klo was very well done. I love the stained bamboo application! Completely custom! Their associates were very friendly & enthusiastic about the entirety of my project. They were also very service orientated when it came to last minute adjustments. When I received my cover you could really tell that they wanted to put as much love into it as I did with the materials within. Thank-you klo.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:20.574522",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/118414134468596335720/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMjdELTFBRRAB",
            "reviewer_name": "Tammy KH",
            "rating": 2,
            "review_text": "Im definitely not happy with the customer service I received. I ordered my portfolio and was told I would have it in my hands by Monday the 27th. Approximately a week before my ship date I e-mailed and asked if I could pay shipping to get weekend delivery so I could have my portfolio prior to my trip. I was told that I could and said I wanted to, but never received a confirmation or request for pament. I then called and left messages and received no response. I finally got ahold of someone and was told that early shipping never got added to my order and that it might be too late, but they would find out and call/e-mail me back. I never received a call or e-mail. I left for my trip and arranged for a coworker to pick up my shipment on Monday (my original ship date) so he could bring it for me and it had still not arrived, so I was not able to get my portfolio in time for my trip which is the entire reason I had ordered it in the first place. I do not know if my portfolio is good or not as I havent seen it, but I would not recommend Klo Portfolios simply based on the poor customer service I received.",
            "published_at": "9 years ago",
            "published_at_date": "2014-11-21 21:11:20.578668",
            "response_from_owner_text": "Thank you for your feedback, we tried calling you and you werent available. Our custom portfolios are cut, treated, and assembled in house so they do take some time to create.  Your proof was approved on October 15th and our turnaround is 2 weeks in hand from the time your proof is approved. We originally wanted to offer you a weekend delivery service as per your request and later realized and let you know it wasnt available so we shipped your custom portfolio on Friday with a complimentary upgrade to an express service you were not charged for, a $68 fee we covered for you. Unfortunately your package was held at US customs which we dont have any control of (I wish we did!) so it arrived one date after your requested date. We do our best to accommodate all deadlines even if its needed faster than our 2 week turnaround stated on our website.  You received a complimentary express shipping  upgrade in hopes youd receive it earlier for your trip and Im sorry you didnt receive it in time. Please give us a ring if youd like to chat further. All the best, Tarlan Seyedfarshi Co-Founder",
            "response_from_owner_ago": "9 years ago",
            "response_from_owner_date": "2014-11-21 21:11:20.578668",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/103252075818242076162/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNDdhTXNnRRAB",
            "reviewer_name": "Karli Munns",
            "rating": 1,
            "review_text": "My portfolio came with a huge scratch/scuff on it. I sent the picture to them and all they could tell me is that s how the leather comes and that it s part of the leather. I can clearly tell it is not part of the leather that something scratched it up. Not one of the images on their site show ANY imperfections. I paid a lot of money for this and upon receiving it, it should be flawless which it clearly is not.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:20.583578",
            "response_from_owner_text": "Hi Karli, This is a vegetable tan leather material so its untreated and because we cut them from large hides, there are natural blemishes and imperfections.  This is 100% part of the leather.  The upside of vegetable tan leather is that it patinas over time and ages beautifully, darkening and evening out completely.  We note on our website that all of our leather will have natural blemishes as this is the very nature of leather. We understand that mistakes happen although this is not one of them.  Please allow for the vegetable tan leather to take its course and patina, which will add beauty and character to your portfolio book and case.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-21 21:11:20.583578",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106014800775307628017/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnb2UtZDR3RRAB",
            "reviewer_name": "Mary (Cady) Angles",
            "rating": 1,
            "review_text": "So I ordered my portfolio (along with 15+ of my classmates in college) and it just went downhill from there. Almost ALL of us did not get it when it was requested because we ordered engraving and it took them FOREVER.  A few of my classmates also got told that the company had no record of them ordering rushed shipping (which we paid $40 for!) and had to fight tooth and nail with them to not even get it refunded in the end. WOULD NOT RECCOMEND DUE TO POOR CUSTOMER SERVICE AND ORGANIZATION WITHIN COMPANY.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:20.587363",
            "response_from_owner_text": "Hi Mary, Our custom portfolios are created from scratch so they do require the full amount of time required to create.  The turnaround starts from the time your proof is approved, not when your order is placed as we let you know. We did have an unexpected delay in our material and you were notified, your rush fee was refunded, and a complimentary pack of hinge strips was added to your order which you were happy about. Your  custom portfolio looked amazing and was shipped to you with an overnight service  which we covered, all facts that youve chosen to leave out :-) No matter the outcome, we wish you the best! Cheers, Tarlan",
            "response_from_owner_ago": "7 years ago",
            "response_from_owner_date": "2016-11-21 21:11:20.587363",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111901169636123901630/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNVAtMDJBRRAB",
            "reviewer_name": "Joanna Gochoel",
            "rating": 1,
            "review_text": "",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:20.590851",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": null,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "",
            "is_local_guide": null,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnclBtV0lREAE",
            "reviewer_name": "Destiny Barreira",
            "rating": 1,
            "review_text": "",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:20.593063",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/108586326923848662375/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}