{
    "place_id": "ChIJZXNi3WFxhlQR8yQ0baEGzUk",
    "reviews": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXOXFlYlVREAE",
            "reviewer_name": "Jinelle G",
            "rating": 5,
            "review_text": "I usually dont write reviews but the level of service was outstanding so I feel compelled. I was in a bind as a purchased a treadmill and .. yes they did say it was curbside drop off but I was in a panic when I realized how big and heavy it was when it arrived! I was going to get a buddy to install it but I decided to use First Lion when I saw how massive it was! I contacted them and they came to my rescue with very short notice the next day. They brought the treadmill in and set it up for me quickly and efficiently. I have to say that they were so calm and professional I was SO IMPRESSSED and I felt so confident in their skills and knowledge. i HIGHLY recommend First Lion as they were truly exceptional ! If you need an installation DO NOT HESITATE!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:40.373095",
            "response_from_owner_text": "Hi Jinelle, Thank you very much for the kind words. We appreciate your business and we hope you enjoy the new treadmill.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-21 21:11:40.373095",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113674136247420640857/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyXzUzdktnEAE",
            "reviewer_name": "Susan Watson",
            "rating": 5,
            "review_text": "Trevor and Gabriel showed up on time and were pleasant and efficient. They installed our Bestar wallbed in a professional manner and were able to cope with Bestar packing the wrong screws for the handles; They had extra of the correct ones from a previous installation. Gabriel showed us how to use the features and warned us about possible usage missteps. Hiring them to do this was definitely worth it! Service: Furniture assembly",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:40.376914",
            "response_from_owner_text": "Hi Susan, thank you for the kind words.  We appreciate you calling us for your installation and hope you enjoy your beautiful new wall bed.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-21 21:11:40.376914",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110888188545559882482/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcVpfamhnRRAB",
            "reviewer_name": "Daniel S",
            "rating": 5,
            "review_text": "Bought a large wall unit for TV from Ikea, they put us in touch with Task Rabbit as their recommended installers. After several phone calls, emails, texts it became apparent that they new less than nothing about installing a wall unit or anything else for that matter. Although we were told they were professionals, the installer asked what tools he needed and if we would help him put it up. Not sure, but thought that was what we were paying him for to install and know what tools to bring. It became very obvious that we were gong to be in for a terrible experience so cancelled and started searching for an alternative. I found First Lion online and thank you to all that have sent in their experiences and expressed their satisfaction because it was from those reviews that convinced me to go with First Lion. Spoke with Gabriel and was impressed with the very pertinent questions he asked, obviously knew what he was doing. My experience: nothing short of absolute satisfaction. Extremely professional, knowledgeable, polite, hard working, perfect install. I expected to be pleased but was actually amazed. They are the only install company to use, bar none. More costly than Task Rabbit maybe, but worth every penny and more. They said they would arrive at 10am, they arrived at 9:50 and were working by 10. They finished at about 3 and although I asked them to take a break they politely declined and kept working. Gabriel and Brent were just two great hard working guys and deserve to get the kind of reviews that are listed here. Do yourself a favour and skip the stress of a poor install and just get First Lion to do it right the first time and sit back and enjoy. Cant say enough about them, really, awesome company.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:40.381650",
            "response_from_owner_text": "Hi Daniel. Thank you for the kind words.  Were glad you had a good experience.  We hope you enjoy the wall unit.  Gabriel!",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-21 21:11:40.381650",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109487897442043516453/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbHRYOFZnEAE",
            "reviewer_name": "Daniel Popescu",
            "rating": 5,
            "review_text": "We hired First Lion to set up our downtown office which consisted of modular office desks, filing cabinets and partition walls. Not only did these guys get the job done flawlessly, but they completed our office so quickly that we were able to save money with their reasonable hourly rate. We were quoted a flat rate by another company but decided to go with First Lion instead and we are happy we did because we now realize that the other company had quoted us an inflated flat rate. We will definitely be calling First Lion again in the future for our furniture installation and assembly.",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:40.384834",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112509033419655363899/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMlBudDFBRRAB",
            "reviewer_name": "Barbara Smyth",
            "rating": 5,
            "review_text": "VERY GOOD! I am a designer with 20 years of experience contracting carpenters, installers, furniture assembly, and moving trades and I met  First Lion a year ago. They do it all perfectly providing great solutions-oriented to details and are reasonable prices.  I recommend them to anyone. Barbara Smyth VOD Office Design. vancouverofficedesign.ca Services: Local moving",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:40.387518",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/100769144590428167372/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeS0yNGRREAE",
            "reviewer_name": "Meghna Sahasrabudhe",
            "rating": 5,
            "review_text": "Wonderful experience dealing with Gabriel and the company in general, from the start to finish. We had quite a few items from Ikea that needed to be picked up , delivered & assembled and we are so glad we chose First Lion Express!! The prices are very competitive as compared to other services out there. The service is equally or more professional and worth every penny spent. Would definitely recommend First Lion Express. Also love the fact that a part of your service fee goes towards supporting the endangered species. Great job !",
            "published_at": "8 years ago",
            "published_at_date": "2015-11-21 21:11:40.391387",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115793882495039958183/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cmJ1SEFnEAE",
            "reviewer_name": "Aaron Tsang",
            "rating": 5,
            "review_text": "Gabriel came to help me with a delivery of IKEA goods to furnish one of my four bedroom suites. I wanted to try out his services first as his rates were very reasonable but I didnt know him personally. Let me just say that as a professional real estate agent I have many encounters with handyman/contractors but I am glad I called Gabriel as he was extremely professional, punctual, and knowledgeable with lots of care when it came to transporting my your goods and installation/building of my furniture. I will 100% be using Gabriel and First Lion Express again to get the other 3 suites furnished and have no hesitation in recommending him and his professional services.",
            "published_at": "8 years ago",
            "published_at_date": "2015-11-21 21:11:40.393758",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 33,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/100849177498888899247/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRb28yZEhBEAE",
            "reviewer_name": "Denise Lauritano",
            "rating": 5,
            "review_text": "Gabriel is nothing short of heroic.  He returned my call within minutes, was extremely professional and pleasant, came the same day, and assembled a really heavy, bulky, complicated piece of Ikea furniture in two hours - all by himself when the instructions had said you needed two people.  The hourly rate is the same or lower than the others and without all the hidden fees.  He was so great that when I needed some handyman work done, I called Gabriel without hesitation.  Once again, he was tremendously kind and professional.  I think the second job I gave him was even more difficult than the first yet he did it graciously and with a big smile for a really, really good price.  Gabriel embodies what the tradespeople of a bygone era were like - incredibly service oriented, punctual, professional, completely trustworthy, honest, hard-working, and very highly skilled. As an aside, as a single woman, I am very careful about who I let into my home.  I had no hesitation about Gabriel and in fact when I had to step out for a few minutes he was even thoughtful enough to say Ill keep your house safe while youre gone .   Hire Gabriel.  He will give you the very best, highest-quality, most professional service for the best price.  He is the real deal.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:40.396048",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105038399480264316241/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1LUxYcXVRRRAB",
            "reviewer_name": "t s",
            "rating": 5,
            "review_text": "The installation guys were polite and on time. They did a great job installing my pax wardrobes and ensuring they were mounted correctly. I was really impressed with the level of service.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:40.398264",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109324997835420430037/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbHB1WnBnRRAB",
            "reviewer_name": "Keely Hilario",
            "rating": 5,
            "review_text": "My roommate and I are both students, with a mix of IKEA and other furniture. We booked in with First Lion and were met with professionalism and timely service. Due to poor weather, I was concerned about our move date, but received a call beforehand assuring me that everything was still a go. Our furniture was handled with care, and the team even helped us with some of our more delicate pieces; pictures and my bike. The quote given was quite reasonable, and the job was done in a matter of a couple hours. It saved me the huge headache of arranging people and vehicles to help. They will definitely be called in the future; should I ever need to move again.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:40.401302",
            "response_from_owner_text": "Hi Keely, Thank you very much for the kind words.  We are happy that you had a good experience.  We hope you and your roommate enjoy your new place. First Lion Express Team",
            "response_from_owner_ago": "6 years ago",
            "response_from_owner_date": "2017-11-21 21:11:40.401302",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/106428791512316900731/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3LWE3NFZ3EAE",
            "reviewer_name": "Noya Madadi",
            "rating": 5,
            "review_text": "Moving is such a hassle.. First Lion Express made the move extremely flawless & stress free. The guys were great, they moved my stuff very carefully, wrapped my nice white furniture so it wouldnt get dirty or scratched. They took extra care of everything & I really appreciate that. I would 100% use them in all my future moves. They have excellent customer service & answered all my questions thoughtfully.",
            "published_at": "6 years ago",
            "published_at_date": "2017-11-21 21:11:40.983996",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102951182763768730226/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NzZIV1B3EAE",
            "reviewer_name": "Peter Pi",
            "rating": 5,
            "review_text": "Gabriel is THE MAN for the job. My experience with his service was nothing but positive. When it comes to your home, you want someone like Gabriel to be working on it. He knows what he is doing and his services are insured. He is meticulous on quality of the job, such as what material to use and precautions to take before moving on to the next step. Get it DONE RIGHT, call First Lion Express.",
            "published_at": "7 years ago",
            "published_at_date": "2016-11-21 21:11:40.987382",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 105,
            "total_number_of_photos_by_reviewer": 48,
            "reviewer_url": "https://www.google.com/maps/contrib/110127933666352910771/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLektfUlFBEAE",
            "reviewer_name": "Paxton Bach",
            "rating": 5,
            "review_text": "First Lion helped install a queen sized murphy bed purchase at Costco. It was not a small job, but they were here on time and extremely professional throughout. Lots of small troubleshooting done on the spot, appreciated their time very much.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-21 21:11:40.990645",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107902311565772442478/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bC16R2JREAE",
            "reviewer_name": "Jonathan Loree",
            "rating": 5,
            "review_text": "First Lion helped install a wall mount bed for us and I was extremely impressed. They were on time, professional, did an excellent job and I would highly recommend them.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-21 21:11:40.995099",
            "response_from_owner_text": "Hi Jonathan, Thank you kindly for the feedback.  We hope you enjoy the new murphy bed.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-21 21:11:40.995099",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 268,
            "total_number_of_photos_by_reviewer": 70,
            "reviewer_url": "https://www.google.com/maps/contrib/103844729097978314372/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJMjRuUlFREAE",
            "reviewer_name": "Johnny Dadey",
            "rating": 5,
            "review_text": "Recently had an Ikea wall unit and TV wall mounted by Gabriel and Brent , and I have to say I was happy that I chose First Lion . After reading the reviews of OTHER companies out there , I knew that I had to get the right people , or risk a potential disaster . These guys were on time , explained everything to me , made suggestions , and were very professional . The end result is that it looks great , and was a stress less experience for me . I highly recommend this company .",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:40.998632",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110356976865781271458/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMGFINlJREAE",
            "reviewer_name": "Robert Bisbicis",
            "rating": 5,
            "review_text": "Call First Lion if you want a clean crew that shows up on time.  My Pax was built quickly and properly, and consistent with time and billing estimates.  Many thanks to First Lion!",
            "published_at": "5 years ago",
            "published_at_date": "2018-11-21 21:11:41.001349",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100837022649358590459/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaHN5d1p3EAE",
            "reviewer_name": "Stephanie Bowman",
            "rating": 5,
            "review_text": "The absolute best company for furniture assembly and moving. It was so fast, they were so knowledgeable and I literally won t use another company for my next furniture assembly or move.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-21 21:11:41.004060",
            "response_from_owner_text": "Hi Stephanie, thank you for your kind feedback.  Were happy to help.  Enjoy your new furniture.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-21 21:11:41.004060",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118161424134573673575/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNla3F6YUlnEAE",
            "reviewer_name": "K Kanno",
            "rating": 5,
            "review_text": "They are very professional and their response was very fast I love their service I ll hire them again Service:",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:41.008378",
            "response_from_owner_text": "Thank you very much for your feedback K. Glad we could help!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-21 21:11:41.008378",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/103478087162879097778/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdXBEa0Z3EAE",
            "reviewer_name": "Gail Windsor",
            "rating": 5,
            "review_text": "Expert furniture assembly.  100% reliable and professional",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-21 21:11:41.012212",
            "response_from_owner_text": "Thank you very much Gail. :)",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-21 21:11:41.012212",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113998035175892303061/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZOUx6MUhREAE",
            "reviewer_name": "Laureen Whyte",
            "rating": 5,
            "review_text": "Ive used First Lion four times over the past couple of years. Outstanding service and results!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:11:41.015999",
            "response_from_owner_text": "Hi Laureen, Thank you so much for your review.  It was a pleasure working with you.  We hope youre doing well.",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-21 21:11:41.015999",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111797231844727870278/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcGRuVTFRRRAB",
            "reviewer_name": "Stephen Luciak",
            "rating": 5,
            "review_text": "Quality service and friendly people!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:41.582202",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111687559920717738590/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNazQ2aXNnRRAB",
            "reviewer_name": "Megan Kornfeld",
            "rating": 5,
            "review_text": "Kind, efficient, helpful and great!!! Thanks Gabriel!!!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-21 21:11:41.590378",
            "response_from_owner_text": "Glad to help. Thank you again!!!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-21 21:11:41.590378",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/113828101768984515266/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOE1UVmd3RRAB",
            "reviewer_name": "Darryl Keeping",
            "rating": 5,
            "review_text": "",
            "published_at": "a year ago",
            "published_at_date": "2022-11-21 21:11:41.596054",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113017787350099228643/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}