{
    "place_id": "ChIJZ04tZ9ZzhlQRDsJZp_cOS4U",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1a3VIV3VBRRAB",
            "reviewer_name": "R dvan Karamuk",
            "rating": 5,
            "review_text": "What an amazing experience!  I am so glad to choose this restaurant to celebrate my partner s birthday. Best service ever! Thanks million times to Jennifer. She provided us the best dining experience ever. Food is just another level in Vancouver and still I can taste it in my mouth. Atmosphere is amazing and there is nothing to make it better. In short we had a great night. Thank you so much all! We can t wait to come back and have another awesome night!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:12:45.493428",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 8,
            "reviewer_url": "https://www.google.com/maps/contrib/109622692145573238739/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGaGFTSE1REAE",
            "reviewer_name": "J.J. LaRocque",
            "rating": 5,
            "review_text": "Loved the customer service and thoroughly enjoyed the food! Excellent table service. Highly recommend the sable dish and beef tenderloin. We also added sides of broccolini and heirloom carrots. Cocktails were pretty decent and the wine menu was great. We would happily be back.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 01:12:45.497073",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 123,
            "total_number_of_photos_by_reviewer": 756,
            "reviewer_url": "https://www.google.com/maps/contrib/114637066728490620540/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX0xxTWVnEAE",
            "reviewer_name": "Nae Hase",
            "rating": 5,
            "review_text": "Selected this venue for our final family dinner during my parents visit, and it turned out to be the ideal setting for creating cherished memories with my loved ones. Benoits exceptional service made the night much better. His expertise and pleasant demeanor were truly commendable. Food was also amazing! I would say seafood tower is for 3-4 people to share. I highly recommend this restaurant, particularly for special occasions.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:12:45.499423",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/101784783542171942925/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaenY3WndBRRAB",
            "reviewer_name": "Revital Youthspan",
            "rating": 5,
            "review_text": "We hired this cafe for our business functions for 2 nights as part of a major conference. The food, service and atmosphere of the restaurant are second to none. A wonderful experience from the time we all walked in until it finished. Couldnt recommend it more highly.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:12:45.501466",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 109,
            "total_number_of_photos_by_reviewer": 788,
            "reviewer_url": "https://www.google.com/maps/contrib/103683809328890812109/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeHRuc3ZnRRAB",
            "reviewer_name": "Sarah Kwan PREC",
            "rating": 5,
            "review_text": "Went for dinner last night and was absolutely blown away by the service. While the food was amazing, the service was incomparable! My friends and I had the pleasure of dining with Tara and her colleagues and this was by far my best dining experience in the city (and Im a local)! Tara was knowledgeable, attentive and just a pleasure to be around. From the moment we arrived we were warmly greeted and never once did we have to try and seek her attention as she was always checking in. Any time someone left the table, her and her team were quick ensure settings and napkins remained tidy and presentable upon our arrival back. Tara explained the menu in detail and was quick to recommend food and beverage pairings that we were all pleased with. The food was beautifully presented, tasted great and everyone was satisfied. While I dont have photos of everything we ordered, the raw oysters were fresh and sweet, prawns were plump and juicy, and sashimi was fresh and paired with an in house soy sauce. I ordered the beef tenderloin and asked for it to be cooked between medium rare and rare and it was cooked to perfection. It was tender, seared crisp on the outside and juicy on the inside. I also ordered the truffle fries as a side and will say you have to try them! Tara is a gem and I want to thank her and the staff for creating such a welcoming atmosphere that was paired with amazing food! I dont know how it took me so long to come here but can definitely say I will be back. Make your reservation now and thank me later!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:12:45.503911",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 14,
            "reviewer_url": "https://www.google.com/maps/contrib/102048389309162188412/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNXZEYmpBRRAB",
            "reviewer_name": "Sarah Adams",
            "rating": 5,
            "review_text": "Came here last night for my one year anniversary with my partners. The place was very accommodating about letting us move our reservation up a bit from when we originally set it. The place is very beautiful, well decorated and very elegant yet cozy. We sat on the enclosed patio and the temperature was perfect, not to mention the ivy covered lanterns giving soft romantic light to the room. We were given a hand written congratulations from the restaurant, which was a very sweet personal touch. Our server, Phillip, was engaging, charming, and was very well versed on the menu. Any question he couldnt answer he was quick to ask the kitchen. He also checked in with us all night and was constantly refilling our waters. It was a very royal treatment we did not expect at that price point, for certain. We got the two tier seafood platter, the scallops entre, and a beef tenderloin to split. Not only were they very attentive to my dairy allergy, and my wifes peanut allergy, but everything we tried exceeded our expectations. Never had jellyfish before here and I would for certain try it again. The oysters were fresh and absolutely something I was excited for as an oyster lover, I was not disappointed. In terms of accessibility Id say very for a wheelchair, but I was having a good day so walked in with my cane. The parking is subject to downtown and I didnt see a disabled spot, but that doesnt mean they arent there. Likely just filled before we got there. However they do offer valet services. They are very accommodating if you call ahead. Definitely recommend this place to seafood lovers looking for a nice elegant date spot. Dietary restrictions: Very allergy conscious and will substitute our provide alternative suggestions. Wheelchair accessibility: Yes, though untested myself the place is very flat with easy navigation. A powered chair would have zero problems and I did not see barriers unpowered chairs might face.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 01:12:45.506332",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 24,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/103595568902297080202/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadnVYN1N3EAE",
            "reviewer_name": "I M",
            "rating": 5,
            "review_text": "Blue Water Cafe had been a go for us for any occasion! Great service, exceptional food and high end atmosphere! By far the best place for Oysters and sushi! We had as well a halibut which was cooked to perfection, the sides that accompanied it were paired beautifully and delicious! Service was once again exceptional! Definitely a place to have a dinner if you ever get a chance, don t forget to reserve!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:12:45.508394",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": 39,
            "reviewer_url": "https://www.google.com/maps/contrib/116922049343633341960/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aHMyY25nRRAB",
            "reviewer_name": "Oriental Bodywork",
            "rating": 5,
            "review_text": "Everything was phenomenal, but the sablefish was impeccable - the best fish we ve ever tasted. It was cooked beautifully. In the past,the scallops and those are magnificent as well. I m addition to the food, the service is professional and kind - we re always well taken care of. I rarely give out five stars but this place never fails to impress us.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:12:45.510278",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 39,
            "total_number_of_photos_by_reviewer": 487,
            "reviewer_url": "https://www.google.com/maps/contrib/105953062393267634027/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKXzRmd0dREAE",
            "reviewer_name": "Teodora L",
            "rating": 5,
            "review_text": "Celebrated a birthday dinner with my boyfriend and it was an impeccable experience! Antoine was a fantastic server, he was very knowledgeable and attentive at the right times. He answered all our questions and helped us choose oysters too. Best service I have ever experienced. Food was very delicious too!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:12:45.512273",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/100903510104008977613/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad0lfUjZnRRAB",
            "reviewer_name": "Lisa Cusimano",
            "rating": 5,
            "review_text": "Our meal at Blue Water Cafe was incredible.  The food was beyond any expectation.  Our waiter, Christoff, made the dinner a wonderful experience.  If we didnt have reservations the following night, we would have returned.  We had the seafood tasting for two as our starter.  We didnt think it could be matched. We were proved wrong.  I love scallops and the dinner scallops were outstanding.  My daughter had the Char.  It had the most perfectly done skin and the leek and crab base was delicious.  Amazing food, and equally amazing service.  Thank you, Christoff!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:45.514581",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 80,
            "total_number_of_photos_by_reviewer": 272,
            "reviewer_url": "https://www.google.com/maps/contrib/108501609422403805386/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MGJpOWJREAE",
            "reviewer_name": "Krista Lachapelle",
            "rating": 5,
            "review_text": "We came here for a special evening out and it certainly provided all we were hoping for and so much more. The service was exceptional, the wine list massive, the ambiance was cozy and welcoming and every single bite of food was unbelievably yummy!! Every detail was thoroughly thought through including special surprises with dessert! I highly recommend a visit.",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 01:12:46.153860",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 24,
            "reviewer_url": "https://www.google.com/maps/contrib/116279098274725122780/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNVpmSDVBRRAB",
            "reviewer_name": "Winston Mew",
            "rating": 5,
            "review_text": "A delicious dinner with excellent service from Liam. A great place to celebrate my wife s birthday. The seafood plateau was a tasty appetizer sized just right for 2 people. Just love the special fork they have to aid diners with the assorted oysters, mussels, clams, and other tasty treats. The halibut was firm and juicy, and although the steak was medium rather than the medium-rare we requested, it was still juicy and very tasty. We didn t leave much room for desert, so settled for tasty strawberry & raspberry lemon tarts. Highly recommended for a memorable night out.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:12:46.155939",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 70,
            "total_number_of_photos_by_reviewer": 300,
            "reviewer_url": "https://www.google.com/maps/contrib/100864251294328765942/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaGZycWNnEAE",
            "reviewer_name": "Stephanie Lovell",
            "rating": 5,
            "review_text": "Blue Water has been on my Vancouver restaurant hit list for ages and I am so glad I m finally able to cross it off. My mother did not have much exposure to the seafood on offer so we tried a variety of dishes: the Dungeness Crab   Cake (her first one ever), the Halibut Croquetas, Moorish Calamari, and the Bay Scallop Ceviche. Everything that we ordered was stellar. The harissa aioli with the calamari was a wonderful accompaniment to the crisp rings. The Dungeness Crab Cake was succulent and bursting with flavour. The reputation for being one of Vancouver s best destinations for highly curated seafood is well deserved.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:12:46.157623",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 412,
            "total_number_of_photos_by_reviewer": 1519,
            "reviewer_url": "https://www.google.com/maps/contrib/105437019336748893461/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdklfY1hnEAE",
            "reviewer_name": "Grace Wong",
            "rating": 5,
            "review_text": "I recently attended a work related function here and it was a lovely evening. Great ambiance, the food was divine & friendly staff. A friend enjoyed the bidet in the bathroom which made me laugh. Drinks are on point. Pricey but worth it for the quality! I ve also come here before with my daughter for a friends birthday and the food was outstanding that time as well! I love the fresh dinner rolls.. mmm! The Creme brulee was perfectly torched, texture was velvety, paired with a balanced crunch from the caramelized sugar.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:12:46.159669",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 50,
            "reviewer_url": "https://www.google.com/maps/contrib/104710255341139908221/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab3Z5eVdBEAE",
            "reviewer_name": "C D",
            "rating": 5,
            "review_text": "I dream about the seafood tower and kobe beef short ribs, so amazing. Some of the best seafood Ive ever had. Definitley the best ceviche in the city! Also, they take allergies very seriously, and I feel very safe eating there as a celiac. They have gluten free bread, and most menu items are already gluten free or can be adjusted. Highly highly recommended!",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:46.161603",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 32,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/107690216842818039605/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdXBiTWl3RRAB",
            "reviewer_name": "Ankush Verma",
            "rating": 5,
            "review_text": "Great place to have dinner while in Vancouver. I had booked a reservation at Blue Water Cafe back when I was visiting Vancouver in April based on a friend s recommendation and it did not disappoint. As soon as we entered we were greeted warmly by the hostess and were shown to our tables. We came on a Friday night and the restaurant was packed, but that added to the ambiance. The restaurant has a beautiful interior with a more semi casual to semi formal dress code. We were seated by the sushi preparation station, which was great as we could see the food being prepared. The restaurant has one of the most extensive wine menus and the sommelier assisted us in ordered the correct bottle that would go with our taste preferences and the meal we were getting. As for the food we decided to opt for the Blue Water Cafe Tower (the signature three tier) and were going to order more food, but the server suggested we first start with that to see if it s enough food as usually the tower is good for 4-6 people and there was only 2 of us. I appreciated the honesty as then we did not over order and had to pack food for take away. The tower arrived shortly after and it was huge. Each tier had plenty of seafood options and every single item on the tower was fantastic. The seafood was very fresh and the flavours they used helped to compliment the seafood and not over power it s flavour. We spent about an hour picking away at it and by the end we were stuffed as there was plenty of food. We had decided to end the meal with their creme brulee and some espresso and tea. Overall, this restaurant was one of my favourites in Vancouver and although it can be pricey at $150-200 per person (with drinks), it is well worth it as you are getting high quality seafood and great service. You could also come and get the smaller towers and other dishes as they are cheaper and look just as great. Will definitely return.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:12:46.163472",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 94,
            "total_number_of_photos_by_reviewer": 76,
            "reviewer_url": "https://www.google.com/maps/contrib/102251092231276704416/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcmVQR0VBEAE",
            "reviewer_name": "Nathan",
            "rating": 5,
            "review_text": "Good food!! Service was slow and waiter didn t check in with us enough time through the night. Would still highly recommend this place for a cute dining experience!",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-01 01:12:46.165687",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 52,
            "total_number_of_photos_by_reviewer": 80,
            "reviewer_url": "https://www.google.com/maps/contrib/102454332024069062239/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNExDcjR3RRAB",
            "reviewer_name": "Janet Mackenzie",
            "rating": 5,
            "review_text": "Blue Water has always been one of my very favourite restaurants in Vancouver,  and our latest visit did not disappoint. Best sushi and sashimi in the city, and if you get a chance to sit at the sushi bar it is always fun to watch the masters at work.  I always tend towards seafood here (it is too good and fresh to pass up!),  but my companions have tried other dishes such as wagyu and other steaks, and every dish is always of the highest quality.  There really is something for everyone here.  The wine list is varied and extensive,  as is the spirit list,  and there are a few decent non-alcohol options as well. We will definitely continue to be loyal patrons. Kid-friendliness: We have dined with our young children several times and always have a good time and excellent meal. Our children love seafood and sushi so that helps! They do have off-menu options for kids (the usual stuff), though we never order those so I cant speak to them.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:46.167895",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/117388752737933674778/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1Nk5XVUJBEAE",
            "reviewer_name": "D S",
            "rating": 5,
            "review_text": "One of best restaurants I have ever been to. Everything tasted amazing. Especially the tartare and lobster. And the cocktails are legit.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:12:46.169884",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 37,
            "total_number_of_photos_by_reviewer": 148,
            "reviewer_url": "https://www.google.com/maps/contrib/110590382597151837622/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cVBQMDJBRRAB",
            "reviewer_name": "Prish",
            "rating": 5,
            "review_text": "Food was fresh and outstanding, along with the service. I highly recommend giving the Seafood Tasting for Two a try! The menu is quite extensive and I am excited to return to try more of the seafood options!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:12:46.172086",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 93,
            "total_number_of_photos_by_reviewer": 100,
            "reviewer_url": "https://www.google.com/maps/contrib/104014059554969476213/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMy1pSDR3RRAB",
            "reviewer_name": "Lana Gabriel",
            "rating": 5,
            "review_text": "Must order the sashimi platter - such a generous portion of phenomenal fish. The Tsunami was also great and so were the oysters.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-15 01:12:46.804916",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/110571101428274053322/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMUtPQTh3RRAB",
            "reviewer_name": "Agnes",
            "rating": 5,
            "review_text": "Ive been here quite a bit. Usually we use one of the 2 private rooms for presentations. A great space for private functions. The staff are always amazing and the food consistently delicious. Update. Went on April 17. 2023. Our server was Chris, so personable, engaging and funny. We had oysters to share (a dozen, sampling 2 each of the 6 different types) and I had the halibut which was so delicious and amazing. Ill keep coming back to eat here whenever Im looking for seafood in Yaletown!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:12:46.809805",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 312,
            "total_number_of_photos_by_reviewer": 1325,
            "reviewer_url": "https://www.google.com/maps/contrib/112434307291794668842/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNGRUXzhnRRAB",
            "reviewer_name": "Natalie M",
            "rating": 5,
            "review_text": "I received a recommendation to dine here from a friend and so glad I went.  I was traveling alone from Southern California and sat at the bar.  The service was top notch along with the food.  I ordered sashimi, sablefish and a dessert accompanied with a crisp white wine locally sourced.  This establishment is similar to  Mastros Oceanclub with a more quaint menu and same hospitality if youre looking for that.  I will definitely visit again when in the area.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:46.818303",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 102,
            "total_number_of_photos_by_reviewer": 15,
            "reviewer_url": "https://www.google.com/maps/contrib/103161804612723794044/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4a1plbHdnRRAB",
            "reviewer_name": "Evan",
            "rating": 5,
            "review_text": "Doesnt get much better than fresh and well prepared seafood platter and sashimi on the patio! Liam especially stood out with excellent service. Having previously been a chef, he was very knowledgeable and efficient. Definitely added to a fun night!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:12:46.827983",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 47,
            "reviewer_url": "https://www.google.com/maps/contrib/111877339388385818570/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaX05uSFd3EAE",
            "reviewer_name": "Shaveta Kumar",
            "rating": 5,
            "review_text": "Really enjoyed the sablefish and sushi. Highly recommend this restaurant! Nice vibe and great service.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:46.831172",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 153,
            "total_number_of_photos_by_reviewer": 388,
            "reviewer_url": "https://www.google.com/maps/contrib/111886211034771723762/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLS1YRGRnEAE",
            "reviewer_name": "Devon Squire",
            "rating": 5,
            "review_text": "This place was amazing from the start. The drinks were superb. The steak that we had was unbelievable, so perfectly cooked and it just melted in your mouth. We had lobster as well, and it was also absolutely cooked to perfection ! Our waiter could not have been a better person, his professionalism and delightful personality made our night that much better. We enjoyed our meal and they were so gracious for our anniversary. Thank you very much ! We recommend this place highly. If youre ever in Vancouver,  You must come eat, you wont regret it !!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:12:46.833134",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 89,
            "total_number_of_photos_by_reviewer": 136,
            "reviewer_url": "https://www.google.com/maps/contrib/116322112825041758281/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNkt2Y1F3EAE",
            "reviewer_name": "Julie",
            "rating": 5,
            "review_text": "My significant other and I had the most amazing meal, but it was more than a meal, this was an immersion in Canadian culture and cuisine. Our server was phenomenal, her knowledge of the menu and beverages were incredible and assisted us in choosing the best for us. The most extensive drink menu I have ever seen!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:12:46.835153",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 56,
            "total_number_of_photos_by_reviewer": 289,
            "reviewer_url": "https://www.google.com/maps/contrib/115256798174734103364/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeWFMTWVBEAE",
            "reviewer_name": "Hya Gloria",
            "rating": 5,
            "review_text": "Our server had really good recommendations and was attentive the whole time. The shellfish plateau was a perfect starter for two. I had the scallops and they were amazing; the scallops were cooked nicely and the creamy sauce paired well. My partner had the short ribs and the meat fell off the bone effortlessly. Great place if you want to go out for a special occasions.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:12:46.837618",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/112622913398097871481/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN3JhQzFnRRAB",
            "reviewer_name": "Kristy Chen",
            "rating": 5,
            "review_text": "I am not sure about how the steak is here, but the seafood is amazing. I would definately recommend the miso glazed sablefish and the scallops as that is what we ordered, as well as both the tables next to us. Miso glazed sablefish is hands down my favourite menu item and the one from here did not dissapoint. The fish was super tender and the miso flavour is very evident, the veggies that came with the fish complimented it very well. The scallops are very smooth and clean as well. The salmon here is fantastic and the unagi was delicious too. The atmosphere here is also very nice, I sat on the patio with the heaters on and I loved that it was a lot more quiet than the indoor dining room. Our server was super friendly and nice, even though I could tell that he was very busy and our food took a while to arrive. I did not mind. My only complaint would be the calamari, I would not recommend ordering that. But it is to be expected that not every menu item will be good.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:12:46.839394",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 491,
            "total_number_of_photos_by_reviewer": 2437,
            "reviewer_url": "https://www.google.com/maps/contrib/100864525554132402451/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dWZDZ2RnEAE",
            "reviewer_name": "Trina Tymko",
            "rating": 5,
            "review_text": "Dining at Blue Water Cafe is an experience to remember. The service could not have been any better. The food was delicious, and the fish options were plentiful.  Even the toilets in the womens washroom give great service! Dietary restrictions: They have lots of gluten free options",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:12:46.841716",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 62,
            "total_number_of_photos_by_reviewer": 64,
            "reviewer_url": "https://www.google.com/maps/contrib/108584272664894350601/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNac28wcxAB",
            "reviewer_name": "Steve Smart",
            "rating": 5,
            "review_text": "Great location. Sat outside on the patio but was not cold. So much good food that it was hard to choose. Fantastic drinks list too. Will make this place our regular when in Vancouver",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:47.461886",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106649779044771529087/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdzVLSlNBEAE",
            "reviewer_name": "Dylan Cheng",
            "rating": 5,
            "review_text": "I ve been to Blue Water Cafe for several special occasions, but this might ve been the best dinner yet. The seafood tower was delicious. Each individual item is fresh. The kusshi oysters were smooth and creamy, and honestly some of the best oysters I ve had. The tenderloin was cooked nicely, but what made the dish shine was the combination of the addicting buttery potatoes, the fresh carrots, and the tenderloin itself. Note: a Dutch Mule on the side is a pretty great addition to the meal.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:47.466686",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 53,
            "total_number_of_photos_by_reviewer": 65,
            "reviewer_url": "https://www.google.com/maps/contrib/117901324917897675421/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MGJhNWx3RRAB",
            "reviewer_name": "Melissa Meng",
            "rating": 5,
            "review_text": "Really elegant,high end seafood restaurant, a lot space inside and outside, need to reserve the table 3 days early prior your appointment. Really fresh seafood, we ordered  6 different main dishes, all looked good, tasted perfectly, 4 desserts were worthy to try. The waitress who served our table is professional, she introduced herself to work this restaurant more than 10 years, and introduced the popular dishes to us. Always checked us any needs. I booked the dinner for my clients, they were all satisfied about everything that they received here. Strongly recommend to my friends in the future. Very suitable for business, company gathering , family and friends gathering. Won t disappointed here.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:47.469937",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 6,
            "total_number_of_reviews_by_reviewer": 146,
            "total_number_of_photos_by_reviewer": 1468,
            "reviewer_url": "https://www.google.com/maps/contrib/105256343876120147960/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM3RMSmR3EAE",
            "reviewer_name": "Lukas S",
            "rating": 5,
            "review_text": "OVERALL: Its a local favorite - great wine selection and we had only stunning dishes. Highly recommended for any occasion (its a little pricey and reservations are recommended) DETAILED: The reception did not feel welcoming and was almost a little arrogant. However, beyond that first 5 minutes, we had excellent service - knowledgeable waiters and wine connoisseurs. Starter and Mains were equally great. We did not try the seafood tower since we prefer many dishes in a sequence - but our high expectations were met. DRINKS: Great selection of international and domestic wines. Cocktails were amazing too (espresso martini was just perfect with our dessert).",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:47.472949",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 69,
            "total_number_of_photos_by_reviewer": 483,
            "reviewer_url": "https://www.google.com/maps/contrib/109964506986373501942/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeXVLY25BRRAB",
            "reviewer_name": "K B_898",
            "rating": 5,
            "review_text": "Excellent service! The food is delicious and the atmosphere was elegant yet inviting. For special occasions Blue Water Cafe is a great option. Its nestled in a retro fitted packing district. With charm and a lot of appeal too. Our service staff was incredible too, they offer suggestions on drinks and honest opinions on dishes too. Our night out included the seafood tower -amazing and fun -, but there were so many other inviting options as well. All the dishes looked great and the guests were happy. If you are looking for a special spot to enjoy time with special people this is a great place.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:12:47.475772",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 38,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/115272091373710703325/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad01pcjBnRRAB",
            "reviewer_name": "Deborah Schwartz-Kates",
            "rating": 5,
            "review_text": "We were searching for a restaurant with fresh, local seafood and a West Coast flair. Blue Water Cafe was the perfect place for us! Our server guided us through the menu with expert advice and helped us make the perfect selections for our table. We started with the Seafood Tower, which was a great introduction to all that the restaurant had to offer. We next explored the sushi menu, which was by far our favorite part of the dinner. The Japanese style of sushi preparation by an amazingly talented chef was the high point of the evening. A terrific wine list, including great selections by the glass, complemented the meal.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:47.478912",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 87,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/109041515818399161741/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaTh2X0lnEAE",
            "reviewer_name": "HJ Marshall",
            "rating": 5,
            "review_text": "We were there for a wedding. It has a cozy room for the special event. The food was great, the service was awesome and the couple got married. It was a perfect night.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:12:47.481754",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 210,
            "total_number_of_photos_by_reviewer": 2278,
            "reviewer_url": "https://www.google.com/maps/contrib/113860020668252317398/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLW9QV2N3EAE",
            "reviewer_name": "A&D Critical",
            "rating": 5,
            "review_text": "Wow, this really was a great experience. I was worried that Blue Water Cafe s day had come and gone. How wrong I was. The scallops, short ribs, sablefish, and sushi were all amazing. The salmon terrine was a highlight. Will certainly return for sushi alone. Atmosphere was great and overall very impressed with the acoustics/volume. Easy to hear everyone at our table without a need to raise our voices.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:12:47.484530",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 51,
            "total_number_of_photos_by_reviewer": 71,
            "reviewer_url": "https://www.google.com/maps/contrib/114777300004814234726/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMTVUNHVRRRAB",
            "reviewer_name": "Joseph Dort",
            "rating": 5,
            "review_text": "Keep it up folks! Always my favourite place to dine in Vancouver. Went last night with my wife, daughter, and soon-to-be son-in-law. Our lood was delicious and our server was excellent. The Yellowfin tuna was perfect as were the halibut and the salmon dishes. Cocktails were tasty and our wine, although expensive, was perfect for our food and for the special occasion. Thanks again! JDYYC",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:47.487173",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/107455870826802795432/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNjVUMEZBEAE",
            "reviewer_name": "Dr. Neda Rafati",
            "rating": 5,
            "review_text": "So impressed by the level of customer service here. Never disappoints. This restaurant is in the heart of Yaletown and known for their seafood tower which is so delicious. I ve tired the steak as well and highly recommend it.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:12:47.489635",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 27,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/115501039918758813228/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcnZTUUtREAE",
            "reviewer_name": "Stanley Wongus",
            "rating": 5,
            "review_text": "Awesome experience! This is a must go if you are looking for a high quality meal especially involving seafood and drinks! Chris was an excellent server and provided great info and recommendations on the menu. The bread rolls with the spread was nice (really liked the lentil based one). All the seafood was super fresh and high quality, and yes it was pricey, but really worth it for the experience.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:48.197351",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 125,
            "total_number_of_photos_by_reviewer": 253,
            "reviewer_url": "https://www.google.com/maps/contrib/107562062870621096770/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMl8yRzRRRRAB",
            "reviewer_name": "al may",
            "rating": 5,
            "review_text": "I went to Blue Water Cafe for the first time last night for a work function. The food was absolutely amazing. Everything was perfectly cooked and seasoned. I had the smoked salmon terrine, arctic char and elderflower creme brulee. The arctic char skin was perfectly crisp. Im also impressed by floral desserts that doesnt end up tasting like soap. The elderflower creme brulee was just so good! It was floral yet sweet and creamy. The service was attentive. I would love to go again to try the rest of their menu.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:12:48.200707",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 166,
            "total_number_of_photos_by_reviewer": 1155,
            "reviewer_url": "https://www.google.com/maps/contrib/106040853204567642278/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbDhqd0hREAE",
            "reviewer_name": "Emma D.",
            "rating": 5,
            "review_text": "Outstanding food and service. I m impressed! The waitress had great knowledge of the menu and explained everything thoroughly. Food came quickly, tasted fresh and delicious. Looks like the seafood tower is very popular so I will definitely try it next time",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:48.204494",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 242,
            "total_number_of_photos_by_reviewer": 982,
            "reviewer_url": "https://www.google.com/maps/contrib/117790109827116226975/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoclBuM1hnEAE",
            "reviewer_name": "leesa tran",
            "rating": 5,
            "review_text": "Hands down one of the best seafood restaurants I have tried. Large selection of seafood options. Ordered all of the daily oysters and I thought that it all tasted super fresh. This place also had one of the best sablefish I have ever tried. The fish was so soft and melted right into my mouth. The wagyu flat iron was also super juicy. Wasn t a huge fan of the sauce it came with however you don t really need sauce when it comes to waygu. Tried out a few of the unsung hereos 2023 menu options as well. Tried the Uni carbonara and I personally thought that it was okay. Tried the herring creme brulee and thought it was alright as well. Lastly ordered the panna cotta and it was really good as well besides the chilli taste.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:12:48.208096",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 458,
            "total_number_of_photos_by_reviewer": 1101,
            "reviewer_url": "https://www.google.com/maps/contrib/110113844333621118253/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCenIzOGRnEAE",
            "reviewer_name": "Peggy Shen",
            "rating": 5,
            "review_text": "My go-to seafood restaurant. A bit crowed than years ago but the quality of food remain excellent. Seafood tower is highly recommended with larger groups. Main dishes have interesting mix of fusion style.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:12:48.211013",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 26,
            "total_number_of_photos_by_reviewer": 42,
            "reviewer_url": "https://www.google.com/maps/contrib/101793326323420885173/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbzk3aFlREAE",
            "reviewer_name": "Helen",
            "rating": 5,
            "review_text": "We had an amazing time here with great food and service. They also have very neat cocktails that I recommend trying. Seafood tower: this came with a great variety of seafood and ceviche. The seafood were all very fresh and definitely worth the money. There s other options to get just one tier or seafood tasting so there s something at every price point and preference. Dungeness crab roll and sable fish aburi: both tasted extremely good, highly recommend both rolls. Smoke salmon terrine: this tasted okay to me, the smoked salmon flavor was not very strong Pork cheek: one of my favourite dishes of the night, it is super tender and I enjoyed the combination of flavor and texture with the cauliflower and hazelnuts underneath Kobe style short ribs: it tasted like elevated stewed beef. The flavor was good and the vegetables paired well Sablefish: the most average dish of the night. We got it because it was well reviewed but I found it to be nothing special. It tasted fine but the fish didn t taste that fresh",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:12:48.214237",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 96,
            "total_number_of_photos_by_reviewer": 376,
            "reviewer_url": "https://www.google.com/maps/contrib/116411925674780553788/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtLS0tU3JBRRAB",
            "reviewer_name": "Chris Clement",
            "rating": 5,
            "review_text": "The service and food are excellent, with a good selection of BC and many other wines. We sat on the heated patio which was nice, although the indoor seating looked better. The sablefish was hyped as their best dish, and although it was excellent I enjoyed the selection of oysters and special sushi of the day even more. Highly recommend!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:48.217156",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 276,
            "total_number_of_photos_by_reviewer": 1207,
            "reviewer_url": "https://www.google.com/maps/contrib/102146898264467344776/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoa05XNnVBRRAB",
            "reviewer_name": "Saide Nur ALP (saide s)",
            "rating": 5,
            "review_text": "We seated at the bar which I thought the seats were really tight in between. The ambiance was super nice. We ordered sablefish sushi and sablefish main. Although we didn t expected as oshi, torched sablefish tasted mindblowing. The fish on the main was also flawless, but we didn t like the plate in total which since edamame and other things was not a good combination. We also ordered Uni Carbonara, and the flavor was so rich, maybe it was even better than the original. They don t keep chilled red wine as I prefer, but they have a good selection.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:12:48.219559",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 455,
            "total_number_of_photos_by_reviewer": 653,
            "reviewer_url": "https://www.google.com/maps/contrib/103211665299438581535/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOElIcmNBEAE",
            "reviewer_name": "Padraic O'Rourke",
            "rating": 5,
            "review_text": "10/10 all the way. French server sorry didn t get his name. Food was first class and service was free flowing. Can t wait to return. Great job to all the team at Blue Water.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-08 01:12:48.221998",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/111999227262257344646/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaamFqZVFREAE",
            "reviewer_name": "Josie Swan",
            "rating": 5,
            "review_text": "A birthday dinner.  Sat at the bar and Ben and Andrea chose food and wine for us.  Absolutely outstanding in every aspect. Hard to pick the best but I m going to recommend the sable fish. Big thanks to the kitchen crew. Magnificent. Best in class.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:12:48.225231",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 115,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/100535800577435064540/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeXVPbGZBEAE",
            "reviewer_name": "Harry",
            "rating": 5,
            "review_text": "Great atmosphere, amazing selection of seafood and convenient location! Picked this location to celebrate our first night in Vancouver and we did not regret the decision. We started with the seafood tower. The oysters    were a bit on the small side but the shrimps were like Arnold Schwarzenegger of shrimps! The jellyfish was our favourite. We picked seared scallops, tuna and sablefish for main course. And we finished off with the assorted sorbets. You really cannot go wrong with seafood here. To me what makes a good seafood dish is the ingredient itself, and here you will get the freshest fish, shrimps, oysters and whatnots. Highly recommend this place!",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:12:48.829242",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 232,
            "total_number_of_photos_by_reviewer": 980,
            "reviewer_url": "https://www.google.com/maps/contrib/114979382788645463544/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a29XcGRBEAE",
            "reviewer_name": "Bonnie Leung",
            "rating": 5,
            "review_text": "Excellent mocktail! Nice seafood. Nice service too, i like our guy wz a red bowtie",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:12:48.833132",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 201,
            "total_number_of_photos_by_reviewer": 715,
            "reviewer_url": "https://www.google.com/maps/contrib/118301247952259172656/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeFlXWVJBEAE",
            "reviewer_name": "Rnie Javier",
            "rating": 5,
            "review_text": "Blue Water Cafe is amazing! Service is fast and attentive. Prior to coming here I never enjoyed seafood, but we decided to get the shellfish plateau and it was perfect for those who need an introduction to seafood on ice. They have a delicious house made ketchup that you must try! All the other food we got was also great. Looking forward to try more oysters and waygu here next time.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:48.836277",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 5,
            "total_number_of_reviews_by_reviewer": 127,
            "total_number_of_photos_by_reviewer": 240,
            "reviewer_url": "https://www.google.com/maps/contrib/112370552851979007170/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOVlYR2FREAE",
            "reviewer_name": "Eddy Boudel Tan",
            "rating": 5,
            "review_text": "I hosted a celebratory meal in one of the private rooms, and it was a flawless evening. The Atlantic Room was gorgeous (like dining in a lavish wine cellar, but with natural light from the French windows that face the terrace), and the dishes were perfectly plated and delicious (get the seafood tower!). Most importantly, the service was applause-worthy. The two hosts assigned to our room were welcoming, friendly, and remarkably professional. They went with the flow of the evening while staying very communicative -- we never felt obliged to a rigid schedule, and our glasses were never left empty. Everything felt perfectly orchestrated, almost effortless (though Im sure it was far from). Bravo!",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:12:48.839041",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/103096649301587877946/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScVBfdktREAE",
            "reviewer_name": "Michel Duran",
            "rating": 5,
            "review_text": "What an amazing evening we spent at the Blue Water Cafe! We were there for a little treat   celebrating a birthday! Energetic, cool and classy atmosphere, fantastic food   my taste buds are still to the roof with the Sablefish dish amongst other seafood we tested. Antoine, the waiter combined high professionalism and friendliness. He made my day with the Happy Birthday on the desert plate. All these details combined made the evening very special! Highly recommended place. Cheers.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:12:48.842267",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 32,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/118226043819328295352/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMW9udVhREAE",
            "reviewer_name": "Christy Turner Aurora Media",
            "rating": 5,
            "review_text": "Choosing a restaurant in Vancouver is not an easy task, with the cities reputation of offering some of the most exquisite culinary experiences available in the Western world. Thankfully, I was visiting with my man who among his many talents has an experienced, discerning palette. We reserved a table in the heated patio, which was a cool atmosphere under a warm series of heat lamps they were adept at adjusting! The patio also provided interesting & colourful atmosphere as you get to subtlety people-watch, and a few small scenes unfolded that Blue Water Cafe staff handled with finesse and class! Kudos to the entire staffs discreet and compassionate approach to the poor guy behind us whos date walked out on him and a mouth-watering 3 tier seafood tower! I loved gazing around the patio area and greenery, and savouring the very enjoyable company of my man on a very memorable trip. Our server, Chris, was one of the most personable, knowledgeable and passionate-about-his craft professionals I have encountered in many years. He has a very warm, likeable approach and drops some great one-liners while answering our questions about the menu, offering his recommendations, and even delving into the Toptable ownership story that my bf is quite familiar with and avidly follows. On Chriss mention, we ended up visiting Thierrys (their chocolate/cafe) the next day for an espresso and a pastry. (Im lucky, I know! x) Ask for Chriss section if you can when making your reservation, word is it that he knows a guy that can make that happen with whatever request you throw at him with respect to their divine menu. Shout out to their oyster selection, the freshest salmon, and delectable dessert offerings.  Thanks Chris, you rock!",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:12:48.844617",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 118,
            "total_number_of_photos_by_reviewer": 143,
            "reviewer_url": "https://www.google.com/maps/contrib/103799436762225726231/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcE5UTVl3EAE",
            "reviewer_name": "Michael Johnson",
            "rating": 5,
            "review_text": "Lined up in the Yaletown Restaurant District, bustling staff dressed sharp, well trained, and smiling were always busy, yet were still able to give us personal attention and never let our glasses run dry. The restaurant noise during the weekdays feels like business associates considering recent transactions and the hard-to-find EH Taylor on the wall. The Seafood Starter for 2 provided a nice sampling of what this restaurant could offer.  Sour ceviche balanced with crispy fried chickpeas and fresh green herbs. Crab and shrimp salad sandwiched between thin radish slices for a creamy flavorful bite.  At the top of the sampling, plate tower is lightly smoked salmon with salty cheese sauce, making you feel like you just ate NY city lox and capers.  World-class sushi is served here, along with Aburi Sablefish Battera, which after eating, you may consider briefly giving up all other food. Somehow we still left with diners regret carefully eyeing the principle sable dish on the way out the door.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:12:48.847732",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 71,
            "total_number_of_photos_by_reviewer": 121,
            "reviewer_url": "https://www.google.com/maps/contrib/109776774807383801230/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKemM3dktBEAE",
            "reviewer_name": "D S",
            "rating": 5,
            "review_text": "I cant say enough good things! Best dining experience in a long time. Ive been to way too many overpriced, mediocre at best, restaurants lately. Blue Water is the place to go if you actually care about a proper dining experience. Can you tell Im bitter...   (way too many over-priced terrible restaurants lately). Seriously though, the oysters were the best weve possibly ever had, the prawn cocktail as well. Massive fresh prawns with incredibly flavorful cocktail sauce. Sable fish was perfection and the desserts.. dont even get me started. Impeccable service from start to finish. 5 stars all around. Thank you, Blue Water",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:12:48.850222",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 78,
            "total_number_of_photos_by_reviewer": 9,
            "reviewer_url": "https://www.google.com/maps/contrib/112757682490856525567/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbHJITlFnEAE",
            "reviewer_name": "Chris Krajewski",
            "rating": 5,
            "review_text": "Great wine selection, superb food!!! Had my first dining experience at the Blue Water Cafe over 15 years ago and it is amazing how you managed to consistently keep the quality of your services at such a high level. Kudos!!!",
            "published_at": "4 days ago",
            "published_at_date": "2023-11-18 01:12:48.853001",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115061534218368922929/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2MjlDVnBRRRAB",
            "reviewer_name": "Angeline Le Menach",
            "rating": 5,
            "review_text": "We were visiting Vancouver from Toronto and had dinner at Blue Water Cafe on Saturday September 11th (and Sunday September 12th!). We were so impressed by the food, the service and the ambiance. The seafood tasting for 2 is not to be missed, the scallops and sablefish were absolutely delicious. Ingredients are very fresh, beautifully prepared and presented. Our server Tara brought our experience to the next level. She provided excellent service, we felt taken care of from beginning to end, she is very knowledgeable about the menu and she made this experience exceptional for us. It was so special that she was one of the main reasons why we decided to go back the following day for dinner in order to try more items in the menu (including the Sole Meuniere that had sold out on Saturday, that they put on the side for me and was to die for!!! I am from France and I can testify it was excellent Sole Meuniere) Everything is cooked to perfection, very flavourful. We also had desserts on our 2nd dinner and once again they were delicious and using top quality ingredients (valrhona chocolate for the dark chocolate cake!) Saturday was a busy night and you can tell that everybody is synchronized, all the staff is very professional and their system is well thought of which results in guests receiving an impeccable service. Special mention regarding the communication between the staff. On Sunday (2nd dinner) our server Chris already knew we had come the day before and what we had for food and drinks, one more way to make us feel special. There is literally nothing negative to be said about the food and service. Price-wise, this is excellent value for money and totally worth it! Please open in Toronto...and bring Tara!!!!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:48.855716",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 7,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 6,
            "reviewer_url": "https://www.google.com/maps/contrib/107649396564942224400/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbGMyZk1REAE",
            "reviewer_name": "Tiffaney Hayman",
            "rating": 5,
            "review_text": "I was there for my birthday and it was me and my husbands first time. We were welcomed quickly and were sat efficiently. Our server, Roddy, was the star of our visit. He was incredible in every aspect; lovely, accommodating, attentive, the best service we have ever had. And this is a comment based of us working in the industry. The food was exceptional. No words to describe how great. Go here, or you will miss out.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:49.532956",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/106299831426788304390/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cE9ibW53RRAB",
            "reviewer_name": "Jessica Cheung",
            "rating": 5,
            "review_text": "Specifically asked my server Melissa for her name because she provided us with impeccable service the entire night. The food was amazing, had beautifully cooked scallops followed by delicious sorbet. All in all a great dining experience here.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:12:49.534762",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/113755431695640100834/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwelBmZU13EAE",
            "reviewer_name": "Steve Arino",
            "rating": 5,
            "review_text": "Bluewater. Top shelf. Great food. Good service. Sit at the bar. Have a few drinks order the Tuna and Trout tartar.  Highly recommended.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:12:49.536977",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": 59,
            "reviewer_url": "https://www.google.com/maps/contrib/112416307714026343662/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMXZELWVnEAE",
            "reviewer_name": "Jenni Merrifield",
            "rating": 5,
            "review_text": "I took one of my best  friends here for her 60th birthday and it was absolutely worth every penny. The food was devine, the atmosphere was energizing and the service was excellent. If youre a chocolate lover I highly recommend their Warm Dark Chocolate Cake which oozes liquid pleasure. (I also suggest requesting a scoop of their raspberry gelato in addition to the vanilla bean ice cream) If youre not a chocolate lover my friend recommends the Greek Yoghurt Mascarpone Cheesecake (which comes with the afore mentioned raspberry gelato) Wheelchair accessibility: My friend uses a power wheelchair and had no trouble getting in - the  main entrance is a revolving door but there is a set of regular doors just a few metres to the left. The handicap stall in the womans room was appropriately sized so that she could turn her chair around and also shut the door after going in. It also came with bidet options!",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:12:49.539111",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 30,
            "reviewer_url": "https://www.google.com/maps/contrib/105250547654322771935/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Z043TnJ3RRAB",
            "reviewer_name": "Sanaah Devsi",
            "rating": 5,
            "review_text": "Their seafood is amazing! Try their seafood tower and their sablefish. Highly recommend for a good but reasonably priced dinner! Service was amazing.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:12:49.541123",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 33,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/107614485350164543256/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dXY2cHdRRRAB",
            "reviewer_name": "RAQUEL OCAMPO",
            "rating": 5,
            "review_text": "Ive been a few times for birthdays, work functions and dinners with friends, but this time for a wedding.  There is a private room just off the main dining area...beautiful long tables in a wine room.  Seafood tower was excellent, sushi, oysters, shrimp, several cechives, mussels and clam. Everything super fresh. Had the tenderloin and veg for main;  good portion and cooked perfectly.  We also had the Panna cotta and chocolate cake which was tasty too.  No bad bites. They also have a vast wine selection and excellent cocktails.  Overall, consistently great.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:49.542867",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/111315433727106062012/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dkxpUkp3EAE",
            "reviewer_name": "j seitz",
            "rating": 5,
            "review_text": "Better than Bones in Atlanta,  better than Lahaina grill in Maui, this place is 5 stars from the drink selection to the ambience  to the amazing food and service! A must experience in Vancouver. Wagyu from Japan, Real bluefin tuna, amazing selection of wines and the elderflower creme brulee was scrumptous!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:12:49.544521",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 45,
            "total_number_of_photos_by_reviewer": 24,
            "reviewer_url": "https://www.google.com/maps/contrib/110013052045998887065/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhc3UtT0tBEAE",
            "reviewer_name": "Kevin Tran",
            "rating": 5,
            "review_text": "Amazing food and an extensive list of wines.  This place always impresses with their service, food, and ambience. The freshness of their seafood is definitely top class.  From preparation of the dishes, to the plating and presentation; there is attention to subtle details.  The desserts are a great way to end an evening of indulgence. From the moment you step foot in the door, you feel welcomed.  The team there work well together to create a venue perfect for celebrating any occasion.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:49.546720",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 74,
            "total_number_of_photos_by_reviewer": 162,
            "reviewer_url": "https://www.google.com/maps/contrib/108664899535787954762/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM0p6d1l3EAE",
            "reviewer_name": "Sarah Perry",
            "rating": 5,
            "review_text": "Our waiter, Frankie was so wonderful. He came over when we needed him, yet didn t bother us. He knew the timing of when do to everything and knew the menu so well. He recommended the most amazing dishes. We weren t rushed at all, and the atmosphere was delightful. Very grateful for such a wonderful experience, will definitely be coming back here!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:49.548365",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/110018950173140719854/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNcFBhc3FRRRAB",
            "reviewer_name": "Cheyenne Jones",
            "rating": 5,
            "review_text": "Soooo delicious!!! Every single thing you read on Google, positive that is, its all true. We are from OK and first time visitors here. The service is stellar, the food is impeccable (you eat with your eyes), the taste is equally mouthwatering and delicious! Our server was the sweetest!!! Took time to explain the menu outside of the normal criteria, she explained favorites and popular dishes. She also took the time to get to know us while keeping it short and pleasant. We shared a starter, each got a meal and one glass of local Chardonnay (incredibly scrumptious). Parking is a little confusing, you need to pay by phone or at the kiosk. Indoor and outdoor seating, very elegant dining with mood setting light. Bathrooms are immaculate and high tech. We did go during the month of December and there was festive holiday decor.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:12:49.549904",
            "response_from_owner_text": "Thank you Cheyenne for taking your time to leave the great feedback.  We are happy to hear that you enjoyed everything.  We would be proud to share your kind words with the team both front and back of house. We look forward to seeing you again soon. Best Regards, Stephan Cachard Restaurant Director Stephan@bluewatercafe.net",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-22 01:12:49.549904",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 208,
            "total_number_of_photos_by_reviewer": 192,
            "reviewer_url": "https://www.google.com/maps/contrib/107343893356774684141/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bGZIQVh3EAE",
            "reviewer_name": "Sean Wiebe",
            "rating": 5,
            "review_text": "The food, service and ambiance was awesome.  While on the expensive side it is absolutely worth it for a special occasion.",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:12:50.191292",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 134,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111156190080069959940/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocnJ6eGdRRRAB",
            "reviewer_name": "Donald Halvorsen",
            "rating": 5,
            "review_text": "Delightful dinner.  We sat outside in the heated patio area.  Much quieter than the main room.  We had the ceviche starter and then the Arctic Char and Sabelfish.  All perfectly cooked and delicious.  Our waitress Yin was very efficient and made good recommendations.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:12:50.195116",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 37,
            "total_number_of_photos_by_reviewer": 81,
            "reviewer_url": "https://www.google.com/maps/contrib/114287321574347538064/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHejZENGh3RRAB",
            "reviewer_name": "Tom Dusatko",
            "rating": 5,
            "review_text": "Always fantastic. My wife and I have been several times - this time we tried the Kobe short ribs and also the waghu steak from Alberta. Both were absolutely amazing, with flawless execution as usual. Also started with the venison terrine (very tasty) and the mandatory half dozen oysters chosen by the waiter. Recommended.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:50.199501",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 36,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/113498360069491063396/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtd29Hd3N3RRAB",
            "reviewer_name": "Albert Lynn",
            "rating": 5,
            "review_text": "We went back to Blue Water Cafe + Raw Bar tonight and it was a good as I remembered it to be. This is one of my all-time favourite restaurants because the food is spectacular, the atmosphere is vibrant, and the service and attention to detail is impeccable. It s just a very comfortable place to have an amazing dinner",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:50.202630",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 44,
            "total_number_of_photos_by_reviewer": 311,
            "reviewer_url": "https://www.google.com/maps/contrib/111569950459741632848/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNVBQQ1NREAE",
            "reviewer_name": "No MSG No Garlic Foodie",
            "rating": 5,
            "review_text": "Interesting. Not stuffy. Thoroughly enjoyable. This is the way to eat sushi! The sushi bar in a typical Japanese restaurant has a fridge that separates the customers from the sushi chef. As a results, it feels like youre sitting at a high top but without much sushi making to watch. Not so at the Bluewater sushi bar. The design was well thought out. The customers actually sit a little higher than the sushi work surface. The sushi fridge is either behind the chefs or below the counter. We had an extremely enjoyable evening watch five sushi chefs produce an amazing number of sushi and sashimi dishes for a full restaurant. When we eat sushi, the temperature of the fish really matter to us. So, we like the fact that our hamachi sashimi is not frozen, but still cold and firm enough. We are glad that we ordered gradually so that our raw food does not come at once only to quickly deteriorate before we can consume it all. Unlike some sushi bars, we had a wait person who took our orders and provided excellent service. When part of an order is waiting for another items, the plate is placed behind the chefs next to a vertical freezer, so we can still have some visual enjoyment. This sushi bar is not part of the increasing trend in Vancouver Japanese restaurants which provide a set menu with omakases and we love Bluewater for keeping it this way as we are particular in what we choose and when we want to eat each piece. Although the restaurant was full that night, it was not insanely noisy at the sushi bar. Well done, Bluewater   we will be back!",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:12:50.205749",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 264,
            "total_number_of_photos_by_reviewer": 1028,
            "reviewer_url": "https://www.google.com/maps/contrib/104406503696167696791/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5dC16VDl3RRAB",
            "reviewer_name": "Dr. Naresh.R. Thumati",
            "rating": 5,
            "review_text": "AMAZING Customer service. They have great interaction with customers. The bartender Rachel did great service and made our evening awesome. I don t like one of the cocktail ( its just my pallet issues), she immediately switch it. She said.. you dont have to drink and pay for it if you don t like it. one of our meals came late so they gave it on the house a.k.a. for free. Food was at its best. Fresh cook bread was amazing with a little nice butter to top it off. The halibut was amazing. Dover fish was definitely the highlight of the evening amazing taste amazing the cup so much flavour it was amazing. The cocktails were good. The Lava cake tasted so good ...the cake part was really moist and the chocolate was flowing out... it was all so pretty... the ice cream and chocolate mixture ratio was amazing amazing",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:50.208461",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 130,
            "reviewer_url": "https://www.google.com/maps/contrib/100138503621543195413/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bTRUNzBnRRAB",
            "reviewer_name": "Hanna Holmes",
            "rating": 5,
            "review_text": "Every time we visit Vancouver, we make it a priority to come here for dinner on our last night. The meal and experience is excellent every time. On our recent visit, we ordered cocktails, seafood tasting for two, oysters, sablefish, and tiramisu for dessert. Everything was phenomenal, but the sablefish was impeccable - the best fish we ve ever tasted. It was cooked beautifully. In the past, we ve ordered the scallops and those are magnificent as well. I m addition to the food, the service is professional and kind - we re always well taken care of. I rarely give out five stars but this place never fails to impress us.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:50.211010",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 27,
            "reviewer_url": "https://www.google.com/maps/contrib/117849318028058430250/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbXVLV1h3EAE",
            "reviewer_name": "Gajan",
            "rating": 5,
            "review_text": "I was searching for the best spots in Vancouver for seafood and Blue Water kept getting recommended by friends. The customer service level of our server Brent was exemplary and definitely made our visit to Vancouver a memorable one. We greatly appreciated the way the Brent made special efforts in making our dinner both personable and fun. Brent explained everything in great details and made some excellent suggestions. Blue Water and Brent  ..Thanks for making it a fun and amazing experience. We will definitely come back !!!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:50.213456",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 73,
            "total_number_of_photos_by_reviewer": 273,
            "reviewer_url": "https://www.google.com/maps/contrib/114680307703471593957/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbGZMVUJREAE",
            "reviewer_name": "Richard Fung",
            "rating": 5,
            "review_text": "Quick Summary Had a fantastic birthday dinner. Everything was fantastic, from the service, the food, and the ambiance. The sablefish and the seafood tasting for 2 were the most memorable dishes. Highly recommend to make reservations. They pride themselves in being sustainable, so thats a plus Food- 5 stars Seafood tasting for 2- Im so glad our server convinced us to give this a try. Very elegantly plated and I loved how each plate had a different flavor profile and was ordered perfectly. Highly recommend Halibut- the halibut was good, but slightly disappointed that the fish was slightly overcooked. The sauce masked the slightly overcooked fish, but it was still pretty good Sablefish- this was phenomenal. Cooked perfectly and enjoyed each and every bite. Will come back to get this from now on Warm dark chocolate cake and greek yoghurt cheesecake- both desserts were pretty good. They were standard desserts. Done well but not as memorable as the dishes listed above Service- 5 stars Our server was fantastic. Excellent service throughout and loved his recommendations and honesty Bottom Line This was my by far my favorite restaurant in Vancouver. Would highly recommend and will be coming back for that sablefish",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:50.216137",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 307,
            "total_number_of_photos_by_reviewer": 1011,
            "reviewer_url": "https://www.google.com/maps/contrib/104203729809591171711/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdExYQzh3RRAB",
            "reviewer_name": "Alice Lesmana",
            "rating": 5,
            "review_text": "Had a blast here 2 weeks ago. I was with some friends and initially we thought we try our luck for Elisa s bar seating as my friends told me they wanted some burgers from there and the bar should be open. We got there, of course the bar was full. So a friend was hungry, we decided to stop by at Blue Water Cafe for a drink or two and some appes before heading back to Elisa. 2 hours later, we still haven t got a call and since we were comfortably seated, we decided to just stay. We were seated at the sushi bar and awesome experience. Kinda fun coz you get to see the chef making all the nigiri, sushi. We ordered and at one point told the chef to make us whatever he wanted (i.e. a bit of a omakase style), oh my it taste so good!!! Their cocktails were sooo good as well. It was a fun night and I will definitey be back! Check out all the food we ordered!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:50.218747",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 53,
            "total_number_of_photos_by_reviewer": 157,
            "reviewer_url": "https://www.google.com/maps/contrib/105631914158990977308/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdjVHeVd3EAE",
            "reviewer_name": "Joyce",
            "rating": 5,
            "review_text": "This is the place to go if you want a good consistent meal. Or you have friends in town visiting and you want to impress them. One of the few spots in town that can handle 2 large private parties, a full dining room, and still not force you to get a set menu with a party of 8 and more. There is a reason why Blue water does so well! Compliments to the amazing team.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:50.852675",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 106,
            "total_number_of_photos_by_reviewer": 238,
            "reviewer_url": "https://www.google.com/maps/contrib/100404882456508316783/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURab0tnSRAB",
            "reviewer_name": "Zamir Shamji",
            "rating": 5,
            "review_text": "Sat at the bar. Adam was serving my brother and I. He made an incredible recommendation for the oysters on the menu. We also tried a few of the Japanese whiskeys they had on offer. Adam made sure we got exactly the experience we were looking for. I cant remember recommend this place enough.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:50.855534",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 146,
            "total_number_of_photos_by_reviewer": 16,
            "reviewer_url": "https://www.google.com/maps/contrib/108805154581822766594/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwcWJURVZBEAE",
            "reviewer_name": "chris chan",
            "rating": 5,
            "review_text": "The hype is real. Came with a group of 9.  The server took great care of us.  Started us off with a seafood tower and an array of starters. He recommended great main dishes. The sable fish has been on the menu 16 years. Its a must. We had a delicious Chablis he selected for us to accompany most of the meal, and finished with a Chardonnay. A very memorable meal. Highly recommended.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:12:50.858739",
            "response_from_owner_text": "Thank you Chris for the great feedback.  We are proud to hear that you enjoyed everything. We look forward to seeing you again soon. Sincerely, Stephan Cachard Restaurant Director Stephan@bluewatercafe.net",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-22 01:12:50.858739",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 330,
            "total_number_of_photos_by_reviewer": 389,
            "reviewer_url": "https://www.google.com/maps/contrib/100191831192041211945/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMmZMa1l3EAE",
            "reviewer_name": "E. Ho",
            "rating": 5,
            "review_text": "Food, ambiance and service are top-notch! I had the free-range chicken, whose breast was extremely moist. My companion and I shared the mixed salad, which had graham crackers sprinkled on top: the sweetness of the cracker was a bit weird and off-putting in an otherwise refreshing salad. At the end of the meal, we were treated with a small piece of financier as a sample. The dining room does get noisy when its full, but all in all, this is a great place to come to celebrate special occasions, or when you are looking for the increasingly rare exceptional food and service. Vegetarian options: Polenta",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:12:50.861856",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 35,
            "total_number_of_photos_by_reviewer": 18,
            "reviewer_url": "https://www.google.com/maps/contrib/110862075484030117846/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMk1uQjJnRRAB",
            "reviewer_name": "Clash City",
            "rating": 5,
            "review_text": "Absolutely stunning dining experience! Exquisite cocktail and food so delicious, we would happily eat there again tonight! The seafood sampler tower is a MUST have! Sadly the halibut had already sold out, but the Sablefish was sublime and the Char was delicious!",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:12:50.864677",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109596219874968098444/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeWRYMFBREAE",
            "reviewer_name": "Brian Shaler",
            "rating": 5,
            "review_text": "Can t add much to what people have already said. It s a top notch restaurant in the heart of restaurant row. Even on a Thursday night it s BUSTLING!  Service, ambience and food were all amazing. I recently had Sablefish at Coast and Pink Peppercorn and I thought this one trumped them both.  The Tuna is great and Sea Bream was melt in your mouth delicious.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:50.867712",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 176,
            "total_number_of_photos_by_reviewer": 486,
            "reviewer_url": "https://www.google.com/maps/contrib/111814348144244019843/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdmI3NFZREAE",
            "reviewer_name": "Tess Filling",
            "rating": 5,
            "review_text": "Staff were wonderful, drinks were great, and the raw bar dishes were delicious. The tsunami dish (pictured) was so perfectly balanced. We will be back during our next trip to Vancouver.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:12:50.869966",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 49,
            "total_number_of_photos_by_reviewer": 12,
            "reviewer_url": "https://www.google.com/maps/contrib/111204981730110574141/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc0lySGlnRRAB",
            "reviewer_name": "Walter Chan",
            "rating": 5,
            "review_text": "My wife and I love the food and service here. The raw oysters served with garlic and some red wine vinegar dressing and horseradish are so good. We ve tried some of their sushi dishes and other mains like beef tenderloin and sablefish and most of them are just delicious. The desserts we ve tried are also top notch. The prices are expectedly on the higher end but it s worth it. Be aware that street parking in the area is pretty expensive.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:50.872603",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 53,
            "total_number_of_photos_by_reviewer": 91,
            "reviewer_url": "https://www.google.com/maps/contrib/115358131925361648013/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cHRhS2xBRRAB",
            "reviewer_name": "Michelle nguyen",
            "rating": 5,
            "review_text": "One of the best fine-dining experience Ive ever had in Vancouver. Our server Tara was delivered service beyond our expectation. She is very knowledgeable and we were really happy with her recommendation. Would be back!",
            "published_at": "4 weeks ago",
            "published_at_date": "2023-10-25 01:12:50.874726",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113178605186650604330/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMzZDSnZRRRAB",
            "reviewer_name": "Kelly Suarez",
            "rating": 5,
            "review_text": "The food and service was fantastic. All seafood was fresh and cooked to perfection Go early as the wine list might take about 30 minutes to get through! We had a bit of fun watching the wait staff pour wine out of ridiculous shaped decanters Place was busy, kitchen is open, and there is also a few food bar where you can watch Sashimi being made, Oysters being shucked and other dishes made to order. Prices a bit on the steep side, but all dishes we saw and ate were well presented and tasted fantastic. We had Scallops and Crab to start followed by Char and Lingfish, finished with 2 deserts and coffee.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:12:50.877273",
            "response_from_owner_text": "Thank you Kelly for the amazing feedback.  We will be proud to share your comments with our team. We look forward to seeing you again soon. Best Regards. Stephan Cachard Restaurant Director Stephan@bluewatercafe.net",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-22 01:12:50.877273",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/101841573071099402647/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodTZySHZBRRAB",
            "reviewer_name": "Bia Sales",
            "rating": 5,
            "review_text": "Excellent experience! Both food and service were outstanding. I want to come back and try everything in their menu!",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:12:51.548090",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 19,
            "total_number_of_photos_by_reviewer": 36,
            "reviewer_url": "https://www.google.com/maps/contrib/107526521081508823318/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrejhfV2hBRRAB",
            "reviewer_name": "S T",
            "rating": 5,
            "review_text": "Always a pleasure whether it s regarding the food or the service.  The fish has so far never been overcooked.  Services ranges from okay to superb.  The server from last night named Jennifer (not sure if I got her name right) was the best most cheerful, patient and friendly I ve met in a while.  Bluewater has become my go-to fish night out place of choice.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:12:51.551533",
            "response_from_owner_text": "Appreciated the feedback and thank you for your ongoing support. With best regards. Stephan Cachard Restaurant Director stephan@bluewatercafe",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-22 01:12:51.551533",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 49,
            "total_number_of_photos_by_reviewer": 532,
            "reviewer_url": "https://www.google.com/maps/contrib/100707956893522088664/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5eE5yRlVREAE",
            "reviewer_name": "Carla Cabrera",
            "rating": 5,
            "review_text": "I went yesterday to celebrate 12 years anniversary with my husband and the whole experience was wonderful. We tried the 5 course prix fixe menu going on now and it was really delicious. Food was amazing, lovely service (specially to my garcom that was so detailed suggesting alcoholic drinks regarding our preferences and likes, also he was so respectful and funny), romantic, cozy and beautiful ambience outside even in winter season. It was delightful and I am glad I chose this restaurant for this special occasion, it did not dissapoint us and exceed our expectations. Will definitely come back!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:51.554768",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 183,
            "total_number_of_photos_by_reviewer": 407,
            "reviewer_url": "https://www.google.com/maps/contrib/115436015707634081941/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpbmRlY05nEAE",
            "reviewer_name": "Cindy Tang",
            "rating": 5,
            "review_text": "We went to blue water cafe for our anniversary. The atmosphere was very nice, the food was enjoyable, the drinks were classic, the server was very friendly with sense of humour. We had the seafood tasting starter, and really enjoyed all of the four dishes. I especially enjoyed the smocked sockeye salmon terrine, it melted on my tongue like butter, so nice! I had the halibut which I thought I was ok. My boyfriend had the sablefish which is so so good!! It was done just perfectly. For dessert we had the warm chocolate cake, I think it was a little too much even for two of us to share - the chocolate filling inside was too sweet! If you can go easier on the sugar it would have been perfect.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:12:51.557348",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 182,
            "total_number_of_photos_by_reviewer": 997,
            "reviewer_url": "https://www.google.com/maps/contrib/105673729437178634565/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4ak9xZWtRRRAB",
            "reviewer_name": "Nicholas Quintillan",
            "rating": 5,
            "review_text": "Absolutely phenomenal birthday dinner. Excellent service and, as always, superb food. There were also a few nice surprises along the way. Truly one of Vancouver s best restaurants, if not the best. We also had a pre-wedding dinner here, which was also beyond excellent.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:51.559976",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 344,
            "total_number_of_photos_by_reviewer": 1771,
            "reviewer_url": "https://www.google.com/maps/contrib/118017075339925063009/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabk91YkF3EAE",
            "reviewer_name": "Gurjit Suri",
            "rating": 5,
            "review_text": "I wish I had pictures. Service was great.  Attentive and not overbearing. Food was delicious and well presented!  I had the halibut and as a table we got the Nigiri and Sashimi platter. We sat outside since it was such a beautiful day.  Temperature was perfect and it wasnt noisy.  Easy to converse with everyone, we sat up front and yet we were out of the way too.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:12:51.562823",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 63,
            "total_number_of_photos_by_reviewer": 458,
            "reviewer_url": "https://www.google.com/maps/contrib/108961856783068627842/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdC1xLUhBEAE",
            "reviewer_name": "Ken Tsang",
            "rating": 5,
            "review_text": "A couple of friends and I found ourselves in Yaletown on a Friday night after work, feeling like a couple of drinks and some food, nothing too formal, I mean some wings and nachos wouldve been just fine. We had no reservations anywhere so we knew wed have to try out luck sitting at a bar somewhere. After a fail attempt at Elisa we walked across the street to Blue Water and they were able to seat us at the sushi bar. Perfect! What was supposed to be a drink or 2 and move onto somewhere else, turned into an impromptu omakasi style experience. Kussi Oysters, Hamachi, negitoro, spot prawn sashimi and king crab mac & cheese were ordered by us before we asked the chef to just make us whatever he wanted. So we got some seared A5 Wagyu nigiri, tuna goma-ae and the most wonderful unagi I have ever had while we enjoyed various cocktails. I loved my barrel rested Negroni. On top of the amazing food we got, big thanks to the wait staff and of course the sushi chef for making a great night out of nothing for us. Kudos!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:51.565889",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 255,
            "total_number_of_photos_by_reviewer": 419,
            "reviewer_url": "https://www.google.com/maps/contrib/101381243949728139287/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdVpmNVVnEAE",
            "reviewer_name": "Hannah Lai",
            "rating": 5,
            "review_text": "What an experience at blue water cafe! We sat at the bar and Luke was super attentive and even offer a taste of Shiraz with our wagyu steak. We also ordered some custom drinks from the bar and they all tasted very on point. Oysters were super fresh and steak was amazing - must order. Another must order is their truffle fries - one of the best I have had and I don t usually even eat fries.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:12:51.568650",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 44,
            "total_number_of_photos_by_reviewer": 49,
            "reviewer_url": "https://www.google.com/maps/contrib/103602201798500092474/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOEs2akZ3EAE",
            "reviewer_name": "Rickard Omfors",
            "rating": 5,
            "review_text": "Great atmosphere and fresh seafood. The menu has a big variation. A very popular place. Very good staff. You should book in advance.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:12:51.571262",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 172,
            "total_number_of_photos_by_reviewer": 2030,
            "reviewer_url": "https://www.google.com/maps/contrib/106541005761682216265/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5b1pLSjFBRRAB",
            "reviewer_name": "Elsy Chow",
            "rating": 5,
            "review_text": "Lovely dinner We went here for a double birthday. Covid measures were in place. Lots of social distancing and mask wearing. We were seated in the wine celler room and had a lovely table. The service was friendly, informative and attentive. We enjoyed a 5 course set menu. The food was fresh and delicious. Drinks were yummy and cold. Loved their specialty Moscow mule. Duck salad, lamb, vanilla raspberry cake, and chocolate cake ALL Yummy. Definitely a 5 star experience. A great place place to treat yourself.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:12:51.573837",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 5,
            "total_number_of_reviews_by_reviewer": 326,
            "total_number_of_photos_by_reviewer": 3456,
            "reviewer_url": "https://www.google.com/maps/contrib/110663839474394579811/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}