{
    "place_id": "ChIJpQIEmt52hlQR8S-q3kWRMgU",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscnIzTjdRRRAB",
            "reviewer_name": "Andrei Matei",
            "rating": 5,
            "review_text": "Rob is without a doubt THE BEST SMP Artist in Vancouver. I probably spent over a year researching SMP Artists in and am SO happy that I went with Rob. His transformations speak for themselves and I left his studio feeling like a new person. If you re looking for NATURAL Results by one of the best, Rob James is your man. Thanks again for everything Rob!",
            "published_at": "3 days ago",
            "published_at_date": "2023-11-19 01:21:06.927305",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/107889277260904138191/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscXBqNUtnEAE",
            "reviewer_name": "Sang Hyun Park",
            "rating": 5,
            "review_text": "I want to express my heartfelt gratitude to Mr. Rob James. The journey my wife and I undertook in researching SMP was quite extensive, and locating a truly proficient specialist proved to be highly challenging. Encountering Mr. James was a stroke of luck for us, and we couldnt be more pleased with the outcomes. Especially, he achieved the most natural results concerning my hairline and color intensity, which is truly the most satisfying aspect for me. Believe me, not only is he the top SMP specialist in Western Canada, but he is also among the worlds leading experts. I have searched for SMP specialists in various Asian countries, including Korea, but finding someone who delivers results as natural as Mr. James was exceedingly challenging. Once again, I want to express my gratitude to him.",
            "published_at": "6 days ago",
            "published_at_date": "2023-11-16 01:21:06.929383",
            "response_from_owner_text": "Thank you so, so much Sang, I really appreciate it. Wonderful working with you and I look forward to seeing you again in 2024. Until then take good care and thank you again. Rob",
            "response_from_owner_ago": "6 days ago",
            "response_from_owner_date": "2023-11-16 01:21:06.929383",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101223306773028898953/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1OEtpVEJREAE",
            "reviewer_name": "Tracey Nguyen",
            "rating": 5,
            "review_text": "I recently completed a scalp micro-pigmentation class with Rob and I couldnt be more impressed with the experience. He was knowledgeable and patient, providing a comprehensive understanding of the technique. The hands-on practice sessions were invaluable, and I left with the confidence to perform SMP procedures on my own.  Rob continues to give support even after the course was completed. The class materials were well organized, and the kit he provided was top tier. Overall, it was an excellent learning opportunity, and I highly recommend this course to anyone interested in SMP.",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:21:06.931511",
            "response_from_owner_text": "Thank you so, so much Tracey, I truly appreciate the review. It was a fantastic experience training you and getting to know you. You re already a highly talented and skilled PMU artist and SMP is going to be a great addition to your business. I truly look forward to helping you and watching you succeed in the art of SMP. Rob",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:21:06.931511",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/109374573853125336510/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLTZhMWdnRRAB",
            "reviewer_name": "Michael Gotziaman",
            "rating": 5,
            "review_text": "Review: Rob James - Masterful SMP Experience Rob James is a true master at what he does. From the moment I met him, his ability to clearly communicate all the details and process involved made the entire experience enjoyable. He took the time to patiently explain every aspect of the Scalp Micropigmentation (SMP) procedure, ensuring that I had a thorough understanding of what to expect. His professionalism and passion for his work were evident throughout, instilling confidence in his abilities. During the SMP process, Robs attention to detail and precision were remarkable. He carefully considered factors such as hairline design, color matching, and shading, ensuring that the results would look natural and seamlessly blend with my existing hair. The final outcome exceeded my expectations, and I couldnt be happier with the results. Robs talent for creating realistic and flawless SMP results is truly impressive. Aside from his exceptional skills, Robs friendly and approachable demeanor made the entire experience even more enjoyable. We spent several hours chatting during the sessions, and it felt like spending time with a friend rather than a professional. His ability to make me feel comfortable and at ease was genuinely appreciated. If youre looking for a skilled SMP practitioner who can deliver outstanding results while making the process enjoyable, look no further than Rob James.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:21:06.933581",
            "response_from_owner_text": "Thank you so much for the kind review, it has been fantastic working with you and getting to know you. I look forward to catching up again soon. Until then, take good care. Sincerely, Rob",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:21:06.933581",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106316750308439345984/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMGFDU2FREAE",
            "reviewer_name": "Kareen Van Nen",
            "rating": 5,
            "review_text": "I was lucky enough to meet Rob during a consultation for a loved one and was immediately struck by his professionalism and knowledge. Months later, I began researching SMP teaching  courses and was pleasantly surprised to see that Rob is facilitating SMP courses at his Vancouver studio. Rob James is not only an artist but a first rate instructor. His attention to detail, demeanour, knowledge, set up,  student preparation and, of course, patience is excellent. There was not a moment where I didn t feel I was getting the best SMP education available and I would recommend his course (or his work) 100%.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:21:06.935681",
            "response_from_owner_text": "Thank you so much Kareen, it has been an absolute pleasure teaching you. I hope to continue helping and guiding you continually along the way. You re going to be an outstanding and positive force in the Canadian SMP industry. Take good care, talk soon.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:21:06.935681",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102727288417417873503/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c0lMWEtnEAE",
            "reviewer_name": "Jenny Tran",
            "rating": 5,
            "review_text": "I recently completed a Scalp Micropigmentation course, and it exceeded my expectations. The Rob the instructor, was extremely  knowledgeable, and the hands-on training was amazing. I learned the art of SMP, from proper technique to color matching and client consultations. This course provided a solid foundation to start a career in SMP. I usually leave asking myself if I am able to pursue, but I left feeling confident with Rob s guidance. Im grateful for the expertise I gained, and I highly recommend this course to anyone looking to excel in the field of Scalp Micropigmentation! Thanks for a great class, Rob!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:21:06.937579",
            "response_from_owner_text": "Thank you so much Jenny, you were an absolute pleasure to train, work with and get to know. You re going to excel in the world of SMP and I am honoured to be able to guide and assist you on your journey. Look forward to seeing you again on your shadow day. Until then, take good care. Rob",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:21:06.937579",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/110837600412612332694/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaalBickdBEAE",
            "reviewer_name": "David Penny",
            "rating": 5,
            "review_text": "This is the man youre looking for to perform your SMP treatment. Not only is Rob a virtuoso in his field, hes also a really great guy. Youll spend quite a bit of time together when youre in the studio, and to be honest, I really looked forward to each session. I had been researching this for a long time but never really felt like I was ready to pull the trigger. However, I can confidently tell you that Rob is the last Instagram feed youll scroll through, the last Google review page youll need to pour over and the final free consultation youll make. A gentleman and a scholar, Rob made me feel totally comfortable throughout the entire process. Hes one of the oldest SMP artists in North America and his volume work speaks for itself. Oh, and something unique about Rob, he REALLY loves what he does. That passion was evident from first meeting him and it really helped solidify that I had made the right choice. Thanks, Rob!",
            "published_at": "a month ago",
            "published_at_date": "2023-10-22 01:21:06.939471",
            "response_from_owner_text": "Wow! Thank you so, so much for the very kind words, I truly do appreciate it. You have been a pleasure to work with and I really look forward to catching up again soon! Until then, take good care. Sincerely, Rob",
            "response_from_owner_ago": "a month ago",
            "response_from_owner_date": "2023-10-22 01:21:06.939471",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113899928395553796226/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeFBDSFB3EAE",
            "reviewer_name": "RB",
            "rating": 5,
            "review_text": "Extremely happy with my results! Great service from beginning to end. Like many say, my only regret is that I didnt do this sooner! I was on the fence for a long time regarding SMP. Wasnt sure if it would look ok and where to start looking. Rob James came highly recommended by a colleague. His results looked very natural and I can see the confidence it gave him. I decided to reach out to Rob after looking at looking at his website, Instagram, looking at reviews and even checking out other providers. During our consultation Rob explained the process and expectations. Rob was not only professional, but was very easy to talk to. I wasnt rushed or pressured. It wasnt a pushy sales pitch. He was just extremely knowledgeable and a genuinely kind  person that cares about your results. The studio is private, clean and easy. Everything about it was easy - easy to get to, easy to park, no shared space or hallways with other businesses. A private appointment means just that. Ive completed 3 sessions with Rob and it looks awesome! I love that its natural looking and I am gob smacked at times when looking in the mirror. The sessions in the studio breeze by. Theres always something to talk about and we even talk about nothing. Lots of laughs for sure. You can tell Rob loves what he does and is a craftsman with his work.  I highly recommend Rob James for your SMP needs. Thank you Rob! I look forward to catching up soon!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:21:06.941450",
            "response_from_owner_text": "Wow! Thank you so much for such a wonderful review. I truly appreciate it. It s been fantastic getting to know you, thoroughly enjoyed it and I truly look forward to seeing you again. Until then, take good care.",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:21:06.941450",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107754811393672892711/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdTRmZ2l3RRAB",
            "reviewer_name": "Tom K",
            "rating": 5,
            "review_text": "Rob is quite knowledgeable about his work and comes across as a genuine, kind and a warm hearted person. I wasnt quite sure in the beginning if SMP was for me. In our initial consultation he walked me through the process, and advised me about what to expect and what can/cannot be done. I liked that he did not attempt to sell himself, gave me pertinent information and answered all of my questions which enabled me to make an informed decision. Previously, I was considering going to the US for this procedure which would have been cumbersome and expensive, but after meeting Rob, I knew right away that he would be my preferred choice for getting SMP done right here in Vancouver. My SMP required four sessions, the first three sessions (4-5 hours each) were spaced about 10 days apart and the final touch-up session around 35 days after the third. As someone who is afraid of needles, I was pleasantly surprised that getting SMP was not painful at all, no numbing cream was used on the scalp, and there were times when I actually dozed off listening to the nice music playing in the background. Conversations with Rob were interesting, entertaining and insightful which made the sessions go by like a breeze. We talked about world affairs, travel, relationships, philosophy to name a few and shared a few good laughs as well. I liked his studio. It was clean, roomy and inviting. The location is ideal, quiet and it is very easy to find free street parking only a few paces away which saved me time and money. My look and hairline gradually improved over the course of the sessions. We adjusted the hairline to achieve the subtle and natural look I wanted. Its been two weeks since my final session and my SMP is looking great. I must say Im quite amazed at the transformation which has made me look younger and may have easily erased a decade off of my age. My friends can hardly tell that I have SMP done which speaks volumes about Robs art and skill. I highly recommend Rob James for SMP procedure as he is a true professional and an artist hard to match in this field. He is a good conversationalist, is skillful and experienced in his trade, and he really makes a sincere effort in listening to you, addressing your concerns and providing the best results possible based on your requirements. He is a pleasure to work with and I believe I have also gained a friend in the process.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:21:06.943382",
            "response_from_owner_text": "Thank you very, very much for the kind and super detailed review, I truly appreciate it. Likewise it has been a pleasure getting to know you over the last several months. Look forward to catching up again. Until then, enjoy your summer and take good care. Rob",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:21:06.943382",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112786631651466650343/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwazh2akx3EAE",
            "reviewer_name": "Nihouse",
            "rating": 5,
            "review_text": "Rob is definitely skilled in the craft and I am wowed by the results achieved so far. He is kind and patient and I loved that he was honest about the whole process, expectations, and went the extra mile in answering questions and was extremely accommodating with requests. The studio is clean and roomy. Its been a pleasure to get to know him and I would definitely recommend him.",
            "published_at": "3 months ago",
            "published_at_date": "2023-08-22 01:21:06.945414",
            "response_from_owner_text": "Thank you so much! I truly appreciate it, it s been wonderful working with you and getting to know you. I look forward to our catch up later in the year. Until then, take good care. Rob",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:21:06.945414",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115531672174993128063/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKc3FDc2VBEAE",
            "reviewer_name": "Harry P",
            "rating": 5,
            "review_text": "I couldnt have asked for a better result. With Robs help I was able to rebuild my hairline and regain my confidence. From the moment I walked through the door, I was greeted with warmth and professionalism. The studio itself was clean, comfortable, and had a relaxing atmosphere. Rob took the time to understand my concerns and expectations, and he patiently answered all of my questions, putting any doubts or worries I had at ease. His skill and attention to detail is truly remarkable as he was able to perfectly replicate the natural appearance of hair follicles on the scalp. What impressed me the most was his commitment to achieving the look that I wanted. He listened attentively to my feedback during each session, ensuring that the density and hairline were customized to suit my preferences. I would wholeheartedly recommend Rob to anyone considering scalp micropigmentation. His talent, expertise, and personalized approach make him an easy choice.",
            "published_at": "4 months ago",
            "published_at_date": "2023-07-22 01:21:07.611663",
            "response_from_owner_text": "Thank you so much Harry, I truly appreciate it! It was been great working with you and getting to know you over the last couple months. Look forward to seeing  you again in the fall/winter. Until then, take good care. Sincerely, Rob",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:21:07.611663",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102137136126505687453/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMWIzS25nRRAB",
            "reviewer_name": "Amardeep Singh",
            "rating": 5,
            "review_text": "I had been little nervous about getting the SMP as its a big decision with possibility of no going back and especially if you get bad SMP, but that changed quickly after the initial consultation and first session. If you do plan to get SMP,  look no further. ROB is the best. And if you wonder, the answer is Yes , you really cant tell if the hairs are real or its a tatoo. Only your friends will notice in a way that how come your hairs are better now.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:21:07.615907",
            "response_from_owner_text": "Thank you so much for the kind words, it has been awesome working with you and getting to know you. Great conversation and some good laughs. Look forward to catching up again soon in the new year. Until then, take good care and thank you. Sincerely, Rob",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:21:07.615907",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102876319396438070916/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabk5qb3NBRRAB",
            "reviewer_name": "Daniel",
            "rating": 5,
            "review_text": "A terrific overall experience. From the communication to the actual sessions. Very personable individual. I really enjoyed the conversations in our sessions. He really has a passion for his art which shows in the results. Highly recommend Rob for your SMP",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:21:07.619564",
            "response_from_owner_text": "Thank you so much for the kind words Daniel, I really appreciate it. It has been a real pleasure working with you and getting to know you. I look forward to catching up again in the new year. Until then, take good care.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:21:07.619564",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111023815963063560491/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bUtEQWFREAE",
            "reviewer_name": "Sam Co",
            "rating": 5,
            "review_text": "Rob is an amazing artist!  I really appreciated his detail to his work.  He was patient and worked with me to achieve the look that I wanted. I had my SMP treatment completed in Dec 2022 and wanted to see how it settled out over a few months before writing a review.  Now that 5 months have passed my SMP still looks great. I love the edgy/aggressive look the SMP gives me.  It has definitely made me look 15+ years younger. Just be mindful that you will need to shave every 2-3 days to keep the shaved look.  The great thing is no more hair combing, no hair gel, just a clean shaved look. I highly recommend Rob James for SMP!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:21:07.622812",
            "response_from_owner_text": "Thanks so much for the kind words Sam, truly appreciate it. It s been wonderful working with you and getting to know you. Have a wonderful summer and I ll see you in the fall. Until then, take good care.",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:21:07.622812",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110437085890695655938/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbFk2OEtnEAE",
            "reviewer_name": "Eduardo Rebagliati",
            "rating": 5,
            "review_text": "Rob is an SMP master who genuinely cares about his clients, making sure their SMP vision is realized. He carefully listens to your needs and provides excellent suggestions back-up with years of experience and insight into what constitutes a fantastic SMP treatment. He works meticulously with a low-risk and well-designed plan to ensure that the SMP results are optimal and outstanding. You will not only have a great SMP, but also have a wonderful time having great service and conversations throughout the treatment, as Rob is a kind, positive, and enthusiastic person. Highly recommended!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:21:07.625913",
            "response_from_owner_text": "Thank you so much Eduardo, I truly appreciate the kind words. I have really enjoyed our conversation and getting to know you as a person. I look forward to our next SMP touch up and beyond. Cheers, Rob",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:21:07.625913",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109779450556553284715/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeEpqenhnRRAB",
            "reviewer_name": "Eric Hill",
            "rating": 5,
            "review_text": "I am so glad that I went with Rob James to get the SMP treatment done, as it has been an absolute pleasure working with him from start to finish. I can really tell that Rob is an experienced veteran at what he does from the way he first listened to and sincerely answered all my concerns surrounding the treatment, to laying out specific expectations for my case and then finishing it off with the masterclass of a job that he performed on my scalp. During the entire procedure I was completely at ease having many enjoyable chats about life and such with Rob, which really made it all go by in the blink of an eye. I am absolutely in love with how natural and full my SMP looks, and I think it really reflects how meticulous and experienced Rob is with his work. If you are considering or even on the line about getting SMP done, you really cant go wrong with Rob James as your practitioner of choice!",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:21:07.628935",
            "response_from_owner_text": "Thank you so much Eric, I really appreciate the kind words. It s been great getting to know you, we ve had some great conversations. Look forward to catching up again for your touch up session. Until then, take good care.",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:21:07.628935",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104956251410283025888/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSXzdxSjR3RRAB",
            "reviewer_name": "Brandon Hines",
            "rating": 5,
            "review_text": "I had done some research before going to see Rob and he looked like he was the best in our area, so my expectations were on the higher end. Robs work has far exceeded my expectations! Every single person I have shown can not believe how good it is. I have now been for three sessions and Im blown away with the results! I felt so good and had such a confidence boost even after the first session. I 1000% recommend getting this done. Rob was amazing. He explains the process and the expectations of the whole thing. There was no surprises. A very positive experience.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:21:07.631700",
            "response_from_owner_text": "Thank you so much Brandon, I truly appreciate it! It s been absolutely wonderful working with you and getting to know you. I look forward to seeing you again in the summer or fall. Until then, take good care.",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:21:07.631700",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107224283853769808526/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bEtiTGVBEAE",
            "reviewer_name": "Paul O'Neill",
            "rating": 5,
            "review_text": "It has been a wonderful experience working with Rob on my SMP! He listened to my needs and tailored each session to them. He shared his extensive craft knowledge to ensure the best and most realistic results. Before the procedure, Rob went over everything in detail and set clear expectations which made me feel super comfortable. Rob is lovely and friendly - we shared great conversations during the procedure which made the time fly by. His attention to detail and craftsmanship is evident as I am in love with my SMP. It looks natural and full which is exactly what I envisioned. The healing process was also seamless which is a testament to Robs skill. I would recommend Rob to anyone and everyone!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:07.634393",
            "response_from_owner_text": "Many, many thanks Paul. It was also an absolute pleasure to work with you and get to know you. I am glad we also got the results that you had hoped for. I look forward to catching up during your touch up session. Until then have a great summer and take good care. Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:07.634393",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110629497801540473686/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeHBxd2d3RRAB",
            "reviewer_name": "Laura Radmore",
            "rating": 5,
            "review_text": "Rob is an excellent SMP artist and instructor. I just completed his training course and was impressed with his attention to detail and knowledge. He provided two models for hands on experience and shared helpful guidance while observing my technique. Rob also provides a full kit including a tattoo machine, inks, needles, disinfectant, and many more essential items. He also offers support and guidance after the course is complete. I feel I have a great understanding of how to begin a new career in SMP and how to achieve natural results. Thanks Rob!",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:21:07.637057",
            "response_from_owner_text": "Thank you so much for the kind words and for trusting in me with your SMP training. The course might be over, but the mentoring now begins. I truly look forward to helping you with your clients throughout 2023. Here s to a great year! Rob",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-01-22 01:21:07.637057",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107119064603738462595/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNG9tTTV3RRAB",
            "reviewer_name": "Tommy Williams",
            "rating": 5,
            "review_text": "Rob James SMP exceeded my expectations. I travelled for my 3 sessions from out of province, because from my research, Rob was the best. I was definitely nervous about the process. Rob s studio is 100% private. And Rob is an amazing professional. Attention to detail is unmatched. And he is just an nice guy to chat with for a few hours! Multiple sessions gives a lot of opportunity to fine tune results, which is the best part of SMP. It s gradual  that s a good thing! Looking forward to my touch up appointment in a few months.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:21:07.639537",
            "response_from_owner_text": "Thank you so much Tommy, I truly appreciate the kind review, wonderful working with you, until next time, take good care.",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:21:07.639537",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108129189147933379995/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScnBDOExBEAE",
            "reviewer_name": "Mandy",
            "rating": 5,
            "review_text": "I am very happy and honored to learn SMP from Rob! Rob was a very responsible teacher. He was very serious about teaching me and every student. He makes very good use of the time and did not waste any minute!  Although the course has been completed for several months, if I encounter any problems with SMP, Rob will help me answer any questions I have. I highly recommend Robs course for anyone interested in learning SMP.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:21:08.323004",
            "response_from_owner_text": "Thank you very much for the kind review, I truly appreciate it. It was an honour to teach you the art of SMP and I am so happy to see you already producing amazing work! With so much PMU experience behind you I know you re going to be one of Vancouver s finest SMP artists pretty soon.",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:21:08.323004",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/107304786385018040051/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaVotcmFBEAE",
            "reviewer_name": "Wattsy",
            "rating": 5,
            "review_text": "A colleague introduced me to Rob James work and to say I was amazed is an understatement. I couldnt tell that my colleague had had the procedure until he mentioned it to me during a conversation. From the very start Rob has given an exemplary service. and made me feel at ease.  I had no issue with the procedure due to the professionalism and attention to detail he gave throughout my treatment. I would recommend him and his procedure to anyone as Im 100% satisfied with the service AND the results. It truly has been  life changing. Sincerely, thank you Rob!",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:21:08.326207",
            "response_from_owner_text": "Thank you so much for such a lovely review, I truly do appreciate it. It has been a pleasure working with you and getting to know you and I sincerely look forward to our next SMP get together. Talk soon, take care. Rob",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:21:08.326207",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104229760257779098077/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoekxEMjRRRRAB",
            "reviewer_name": "Mary Janette",
            "rating": 5,
            "review_text": "I received SMP training with Rob James in 2022 and I have now got my practice up and running. After a lot of research and consulting with SMP trainers, I decided on Rob James. Reason being is, his work looks incredible. His experience is extensive and after talking to him, his dedication to his clients and students was evident. Since completing my training, Rob has been extremely helpful in guiding me and advising me. I am extremely happy with my decision to train in SMP with Rob.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:21:08.329409",
            "response_from_owner_text": "Thank you so much Mary, I truly appreciate your kind review and words, it was wonderful working with you and I look forward to watching you develop and succeed over the coming years. Thanks again. Rob",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:21:08.329409",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110394461932719713407/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dDk2OEpnEAE",
            "reviewer_name": "Yuen Mo",
            "rating": 5,
            "review_text": "Great experience working with Rob, super attentive and considerate throughout the whole process and is very clear about his process and work to ensure youre the right fit. Wouldnt hesitate to recommend and looking forward to seeing him for follow-ups!",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:21:08.331969",
            "response_from_owner_text": "Truly grateful that you trusted in me to do your SMP. Thank you so much for the kind words and great conversation over the last little while. Have a great summer and I look forward to catching up later in the year.",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:21:08.331969",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/115956590421414665672/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaC1qOTNRRRAB",
            "reviewer_name": "Patrick Leung",
            "rating": 5,
            "review_text": "Rob is an amazing artist. He was detailed, upfront, and honest from consultation to my 3rd session! My partner commented on how real it looks. Thank you so much for your patience and artistry. Looking forward to seeing you again at the touch up session. All the best. Cheers!",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:21:08.334473",
            "response_from_owner_text": "Thank you so much Patrick I really do appreciate your kind words. Its been a total pleasure working with you over the last month. I look forward to seeing you again in the summer or fall at some point. Until then take good care and talk soon. Cheers, Rob James",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:21:08.334473",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106639592437767746448/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaDd2TGlnRRAB",
            "reviewer_name": "Sid Devaraj",
            "rating": 5,
            "review_text": "Choosing to get an SMP was one of the best decisions I made this year and doing so at Robs clinic made it doubly so. He explained everything about the procedure in great detail, alleviating all of the concerns that I had going into it. The sessions themselves were a breeze to get through, with great conversations and Rob making sure youre comfortable throughout the entire process. Its now been almost a week since my final session and I couldnt be happier with how the results turned out. Id enthusiastically recommend Rob if youre looking to get an SMP here in Vancouver.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:08.337146",
            "response_from_owner_text": "Thank you so much. So kind and greatly appreciated. You have also been a total pleasure to work with, great conversation and easy going. I truly look forward to catching up in the new year when it s SMP touch up time. Until then, take good care. Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:08.337146",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115490068866861808490/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNzlMS2xnRRAB",
            "reviewer_name": "Michael R",
            "rating": 5,
            "review_text": "After years of extensive research, both in the United States and Canada, I came across Rob s page. I was very impressed with how realistic his results were and the reviews from past clients. I made the trip to his clinic from the U.S. and can confidently say that his level of expertise is unmatched. It s been a pleasure getting to know Rob and I m really looking forward to my next session with him.",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:21:08.339457",
            "response_from_owner_text": "Thank you so much Michael, it s been a total pleasure working with you and getting to know you. Thank you for trusting in me to do your SMP. Look forward to catching up again in the spring or summer. Until then, take good care.",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-04-22 01:21:08.339457",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102695691779057927132/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbXRyWVd3EAE",
            "reviewer_name": "Natalia",
            "rating": 5,
            "review_text": "I just finished 3-day SMP training with Rob James and have to say that he is an excellent instructor and mentor. He provides a great mix of listening, speaking and practical learning activities in a very safe and supportive learning environment. As a student, you feel pushed to learn and try out new competencies, feel safe and supported in doing so and gain valuable feedback that helps you to improve. I am 100% satisfied with my training and would strongly recommend Rob to anyone interested in SMP.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:21:08.341702",
            "response_from_owner_text": "Thank you so much for the kind review, it really means a lot. It was an honour to teach you and it will be a pleasure to mentor you throughout the years. I look forward to watching you progress and succeed. Have a great year. Sincerely, Rob",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:21:08.341702",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103765947107479545012/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbjZEd0dREAE",
            "reviewer_name": "Soroush Delariani",
            "rating": 5,
            "review_text": "I recently had a scalp micro pigmentation service with Rob James and I am blown away by the results! Not only is Rob incredibly skilled and knowledgeable in his craft, but he also made me feel completely comfortable and at ease throughout the entire process. The results of the treatment are truly impressive - my scalp looks completely natural and the shaved effect is indistinguishable from real hair. I am so happy with the results and have already received numerous compliments from friends and family. I cannot recommend Rob James enough - he is truly a master of his craft and I am so grateful for the amazing results he has given me. Thank you, Rob! 5 stars all the way!",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:21:08.343874",
            "response_from_owner_text": "Thank you so, so much for the kind review, I truly appreciate it. It has been absolutely wonderful working with you and getting to know you over the last few weeks. Weve had some great conversations and I look forward to working with you again over the coming years. Until next time, take good care. Sincerely, Rob James",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:21:08.343874",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104863202598547754581/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtak5YQ1R3EAE",
            "reviewer_name": "Neil C",
            "rating": 5,
            "review_text": "It was a pleasure to have Rob do my SMP. In the initial consultation, I had some hesitations and doubts, but Rob put my worries to ease - he was friendly, calm, and cordial. He answered all my questions about it and I felt like I could trust him as an artist. He has been a part of the industry for a long time and knows all of its ins and outs.  You can feel safe because he 100% knows how to avoid giving you a bad result. With each session, he will slowly build up the SMP to give you the perfect result and make any adjustments as requested with the goal being an ultra realistic look - there is zero risks taken. I am super happy with the final result - it looks subtle, natural, and gives a frame to my face. I wish I had done this sooner! Every session was a great experience and went by like a breeze because Rob is super fun to chat with. He even let me bring my new puppy in his studio when I couldnt find a dog sitter. I highly recommend him.",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:21:08.346160",
            "response_from_owner_text": "Many thanks for the kind review, I truly appreciate it. Absolute pleasure working with you Neil, thoroughly enjoyed our conversations. Really look forward to catching up with you again for your SMP touch up. Take good care. Rob",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 01:21:08.346160",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117099440322544404036/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCX2JqeU5nEAE",
            "reviewer_name": "Kaitlin Cordingley",
            "rating": 5,
            "review_text": "Rob is a true professional. His SMP training course was comprehensive, in depth, personalized and interactive. I would recommend Rob s training course to anyone; whether they are experienced or just starting out. I am excited to have Rob as a mentor during the start up of my own business and beyond. Thank you!",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:21:08.998284",
            "response_from_owner_text": "Thank you Kaitlin, I truly appreciate your kind review. It was wonderful working with you and getting to know you. You know where I am if you need any guidance or support in the SMP world. Until next time, take good care. Sincerely, Rob",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:21:08.998284",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103539176901048277237/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodGVqNFF3EAE",
            "reviewer_name": "Mike Bernal",
            "rating": 5,
            "review_text": "Just wanted to share what an amazing SMP experience I had with Rob. I had my first session two months ago and just recently had a touch up for my hairline. The outcome was really great. Rob listened when I asked him for a natural looking, defined hairline. I am very pleased with the end result and my wife as well. Again, thank you so much Rob. If you are looking for the right guy for your SMP needs, look no further.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:21:09.002703",
            "response_from_owner_text": "Thank you so much Mike, I really appreciate the wonderful review, it has been wonderful working with you and getting to know you also. I look forward to working with you again in the future. Until then, take good care. Sincerely, Rob",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-07-22 01:21:09.002703",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101941559788432051740/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNFpPTFRBEAE",
            "reviewer_name": "Babita Gill",
            "rating": 5,
            "review_text": "My initial SMP with Rob was 3 years ago now. It was not only a wonderful experience going through the process in those first few exciting visits but Rob has remained a perfectionist in his work over the years. I just met with him today for a touch up to add some darkness throughout and touch up some modifications to the hairline he made last year. My sessions with Rob are oneof my favourite reasons to visit Vancouver, to be perfectly honest I still look at my SMP every day and I can t even imagine having gone through the last few years without it. Still smiling and satisfied, and grateful to the best artist in the SMP game Rob James. Thank you brother.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:21:09.006386",
            "response_from_owner_text": "Thank you so much for the wonderful review, I truly do appreciate it! Not only has it been awesome creating and servicing your SMP over the years, it s been fantastic getting to know you. I always look forward to your visits and our chats. Until next time, take good care. Rob",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:21:09.006386",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105897884589920248224/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtZ19yb2tnRRAB",
            "reviewer_name": "David L",
            "rating": 5,
            "review_text": "I just finished 3 sessions with Rob to fill in the receded areas in the frontal scalp and Im absolutely blown away from the results. Rob is super professional and works with you to achieve your desired goal. He was able to create a natural hairline that blended beautifully with my existing stubble. None of my family or friends could tell I had to procedure done and were in surprised when I told them. Not only do I love my results, I thoroughly enjoyed our conversations as well. He truly made it a great experience and I highly recommend Rob for anyone looking for SMP.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:09.009599",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/112280488711797339502/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoa3NXQnJnRRAB",
            "reviewer_name": "Philip Louis Pua",
            "rating": 5,
            "review_text": "Rob James is the man to visit if you want your SMP done properly. He is a true professional and a gentleman. His SMP is pretty natural-looking. His personality is pleasing too. He is a cool guy and a genuine person. You will feel the sincerity in his words. He can also keep the conversation going so you wont feel bored during the 2-3 hour sessions. His cute dog Amigo is sometimes there to entertain you. In conclusion, I am more than satisfied with Rob and his SMP. A true gem! Definitely 5 out of 5 stars.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:21:09.012294",
            "response_from_owner_text": "Total pleasure working with you and getting to know you Philip. Look forward to catching up again in the near future. Amigo says thank you for the professional portrait photos Take care, talk soon. Rob",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:21:09.012294",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105190292719746488849/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMGItZ2dnRRAB",
            "reviewer_name": "James Seo",
            "rating": 5,
            "review_text": "My experience with Rob was amazing. Hes a perfectionist and really cares about attention to detail. Very knowledgeable and highly recommended. A true master at his craft. Not surprised with the countless high reviews. If youre looking for an SMP artist, Rob is your guy. He is personable and really caters to your needs.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:09.015338",
            "response_from_owner_text": "Thank you so, so much James. It was wonderful getting to know you guys over the last couple weeks, truly enjoyed our conversations. Look forward to catching up again next year, so until then, take good care. Sincerely, Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:09.015338",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115410523228166614723/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4djlHTlRnEAE",
            "reviewer_name": "rob jbte",
            "rating": 5,
            "review_text": "I really enjoyed my SMP with Rob James, truly professional artist and an amazing guy. I would definitely recommend him to anyone interested in SMP. Thank you for all the great conversations",
            "published_at": "5 months ago",
            "published_at_date": "2023-06-22 01:21:09.018409",
            "response_from_owner_text": "Thank you so, so much Rob, I ve thoroughly enjoyed working with and conversing with you. Thank you for trusting in me to complete your SMP. Have a fantastic summer and I ll see you in the fall. Until then take good care. Rob",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-06-22 01:21:09.018409",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104415107946659614289/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdnRuOGVnEAE",
            "reviewer_name": "A H",
            "rating": 5,
            "review_text": "I just took the 3 day SMP training course with RobJames.  Coming from Ontario, I had plenty of places that I could have chosen to train at that were a lot closer.  I chose to train with RobJames because he took the time to speak to me over the phone and through  e-mail and explained everything involved in the course and all the guidance that I will receive starting my SMP journey back at home.  I am generally very nervous when I start something new but his training in class was very thorough as a group and he also took time with each individual student which gave me a sense of calm that I needed to feel confident in what I was doing.   I feel very fortunate that I was able to train with such a talented artist!",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:21:09.021335",
            "response_from_owner_text": "Thank you so much for the kind review. It was an honour and a pleasure to teach you. You re patient and very detailed and I know you re going to do great things! I look forward to continuing to help you along your journey this year. Take care and many thanks again. Rob",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-01-22 01:21:09.021335",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100171338758956335963/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbThTWDV3RRAB",
            "reviewer_name": "Peter Cho",
            "rating": 5,
            "review_text": "Rob is the best SMP artist in town. After the first and second SMP service, my hair looks natural. None of my friends and relative can tell I have head tattoo, because Rob blend the SMP with my current hair. I am glad that I listen to Robs suggestion and keep the SMP within my hairline. I have seen some people SMP look fake, because they dont listen to their SMP artist or they dont have the best artist to work with. Pricing wise, I think Robs pricing is reasonable and affordable. The amount of confidence I earn is way more than the $$$ I spent. Plus, I look 10 years younger after SMP. Who wants to look like an old man, anyway??",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:21:09.023970",
            "response_from_owner_text": "Thanks you so much Peter, I truly appreciate it. It s been great getting to know you over the last 6 months. Have a great rest of the year and a wonderful 2023. Look forward to seeing you next year. Until then, take good care. Rob",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:21:09.023970",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115459758854385717480/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNG9TRzlBRRAB",
            "reviewer_name": "Sam Ranieri",
            "rating": 5,
            "review_text": "I m in my 40s and wasn t looking for anything too drastic.   Rob listened and delivered exactly what I requested.   A super subtle hairline combined with good crown coverage isn t easy. He absolutely nailed it.  Like, nailed it.   I was nervous about the procedure and researched the globe for the best, and I found him.  Fair pricing and unbelievable/undetectable work.    As for SMP in general,  do your research to make sure it is right for you; if you settle on going forward, call Rob.",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:21:09.026496",
            "response_from_owner_text": "Wow! Thank you so much for the kind words Sam. It s been an absolute pleasure working with you and getting to know you. And so happy that we managed to get the result you were after. Look forward to seeing you in the new year. Have a great Christmas and new year.",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:21:09.026496",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116570167375566193324/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobElUYzd3RRAB",
            "reviewer_name": "jahangir patil",
            "rating": 5,
            "review_text": "I did My SMP with Rob; he is A Man of talent and knows his craft very well; Im happy with my result and Would highly recommend Getting SMP done here, Also, Talking and sharing stories with ROB was such a great experience. It never felt like I was undergoing some treatment; it was a fun experience with lots of laughs and wisdom.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:21:09.800700",
            "response_from_owner_text": "Thank you so much for the wonderful review, I greatly appreciate it. It has been a total pleasure working with you and getting to know you. We certainly have had a lot to talk about. I look forward to  catching up again during your SMP touch up session. Until then, take good care. Rob",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 01:21:09.800700",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/101325482604140756385/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOWJHZ25BRRAB",
            "reviewer_name": "Kevin Lo",
            "rating": 5,
            "review_text": "Rob is the expert in SMP and I am very satifised with the result.  Rob provides a free consulation to explain the process and explain how it works.  At first, I did worry about it.  But after two sessions, I am happy with the results.  It looks natural and nobody notices I have it.  Rob listens to my need and provide his professional suggestion to match my hair density and color to make it look natural.  Rob is easy going and professional.  The money is well-spent.",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:21:09.804727",
            "response_from_owner_text": "Thank you so much Kevin, I really appreciate the kind words and I m glad that we managed to get the desired results. I do hope you have a great new year and I ll see you in 2023. Sincerely, Rob",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-01-22 01:21:09.804727",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105295184160806608685/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaWRtMkxBEAE",
            "reviewer_name": "james maechler",
            "rating": 5,
            "review_text": "Over the last two years I ve looked at dozens of practitioners both here in the UK and in Europe. And I have to say I could not find anyone with the realism of Rob James. At the beginning of last year I had two virtual consultations with Rob and at the end of the year I flew out to work with Rob over a three week period. I cannot express how happy and impressed I am with the work that has been completed and how easy and enjoyable it was working with Rob. Highly recommended and forever grateful.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:21:09.808292",
            "response_from_owner_text": "Thank you so, so much for traveling so far and putting your faith in me for your SMP. It was a total pleasure getting to know you and I truly look forward to seeing you again in 2023. Until then take good care and Happy New Year.",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:21:09.808292",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107601166734981037948/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd1o2ekpREAE",
            "reviewer_name": "Greg",
            "rating": 5,
            "review_text": "Rob James was truly a pleasure to work with. Consultation was free and informative if youre interested in getting SMP done book a consultation. He looked at my hairline and explained the whole SMP process with me. I highly recommend Rob James. This whole process has truly transformed my hairline. The only regret is not looking into this earlier. Im extremely pleased with the results and feel and look much younger. Thanks so much!! Rob. Take care, Greg",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:09.811517",
            "response_from_owner_text": "Thank you so much for the wonderful review and kind words Greg. It s been an absolute pleasure working with you and getting to know you. Look forward to seeing you after the summer for your touch up. Until then take good care.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:09.811517",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112025776838303535376/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHN0pYa2FREAE",
            "reviewer_name": "Mark Urquhart",
            "rating": 5,
            "review_text": "Rob definitely lives up to his outstanding reputation as the premier SMP artist in Vancouver.  He is friendly, professional with an incredible eye for detail.  I was so impressed with Rob s work that I also decided to take his training course.  Rob is a fantastic teacher offering small class sizes with plenty of one on one instruction during the course and the follow up after the course is beyond expectations.  Rob has been there helping me start and grow my business on Vancouver Island.  Rob is committed to helping his students succeed and become talented SMP artists themselves.   Thanks Rob for your great work and service and for your outstanding teaching skills and professionalism.  I recommend Rob James SMP to everyone considering SMP. Thanks Mark Urquhart West Coast SMP",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:09.814732",
            "response_from_owner_text": "Thank you so much Mark, I am glad you re happy with the final results, It was a pleasure working with you. It was also a total pleasure to train you. With your conscientious, patient, detail oriented nature, you re going to be a great artist, and I really look forward to watching you succeed. Take care, Rob",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:09.814732",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108189584494731139018/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURHMDZNahAB",
            "reviewer_name": "G S",
            "rating": 5,
            "review_text": "As expected, based on his countless 5-star reviews and the exceptional work shown throughout his portfolio, Rob did an incredible job on my scalp. You can tell he is genuinely passionate about his work and truly cares about achieving lasting results that look perfectly natural. I m thrilled with the results of my SMP procedure which I first had done by Rob around a couple  years ago, and just recently returned to him for a little touch up to freshen things up a bit. Although, even before the touch-up his work still looked great and I probably could have waited even longer! I will definitely continue going to Rob for any future touch-ups and I will 100% recommend him to anyone looking to have the same procedure done.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:09.817900",
            "response_from_owner_text": "Really appreciate the review. Thank you for trusting in me when I opened my new location a few year ago. It was great seeing you again and I was super impressed with the SMP s retention after quite some time. Have a great Christmas and I look forward to seeing you for your next touch up",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:09.817900",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/104079610737597539149/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMGQ2T1RnEAE",
            "reviewer_name": "Richard Belleza",
            "rating": 5,
            "review_text": "There is a very simple reason that Rob has nothing but 5 star reviews. He is a consummate professional that truly cares about his clients. He takes the time to answer all your questions and makes sure to address any concerns you have. He is an insightful person with a genuine outlook on life and it shows in the way he conducts himself in every step of the process. If you are looking for an SMP provider then look no further!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:09.820652",
            "response_from_owner_text": "Thank you so much for the kind words, I really do appreciate it. It has been an absolute pleasure working with you and getting to know you. Look forward to catching up in the new year. Have a great Christmas with your family and until next time, take good care. Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:09.820652",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100127723805956225677/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMnVtSElREAE",
            "reviewer_name": "lisa lagah",
            "rating": 5,
            "review_text": "Rob James, has set the bar high for fellow SMP artists. I had the absolute pleasure of being a recent student of Rob s SMP training. His passion, patience and knowledge is the formula for an excellent mentor. I cannot say enough positive things about my training experience with Rob. You can tell, that he is not just in the business to provide a service to clients; he is in the business to help change people s lives by giving back their confidence with the fantastic work he does. I feel like I am off to a great start as an SMP artist as I trained with the best!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:09.823364",
            "response_from_owner_text": "Thank you so much Lisa, it was a total pleasure teaching you. You re going to do really well within this industry and I am looking forward to watching and continuing to help you with your success. All the best. Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:09.823364",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111170784298704869212/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNHJPTG1BRRAB",
            "reviewer_name": "Coco Cheung",
            "rating": 5,
            "review_text": "I just finished my last session of my SMP on 07th Sep. It has been a wonderful experience working with Rob on my SMP. Rob is very knowledgeable, friendly, accommodating and very professional. I was quite nervous during my consultation because I did not know what to expect and had little to know about SMP. Rob took the time to explain everything about SMP and also immediately made me feel very comfortable. My very first session was supposed to be on the 19th Aug but I had to attend a very dear friend s daughter s wedding on the same date. I requested to reschedule my first session on the 24th Jul. Rob was able to quickly offer me the 24th Aug which I was very delighted. Rob is very thorough explaining the details, procedures, expectations and the aftercare. We also shared a lot of great conversations during the procedures which made me feel extremely comfortable. I am extremely happy with the results, his craftsmanship and attention to detail. My partner would look at my scalp after each session and he would just said  wow, it looks so natural! . I guess that says it all. I highly recommend Rob to anyone like me who has been struggling with baldness. He is truly the state of art. Thank you very much, Rob. Ronald",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:09.825965",
            "response_from_owner_text": "Thank you so, so much for the wonderful review and kind words! You are so pleasant and east to work with and I ve thoroughly enjoyed our converse. I truly look forward to catching up again during your touch up. Until then, take good care. Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:09.825965",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 72,
            "reviewer_url": "https://www.google.com/maps/contrib/103281190743957496810/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybW9EaFNREAE",
            "reviewer_name": "James Webber",
            "rating": 5,
            "review_text": "Rob James is a true master of the craft of Scalp Micropigmentation. My SMP is absolutely amazing. Meeting Rob and going through the journey of my SMP procedure was completely a pleasure. Rob is personable, friendly, easy-going and extremely professional - especially communicative about the procedure. He makes you feel at ease every single step of the way. I couldnt be any happier with my results, hes completely changed my life as a man. I recommend Rob James in a really big way! Sincerely. - James W.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:09.828551",
            "response_from_owner_text": "Thank you so much James, it s been an absolute pleasure working with you and getting to know you. Look forward to working with you again in the late summer/fall. Until then, take good care.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:09.828551",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112518467263213840038/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlLUl1ZC1RRRAB",
            "reviewer_name": "Dal S",
            "rating": 5,
            "review_text": "If you need an SMP done in BC, I suggest you visit Rob - especially if it is your first SMP. You may have to wait for a few weeks as Robs clinic is very busy due to high demand. Rob is professional, does amazing work, and provides honest guidance, and helps you set proper expectations. I have had SMP done in Seattle a decade ago which I would rate 3 star compared to Robs work on my scalp recently.",
            "published_at": "8 months ago",
            "published_at_date": "2023-03-22 01:21:10.431990",
            "response_from_owner_text": "Thanks so much Dal, really appreciate the kind words! It s been great getting to know you and I truly look forward to catching up again. Until then, take good care. Sincerely, Rob",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-03-22 01:21:10.431990",
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113679150128688916101/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbTlTVmdBRRAB",
            "reviewer_name": "Robert Bushar",
            "rating": 5,
            "review_text": "I would like to echo the positive comments and say Rob James is a true professional. My initial consultation with Rob was extremely comfortable and he answered all my questions thoroughly. In addition, he was very knowledgeable and upfront with the procedure from beginning to end. His skills and talent are second to none, and his attention to detail is unmatched. I am extremely happy with my results and the level of care that was exhibited throughout the process. I will continue to seek his professional services and I would highly recommend him to anyone who is looking to get SMP done.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:10.435785",
            "response_from_owner_text": "Thank you so much Robert, I truly do appreciate the kind review. It was absolutely wonderful working with you. i really enjoyed our conversation and look forward to catching up again in the new year. Until then, have a fantastic winter holiday.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:10.435785",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110833859082809467800/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyLXJfY3JRRRAB",
            "reviewer_name": "Brad Proshen",
            "rating": 5,
            "review_text": "Rob James is the Michelangelo of SMP!, simply put you would be hard pressed to find anyone to even hold a candle to. Combined with his masterful artistry and a keen eye for extreme detail, the SMP I received is absolutely flawless. If you want the best, forget about the rest!!. Also like to mention, having to fly into Vancouver, as I live in the Sunshine Coast, Rob was very accommodating regarding dates/times I was able to book/arrive in Vancouver, adjusting his busy schedule to fit me in. On top of everything, Rob is a genuine gentleman, great conversationalist/listener and a wonderful human being. Cant thank you enough Rob, my scalp looks amazing!,  youve given my confidence back! and have that extra jump in my step!. Many Thanks! Brad",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:10.439246",
            "response_from_owner_text": "Thank so, so much Brad! I truly appreciate it. I look forward to our next SMP touch up session. Until then, take good care. Sincerely, Rob",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:21:10.439246",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107289079216783543861/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtc19iU0dnEAE",
            "reviewer_name": "Sooraya Nuthall",
            "rating": 5,
            "review_text": "The expert teachings of Rob James will make you 100% confident in your future as an SMP Artist. The entire experience was comprehensive, engaging, and fun! Everything was above and beyond. Thank you Rob, for your generosity and inspiration for the next chapter of my career!",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:21:10.442504",
            "response_from_owner_text": "It was a total pleasure training you and getting to know you. Many thanks for the kind words. Let the mentoring begin! I sincerely look forward to helping you throughout your SMP artists journey. Have a wonderful Christmas and new year. Rob",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:21:10.442504",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114639224385393225201/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdXJMc05BEAE",
            "reviewer_name": "Hiro S",
            "rating": 5,
            "review_text": "After meeting Rob for the first time during my consultation, I immediately felt trust in him. He was very professional and spent the time with me to find out what my concerns were and presented me with options. Rob is a really friendly guy and he always made me feel comfortable during each session. I was extremely satisfied with my overall SMP treatment. The end result exceeded my expectations and I am now more confident with the look of my hair. I would highly recommend Rob and SMP!",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-22 01:21:10.445864",
            "response_from_owner_text": "Thanks buddy! It s been lovely working with you! Thanks for choosing Rob James SMP",
            "response_from_owner_ago": "4 years ago",
            "response_from_owner_date": "2019-11-22 01:21:10.445864",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100480350047147387713/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNm9Idk1BEAE",
            "reviewer_name": "JL Bun",
            "rating": 5,
            "review_text": "A quick google search and it is evident why Rob James is the guy to see for SMP. His before and after pictures are incredible. After a consult, it was clear why. He knows what he is talking about and is clearly passionate about his work. He is professional and friendly and explains things thoroughly. Sessions were around 3 hours. Talking with Rob helped to pass the time quickly. On top of being skillful and artistic, Rob is charming and delightful. Having such a wonderfully natural SMP has helped to bring back a youthful confidence that just makes me smile so much. Thank you. J&M",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:10.448831",
            "response_from_owner_text": "Thank you so much for the kind words and awesome review. It s been a pleasure working with you and getting to know you. Have a great summer and I ll see you in the fall! Take care. Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:10.448831",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/111351878678878558494/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMGZhcHVRRRAB",
            "reviewer_name": "Mandip Sanghera",
            "rating": 5,
            "review_text": "I recently had SMP done at Vancouver SMP with Rob James. It was a great experience from start to end. Rob was very friendly, open and honest with me during my consultation and throughout the 3 sessions I have attended so far. Getting SMP is permanent so doing your research and choosing someone with experience is important. I like to do my research before doing anything big and I am very happy with my choice. The feedback I have received since I had my SMP done has been very positive. It looks natural, makes me look younger, and I feel younger. I found the procedure was not painful at all and the time flew by each session. I certainly would recommend Rob James to anyone looking to get SMP. At least sit down for a consultation like I did and then decide for yourself. Cheers!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:10.451606",
            "response_from_owner_text": "Thank you so much Mandip, I very much appreciate the review and kind words. I really enjoyed working with you and getting to know you. I look forward to catching up again soon. Have a fantastic summer! Take care, Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:10.451606",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109789729743418837346/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOGVYMkZBEAE",
            "reviewer_name": "B. Schmidt",
            "rating": 5,
            "review_text": "Choosing the right SMP artist was very important to me because I have a very public job and people already knew I was bald. Ive seen some horrible botch jobs online.  I researched thoroughly and compared all pictures and videos online. After weeks of searching, I narrowed my choice down to Rob and another local artist. I first met with Rob and felt super comfortable that he was the right choice. I didnt even bother meeting the other person. I was lucky to find Rob here in Vancouver. Truthfully I was ready to fly to NY or LA. Im so happy with the results. My wife thinks I look 15yrs younger. Highly recommend Rob, you wont regret it. Best work and a great human being.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:10.454307",
            "response_from_owner_text": "Thank you so much for the kind words, I truly appreciate them. It s been thoroughly enjoyable getting to know you over the last several weeks. Have a great summer and I look forward to catching up in the fall/winter. Until then, take good care.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:10.454307",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101107166777912230639/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHeU1PVHpnRRAB",
            "reviewer_name": "Andi Pham",
            "rating": 5,
            "review_text": "Recently finished private SMP training with Rob James.  And what a totally wonderful and immersive experience it was.  So much knowledge and information was easily and practically handed over to me.  Rob is a very calm and easy to understand communicator and he makes sure you fully understand the methods and skills as needed to succeed. I am so glad I chose Rob to learn this new skill as his experience in the field and his personal results are head and shoulder above the rest.  Plus his support, before and after the training is already to evident.  If youre looking to get into SMP, look no further than Rob James. He genuinely cares.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:10.456850",
            "response_from_owner_text": "Thank you so much Andi, it was a total pleasure working with you. I look forward to watching you succeed and grow with SMP",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:10.456850",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113210809386168237305/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNzl5enJ3RRAB",
            "reviewer_name": "Ryan Lin",
            "rating": 5,
            "review_text": "Just had my 3rd session done with Rob. Professional, skilled and experienced. He is very busy but he is worth it.",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-22 01:21:10.459271",
            "response_from_owner_text": "Thank you so much for the kind words! Really appreciate it Ryan. It s been great working with you and I really look forward to catching up again later in the year. Until next time, take good care.",
            "response_from_owner_ago": "2 months ago",
            "response_from_owner_date": "2023-09-22 01:21:10.459271",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105282877736878891939/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbTkyV213RRAB",
            "reviewer_name": "JR Jenson",
            "rating": 5,
            "review_text": "What can you write about Rob that hasn t already been written in other reviews? From the consultation to the SMP itself, the experience was first class throughout.  The sessions go by in no time - talking to Rob is like talking to an old friend. A word of advice: do yourself a favour and just listen to Rob and trust in his process.  He s an absolute master at his craft. His meticulous nature makes it so his expectations for your SMP (and experience overall) are higher than even your own. Rob has a level of integrity that isn t common nowadays.  He s reassuring, and, more importantly, realistic about what your SMP should/will look like. I was all about density going into the process.  Rob explained to me why he believed a higher density would not look good on me, as it wouldn t naturally tie in with my existing hair/stubble.  When I kept pressing, he politely told me that he may not be the SMP artist I needed. He went so far as to courteously offer to direct me to another SMP artist who would be willing to help.  If I wasn t already sold on Rob, this sealed the deal.  He genuinely cares about his clients, and wants them to leave looking and feeling amazing. I m thrilled with the outcome as my SMP looks phenomenal.  It looks so unbelievably real that even my dermatologist had no idea it was SMP! I don t leave reviews, but leaving this one was a no-brainer.  Five stars all round.  Thanks so much, Rob!  -JR",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:11.134185",
            "response_from_owner_text": "Thank you so much for the kind words JR, I truly, truly appreciate it! Look forward to catching up again sometime in the future. Until then take good care. Sincerely, Rob",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:21:11.134185",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118162420355546637596/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaktybFN3EAE",
            "reviewer_name": "Jo Cain",
            "rating": 5,
            "review_text": "By far the highest quality, most personable SMP artist in the Greater Vancouver area. I extensively researched artists before I met Rob. Rob not only has the reputation, experience, and skills to perform a life changing SMP, but he is also an amazing person who truly cares about his work and the people he works with. His prices are very reasonable for the work he does and he takes his time to ensure each session is done to perfection. I couldnt recommend Rob more if you are looking to have an SMP done. Book a free consultation with him and see for yourself. He absolutely changed my life, and I have only finished my second session. Cant wait to continue the process with him in the New Year!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:21:11.138190",
            "response_from_owner_text": "Why thank you very much for such kind words! Really appreciate it! Have a lovely Christmas & see you in the new year.",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-22 01:21:11.138190",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106892962561068006651/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdFBybktBEAE",
            "reviewer_name": "simone schneidenbach",
            "rating": 5,
            "review_text": "Rob is hands down the most talented and experienced SMP artist. he definitely exceeded my expectations. His skills and attention to detail is outstanding. I highly recommend Rob to anyone. I am very, very happy with the result. It looks natural and blends in perfectly. it was my best decision ever. Thank you so much Rob.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:11.141574",
            "response_from_owner_text": "Thank you so much Simone, so glad we got some great results. I have really enjoyed working with you. Look forward to seeing you again next year. Have a lovely winter holiday.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:11.141574",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108410244115680275733/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M01MUld3EAE",
            "reviewer_name": "Trevor Shen",
            "rating": 5,
            "review_text": "Rob was fantastic for me. He was able to squeeze me in to his busy schedule. Very friendly and easy to talk to. I ll be going to him permanently for my micropigmentation needs.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:21:11.144982",
            "response_from_owner_text": "Thank you so much Trevor, I truly appreciate the review, it s been great getting to know you over the years. Have a great summer and until next time, take good care Rob",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:21:11.144982",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/110038515913480395545/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbXJiN3h3RRAB",
            "reviewer_name": "Kimberley",
            "rating": 5,
            "review_text": "As a newly certified student of Robs, I would like to say that he is an amazing instructor, he provides a ton of information during the 3 day training as well as after. He has also made himself available for any questions and/or concerns. Im so glad that I chose Rob to be my SMP instructor and I cant wait to show my work to prove it!! Thank you Rob!!",
            "published_at": "10 months ago",
            "published_at_date": "2023-01-22 01:21:11.148769",
            "response_from_owner_text": "It was an absolute pleasure being able to teach you. You re going to do fantastic and I totally look forward to being a part of your success. 2023 is going to be a great year for you. Thanks again for the wonderful review. See you soon for your shadow day. Sincerely, Rob",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-01-22 01:21:11.148769",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112157633545413508978/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPc05meTJBRRAB",
            "reviewer_name": "Brayden Caverly",
            "rating": 5,
            "review_text": "An artist!!  I ve been self conscious of scaring  and thin hair for YEARS. So much time wasted trying to hide thinning areas with fibres, sprays or hats.  My confidence is finally coming back. Phenomenal SMP work from Rob.  He was very professional and informative. Worked with me to set realistic expectations and plan out an SMP that will work best for me. No discomfort at all!!  Thank you so much Rob!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:11.151887",
            "response_from_owner_text": "Many thanks for the kind words Brayden. It has been a total pleasure working with and getting to know you. I hope you have a fantastic summer and I really look forward to catching up with you again soon. Take good care. Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:11.151887",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/106555202530026205587/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaHJyT1pBEAE",
            "reviewer_name": "Sunni",
            "rating": 5,
            "review_text": "After doing a search for various SMP artist in my area, Rob s work stood out the most to me and I knew he was the one I would be going to. Rob explained everything in as much detail as possible and I was confident that he was going to do an exceptional job. Overall, I am very pleased with the final product and would recommend him to anyone looking to get an SMP treatment in the Vancouver area. Rob genuinely cares for his clients and this is reflected in his work.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:11.154917",
            "response_from_owner_text": "Thank you so much for the kind words, had a great time getting to know you. You made the process super easy going and it really means a lot to me that you re happy with the results so far. Don t forget you have another Full touch up to go! Until then, take good care!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:11.154917",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103447379865458181459/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaS1LSVJREAE",
            "reviewer_name": "O G",
            "rating": 5,
            "review_text": "Rob is a professional and a perfectionist and takes pride in his work. I would have no problem referring him to friends or family. I decided to do 3 sessions. Rob gives you his advice and answers every small detail. The entire process was painless and the conversations we had were really good which is a big plus, as youll need to be there for a few hours. Without doubt one of the best places in Vancouver.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:11.157858",
            "response_from_owner_text": "Many thanks for the kind words, I truly appreciate it. It was great getting to know you over the last several months. Great conversation, its been a pleasure getting to know you. I look forward to catching up again later on in the year. So, until then, take good care.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:11.157858",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102162881580092892891/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cnNMU2NnEAE",
            "reviewer_name": "Robby Francesco",
            "rating": 5,
            "review_text": "Rob James SMP does absolutely the best quality work hands down! He s extremely patient and pays attention to detail. I scheduled a 2 year followup / touch with Rob today and hardly needed much work done. Was blown away! Just got a very small refresh done. The products that are used are of the highest quality and have held up extremely well over the years. I would highly recommend using Rob James if you decide to get that full natural hair line back. He s the best in the business! Thank you , Rob",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:11.160529",
            "response_from_owner_text": "Wow! Almost two years! How time has flown by. Thank you for the kind words. Great seeing you and wonderful catching up. So happy the retention is still spot on. Keep in touch, all the best and take good care.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:11.160529",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108934208518691998002/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NDlYY1RnEAE",
            "reviewer_name": "Nas A",
            "rating": 5,
            "review_text": "Rob is hands down the best Vancouver SMP artist. Before going ahead with the procedure I did research on practitioners in the local area and Robs extensive portfolio stood out the most. I booked a consultation free-of-charge where Rob was able to answer any questions or concerns I had. Having now completed two session with Rob, I can truly say that I couldnt be happier with the results. Rob is a master of his craft. SMP is a gradual process that takes multiple session to complete which Rob guides you through seamlessly. My biggest concern going into the procedure was finding a hairline that I was happy with while maintaining a realistic look. Rob is highly accommodating and collaborative as he works with you to achieve your desired look. I highly recommend checking out his instagram @robjamessmp where youll find a plethora of photos displaying his range, versatility, and attention-to-detail. Beyond his artistic ability, Rob is an overall pleasure to be around. He is kind, caring, and very easy to talk to. We had many engaging conversations that made the 3-4 hour sessions fly by. Thank you so much Rob! I look forward to working with you again in the future!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:11.163172",
            "response_from_owner_text": "Wow! Thanks so much for the kind words, really, really appreciate it. It s been a total pleasure working with you over the last several weeks. Look forward to seeing you in 2022! Until then, take good care.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:11.163172",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108451459024136956148/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHOTlhcC1nRRAB",
            "reviewer_name": "Kam Singh",
            "rating": 5,
            "review_text": "Rob is super professional. He makes sure you understand what youre getting, best case scenarios, worst case scenarios and everything in between. He is definitely willing to work with you for your unique situation. I was on the fence about getting SMP but seeing the results on his Instagram page and what he felt he could do for me I pulled the trigger. I wanted to look good for my wedding pictures and I feel he did a great job for me. He also loves to talk which helps the sessions go by faster haha.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:11.870076",
            "response_from_owner_text": "Thank you so, so much Kam, really appreciate the kind words and review. I look forward to seeing you again next year. Until then, take good care.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:11.870076",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106077090195736031628/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdHBPODlnRRAB",
            "reviewer_name": "Tri Nguyen",
            "rating": 5,
            "review_text": "Rob james is an incredible SMP artist! His masterful craftmanship not only delivers but exceeded my expectations. Upon arriving to the consultation, rob clarified the procedure and map out goal for me. Right away I can tell rob is passionate and truly cares about helping men and women deal with their hair loss. Thus right away him and I built a trusting relationship where he understands my concerns and what I was looking for. I would reccomend family, friends and anybody to speak with him first if your considering an SMP. My thanks Rob",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:11.874176",
            "response_from_owner_text": "Thank you very much Tri, it has been wonderful working with you and getting to know you over the last couple of weeks. Look forward to seeing you again perhaps this year. Take care and have a fantastic 2022. All the best. Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:11.874176",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104942859968186496819/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOXFhSGZnEAE",
            "reviewer_name": "RS G",
            "rating": 5,
            "review_text": "Robs work is a life-changer. Making the decision to get an SMP was not an easy one for me. It is a semi-permanent decision with many consequences should it be done improperly, especially because of my profession. It took me a long time to finally muster the courage to get it done after over a year of research. I was looking for a natural look as opposed to the edgy or lined-up look. I had seen many botched SMPs and some that just looked horrible. It was not until I came across Rob and his work that I took a chance. And let me tell you, I wish I had done it sooner. He tells you what to expect and truly delivers. His work is so natural that I have had people who hadnt seen me in a while ask me why I shaved my head when I still had hair! Not only is Rob a true master of his art, but he makes you feel as if youve known him for years. He helps put your mind at ease throughout the whole process. Listen to his recommendations and you will not regret it. It was the first time that I could remember where I got a result exactly to what I wanted/expected. Couldnt have been happier with the look. Once again, thanks Rob - see you at the touch-up. RSG",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:11.877609",
            "response_from_owner_text": "Thank you so, so much I truly appreciate the kind words! Like you I look forward to our next SMP touch-up session. Until then take good, good care of yourself. Sincerely, Rob",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-08-22 01:21:11.877609",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104938850001433080427/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHN29fcXhBRRAB",
            "reviewer_name": "Jason Toor",
            "rating": 5,
            "review_text": "Rob is amazing! He is kind, professional, and incredibly skilled! I have undergone 2 SMP sessions over a few weeks with Rob so far and I am in love with the results. I cant wait to see Rob for my next session and cannot recommend him enough to anyone thinking about getting SMP done!",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:11.881230",
            "response_from_owner_text": "Thank you so much Jason. It was a pleasure working with you and I m so happy that you re thus far happy with the results. Really look forward to catching up in the new year for your touch up session. Until then, take good care and have fun with your family over Christmas.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:11.881230",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/107544044118495655543/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtN19ldDNBRRAB",
            "reviewer_name": "Jonathan Belbin",
            "rating": 5,
            "review_text": "After doing a LOT of shopping around I found Rob James and flew up from LA to Vancouver to meet him and his team.  Rob was super professional and I had no hesitation entrusting him with a series of treatments. The results are amazing. Subtle and natural work that has taken 10 years off me! The travel was worth it! Can t recommend enough.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:11.884509",
            "response_from_owner_text": "It was an absolute blast working with you John, I m happy that we got the results you were after. Good luck with the festivals and the recordings! See you next year. Rob & Amigo (the team  )",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:11.884509",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117613127900591262793/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdHVtaTVBRRAB",
            "reviewer_name": "Davinder Randhawa",
            "rating": 5,
            "review_text": "Let me start by saying that Rob is very friendly and professional at the same time. I had 3 sessions with Rob all 3-4 hours long and didn t feel bored at all. He takes great pride in what he do. His passion toward SMP is amazing. I would definitely recommend Rob to anyone and everyone who needs SMP. He s very patient with his clients and don t rush at all. Rob is known is for the details and the quality of work he do and I have seen that myself. Thank you soooooo much Rob for what you have done for me ..",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:11.887443",
            "response_from_owner_text": "Thank you very much Davinder, it has been wonderful working with you. Have a wonderful summer and take good care.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:11.887443",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/106774475807087157598/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMmR6aFhREAE",
            "reviewer_name": "Jag Braich",
            "rating": 5,
            "review_text": "So I was pretty reluctant to get smp done at first, been bald most my life and I was pretty comfortable with my look. But I wanted a change so what the hell. Firs time meeting Rob; friendly, informative, not pushy and you can tell he knows what he s talking about. I ll cut to the chase, I love the end result. He s a magician. Every angle looks so natural. I personally think he s the best in the game right now!",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:21:11.890169",
            "response_from_owner_text": "Thank you so much my friend, it s been wonderful working with you. Look forward to seeing you for your touch up, until then, have a wonderful Christmas and New year with your family Rob",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:21:11.890169",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/115618923693626082253/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeUtmUVFBEAE",
            "reviewer_name": "Brandon Moncada",
            "rating": 5,
            "review_text": "I have spent years getting FUE transplants and after my hair donor supply had run out, the next step to achieving a fuller density was SMP. I researched artists for months in London, Los Angeles, New York and even Italy; I finally decided on Rob in Vancouver. After flying halfway across the world from South America and needing to stay in an airbnb for over 2 weeks.... I can say I not only made the right decision, but it was worth all the money and effort I put into getting this last chapter of my hair journey FINALLY closed. VERY HAPPY with Robs professionalism, attention and his obsession with making sure everything is absolutely perfect. This is exactly why I chose him, because I needed the best and thats what I got.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:21:11.892863",
            "response_from_owner_text": "Absolute pleasure working with you and getting to know you. Thank you so much for traveling so far and for having trust and faith in me. It s was awesome getting to know you, whenever you re ready for your SMP touch up let me know. I ll try to come to Colombia Safe travels, take good care.",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:21:11.892863",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/100872939447773116007/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaWVQS3l3RRAB",
            "reviewer_name": "Michael Bernal",
            "rating": 5,
            "review_text": "Just wanted to say thank you Rob for your amazing work on my SMP. It looks so great and natural. I am very happy with the end result. And my wife seemed really pleased with it. Great work, Rob! It was nice knowing you and working with you. You are very professional and you made me feel so comfortable there. Thank you so much.",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:21:11.895605",
            "response_from_owner_text": "Thank you so, so much Michael, it has been wonderful working with you and getting to know you. Very easy going enjoyable sessions. Have a great Christmas and I look forward to catching up in the new year.",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:21:11.895605",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118083438793765600575/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMHRlUE9BEAE",
            "reviewer_name": "Julian La Brooy",
            "rating": 5,
            "review_text": "Rob is an absolute legend of an SMP artist. He matched my colour perfectly and the hairline looks natural. Pretty flawless, if you ask me. Its those little nuances that make a huge difference. Loving it - thank you!",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:21:11.898138",
            "response_from_owner_text": "Thank you so much for the kind words buddy! It was a total pleasure working with you and getting to know you. Have a great Christmas and New Year, hopefully see you next year. Until next time, take good care.",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:21:11.898138",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112250723633947182213/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDdGV2dXlRRRAB",
            "reviewer_name": "Bruce",
            "rating": 5,
            "review_text": "I just finished my 3rd session with Rob, and as I knew from the very beginning when I first met him, this man is a great guy, an artist, and a perfectionist. He is incredibly easy to talk to, and he calmly and patiently put my mind at ease. He took the time with all my questions, and really knows his craft. He is a very genuine person, and I looked forward to my sessions and the great conversations we had. I knew my SMP would turn out great, but honestly it is even better than I thought. I am so happy that I went to Rob, he is truly great at what he does. Thank you Rob!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:21:12.551640",
            "response_from_owner_text": "Thank you so much Bruce, it has been wonderful working with you and getting to know you! I really appreciate the kind words. Look forward to seeing you again soon. Until next time, take good care.",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-22 01:21:12.551640",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112067753829186937025/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxcy1lTlV3EAE",
            "reviewer_name": "hamoody eskandar",
            "rating": 5,
            "review_text": "I had the pleasure of taking the Smp training course with Rob and he was awesome. Very easy going and approachable. He helped me and the rest of the class do everything the right way. I left the class very confident and educated. He made sure we all understood the importance of safety and the after care for each client. I recommend anyone looking to become an SMP artist to go through Rob James. Thank you Rob for setting me up for success! - Moe",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:12.555369",
            "response_from_owner_text": "Hi Moe, it was an absolute pleasure training you. You re going to do great and I look forward to watching your success and continuing to assist you. All the best!",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:12.555369",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/101718388014667547918/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydUt1a2hRRRAB",
            "reviewer_name": "H",
            "rating": 5,
            "review_text": "I never really looked into SMP but unforseen circumstances forced me to shave my head and show the FUT scar I had been hiding for years. I started looking up SMP in Vancouver and came across Vancouver SMP. Rob was great, I was blown away with the whole experience. Rob is a consummate professional and all around good guy, definitely check him out if your looking to get SMP. Also the studio is very nice and clean. Highly recommend Vancouver SMP.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:12.558812",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105739633733768414008/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocGQzaU13EAE",
            "reviewer_name": "Jamie Sharify",
            "rating": 5,
            "review_text": "After thoroughly researching companies we came across Robs Instagram page. We could tell his technique was above the others we had checked out  and decided to book a consultation. After the consultation we were 100% sure that we had found the right place. Rob is skilled and extremely knowledgeable we are beyond satisfied with the results and would highly recommend him to others.",
            "published_at": "9 months ago",
            "published_at_date": "2023-02-22 01:21:12.561515",
            "response_from_owner_text": "Thanks so much for the kind words and review, I sincerely appreciate it. It s been wonderful working with you and getting to know you. Truly look forward to seeing you again in the spring time. Until then, take good care.",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-02-22 01:21:12.561515",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/104868268348648223387/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNHR6QTRRRRAB",
            "reviewer_name": "Rav Gill",
            "rating": 5,
            "review_text": "Just wanted to give a shout out to Rob. Today is three years from the date we brought our triplets home from the hospital. Everyone is sending memories in the form of pics and vid s from that date. I am reminded now how back then Rob made sure my SMP was ready on time for all the pictures and memories just about to begin. Even now years later Rob continues to refresh my SMP always in time for family vacations and new memories still. Thank you for all your time and for keeping me up to date on all the latest products so my SMP stays  looking fresh and crisp as ever ! Rob your care and standard of work is top notch. Thank you :)",
            "published_at": "7 months ago",
            "published_at_date": "2023-04-22 01:21:12.564471",
            "response_from_owner_text": "Thank you so, so much for the very kind words!",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-22 01:21:12.564471",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/110582458993401263235/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdXFQYXZ3RRAB",
            "reviewer_name": "Kyle Edwards",
            "rating": 5,
            "review_text": "Rob is a consummate professional who is fantastic at his craft. He knows precisely the reasons why we come through his door, the fears and the uncertainties we have, and what it is that were looking for. His method is consultative, not prescriptive. He did precisely what I was looking for, and he went back and made all the minor changes that I had asked for. I noticed he takes all safeguards to ensure all his apparatuses are state-of-the-art and sanitized and makes every effort to keep you comfortable during your SMP session. Im very grateful for his artistry. The confidence his SMP gave me is so absolute. The results are genuinely second to none.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:12.568336",
            "response_from_owner_text": "Thank you very much Kyle, I did enjoy our conversations and Im happy we achieved the results that you had hoped for. I really look forward to our next chat. Take care and have a great 2022!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:12.568336",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100085287808800098172/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aHN6b1RnEAE",
            "reviewer_name": "El Lyle",
            "rating": 5,
            "review_text": "The idea of SMP can be a scary one but from start to finish, Rob made the entire process seamless and positive. Some of the differentiating factors about Rob from other SMP artists is that he took the time early on to answer all my questions without some type of sales pitch and was very transparent about the entire process. Rob, in my opinion is the most qualified and has the most reference material in terms of pictures, positive reviews and amount of SMP procedures completed. I learned he also does SMP training which is a good sign as the students are learning from the best in the business! Each sessions is a few hours however the time went by very quickly and you learn right away that Rob is a unique and down to earth guy. You can tell he is in the business to change lives in a positive manner and really enjoys his work. Bravo for finding his path in life and as someone that was along for the journey, it was a pleasure! I can tell you I feel a lot more confident in my look and overall less stressed about the idea of hair fibres or hiding behind a hat haha I have no regrets about my decision to get the procedure done with Rob. Great work but an even better human being!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:12.570978",
            "response_from_owner_text": "Thank you so much for the kind words, it really means a lot to me. I have enjoyed our sessions and I sincerely look forward to our next catch up during the winter. Until then please take good care.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:12.570978",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/113109788729510050363/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4dHN1dWVnEAE",
            "reviewer_name": "G L",
            "rating": 5,
            "review_text": "I did a great deal of research before deciding to go with Rob and could not have made a better choice. He deeply cares about both his work and his clients, which is quickly evident through his professionalism and attention to detail. On top of that, Rob is extremely personable making the entire process comfortable and positive. I would 100%, without reservation, recommend Rob to anyone looking into SMP!",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:21:12.573652",
            "response_from_owner_text": "It s been a totally pleasure working with you and getting to know you. So happy you re pleased with the results. Enjoy your summer, catch up soon!",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-22 01:21:12.573652",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/105405921488321418979/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNld052dFhnEAE",
            "reviewer_name": "Landon Dingle",
            "rating": 5,
            "review_text": "Glad I waited for Rob to do my smp, well worth the wait. I knew I was in good hands from the beginning as he was knowledgeable and professional. Rob made the process comfortable and stress free. Very happy with the outcome should have did it 5 years ago.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:12.576169",
            "response_from_owner_text": "Thank you so much for the kind review, It was a total pleasure working with you Landon. Enjoy the rest of your summer and I look forward to catching up again. Until then, take care.",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:12.576169",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/105384033161058081435/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NHBPWVdREAE",
            "reviewer_name": "Renee Simpson",
            "rating": 5,
            "review_text": "I RARELY post anything on google reviews. But I made the exception for Rob so that already says a lot about the type of work he does. Rob is very knowledgeable and dedicated to his craft. He is also very caring and brings a level of presence to his work that is fabulous. I highly recommend him! In any case...if youre scrolling through these comments, youre probably looking for some sort of reassurance that Rob is youre guy. If youve happened to scroll across my review... and youre looking for a sign to see if you should do it? Consider this YOUR sign!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:12.578898",
            "response_from_owner_text": "Thank you so much for the wonderful review Renee. I truly appreciate it. Was wonderful working with you and I look forward to catching up again in the winter. Until then, take care.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:12.578898",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103258632523731428315/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbThtall3EAE",
            "reviewer_name": "Alex",
            "rating": 5,
            "review_text": "Rob is not only a highly skilled professional who really loves what he does, but he is also an amazing person to spend time with. He takes his time answering all your questions and sharing his knowledge and experience with you and truly cares about the people he works with. If you are still on the fence, then book a consultation and if you are lucky enough, you might meet two absolutely adorable Yorkies in his studio.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:13.246597",
            "response_from_owner_text": "Thank you so much for the kind review, and for trusting in me for your SMP. it has been wonderful getting to know you over the last month or so. Have a good winter and I look forward to seeing you again sometime in the new year for your SMP touch up. Until then, take good care. Cheers, Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:13.246597",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/100871971242862021977/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtc19hY2x3RRAB",
            "reviewer_name": "Camilo Trujillo Sanchez",
            "rating": 5,
            "review_text": "Working with and getting to know Rob has been an awesome experience. He is a consummate professional who goes above and beyond. The service was exceptional, and far exceeded my expectations. Highly recommended.",
            "published_at": "11 months ago",
            "published_at_date": "2022-12-22 01:21:13.249318",
            "response_from_owner_text": "Thank you so, so much for the kind review, much appreciated. It has been a total pleasure working with you. Have a great Christmas and new year. Rob",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2022-12-22 01:21:13.249318",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 24,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/110927694045025186803/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbEp1VVJ3EAE",
            "reviewer_name": "E M",
            "rating": 5,
            "review_text": "For anyone considering SMP, Rob James is the only choice in my opinion. The process was much better than I hoped for, it was not painful at all, this is cause of experience and exceptional talent. It s hard to put into words how happy I am with the results. I must also point out that the stages at which Rob leaves you with after your first second and third appointment are so gradual and well done, it actually looks like it s your hair growing back. I m absolutely ecstatic with the results. I would highly recommend Rob James for his professionalism and staggeringly realistic final product.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:13.252365",
            "response_from_owner_text": "Im so glad the experience was positive and that youre happy with the results. Our indepth conversations made the sessions fly by so quickly! I look forward to seeing you over the summer. Until then take care.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:13.252365",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102412340142279083422/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdnJTNXF3RRAB",
            "reviewer_name": "G M",
            "rating": 5,
            "review_text": "If you re thinking about getting SMP and want natural results, Rob James is your guy. I was very nervous about getting this procedure, but after meeting him I knew I was in good hands. Every session was a great experience, and had me looking better each time. Rob James is the best in Vancouver, and to top it off a really nice guy. Truly one of a kind.",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:13.254696",
            "response_from_owner_text": "Sincerely appreciated, and glad I could make the process enjoyable. However, it wasnt hard, You are very easy to work with, we seemed to spend most of the time laughing and talking about life. Look forward to catching up during your touch up session. Until then, take good care.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:13.254696",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/118193218204764462508/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLemIyeXdBRRAB",
            "reviewer_name": "John Northam",
            "rating": 5,
            "review_text": "It was an absolute pleasure working with Rob.  Originally, I was hesitant about getting SMP because I have very light thin greying hair.  I met with Rob for a consultation and he put my mind at ease.  He walked me the the process, talked about what his approach would be for my hair and scalp type.  There was absolutely no pressure.  I would highly recommend Rob to anyone looking for SMP.  He has lots of experience and has a take it slow step by step approach so you can make sure that you are happy with the results as you go through the process.  I wanted a subtle natural look and that s exactly what Rob delivered.  Thank you Rob!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:13.256999",
            "response_from_owner_text": "The pleasure was all mine John, absolutely fantastic working with you and getting to know you. So happy you re please with the results, have a fantastic summer and I look forward to seeing you in the fall.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:13.256999",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/117121087640065058081/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaEtPcjRRRRAB",
            "reviewer_name": "elena kolesova",
            "rating": 5,
            "review_text": "I just finished my 3rd session for female density with Rob and could not be happier with the result! I tried various methods for hair loss: laser, micro needling, various hair drops and supplements, but nothing seem to work. I started losing my confidence, and decided it is a time for change! My experience with Rob has been fantastic from initial consultation till our final session. After meeting him, I knew I was in good hands. I saw the gradual increase in my hair density which looks very natural on my pale skin and light hair. I would highly recommend Rob for SMP to achieve the most natural results. Thank you very much Rob for restoring my confidence!",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:13.259421",
            "response_from_owner_text": "Thank you so much for the kind review Elena, it has been a total pleasure working with you. I hope you have an amazing summer and I ll see you in the fall. Take care",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:13.259421",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102271493879835461728/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aHFPVHhnRRAB",
            "reviewer_name": "Nick Nates",
            "rating": 5,
            "review_text": "I contacted Rob in order to help with scar concealment on my scalp. Rob was extremely professional and knowledgeable. I felt comfortable expressing my concerns and that they were validated. I believe Rob to be personally invested in each case and committed to providing the best experience possible. I would certainly recommend Rob to anyone seeking the services he provides.",
            "published_at": "a year ago",
            "published_at_date": "2022-11-22 01:21:13.262195",
            "response_from_owner_text": "Thank you very much Nick, absolutely wonderful working with you. Truly look forward to catching up again during your touch up session at sometime in the future. Enjoy the rest of the summer. All the best, Rob",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-11-22 01:21:13.262195",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 14,
            "reviewer_url": "https://www.google.com/maps/contrib/117062650128077381105/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4blBLV2RnEAE",
            "reviewer_name": "Luis Rotondaro",
            "rating": 5,
            "review_text": "Rob is awesome, very professional and overall an excellent SPM legend. He really makes it look 100% natural.",
            "published_at": "6 months ago",
            "published_at_date": "2023-05-22 01:21:13.264756",
            "response_from_owner_text": "Thank you so, so much for the kind review Luis, really means a lot to me. It s been a pleasure getting to know you over the last year. Have a wonderful summer ahead and until next time, take good care.",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-05-22 01:21:13.264756",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112755822046771567575/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMElYSmNREAE",
            "reviewer_name": "Je Dg",
            "rating": 5,
            "review_text": "Just finished my last session of SMP with Rob for female hair density and had an amazing experience throughout. During the initial consultation, Rob was extremely patient and was able to answer all my questions that I had regarding the SMP process and was honest about the results that Id be able to expect. The sessions themselves also went very smoothly. I personally found it to be virtually painless and conversations with Rob came super easily. Excited to see the final results once the healing process completes! Thanks again Rob :)",
            "published_at": "2 years ago",
            "published_at_date": "2021-11-22 01:21:13.267784",
            "response_from_owner_text": "Thank you so much for the kind review. It was lovely working with you, I hope you have a fantastic summer and I ll see you in the fall. Until then, take good care.",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-11-22 01:21:13.267784",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102766572170249473543/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzaU1EWWJnEAE",
            "reviewer_name": "Kervin Rosales",
            "rating": 5,
            "review_text": "I had 2 sessions so far from Rob. His work is amazing. SMP on my head is very detailed and looks natural. I love it so much that I decided to go for a full shaved look rather than a long buzz cut with density. I am super happy with the results. I could not recommend Rob enough for anyone who is thinking about going. Friendly and Professional service all throughout.",
            "published_at": "3 years ago",
            "published_at_date": "2020-11-22 01:21:13.270627",
            "response_from_owner_text": "Been fantastic working with you Kervin! Thank you very much",
            "response_from_owner_ago": "3 years ago",
            "response_from_owner_date": "2020-11-22 01:21:13.270627",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/114363819591556800009/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}