{
    "place_id": "ChIJ4cXZFzl0hlQRHP9ZUlnES80",
    "reviews": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaTluY2NnEAE",
            "reviewer_name": "Esther Chung-Ferguson",
            "rating": 5,
            "review_text": "I recently built our home and wanted it to be smart. Im a pretty techy person and I wanted the house to do everything I always wished it could do. I had a lot of things on my wish list, and a lot of questions. I met with several vendors, and each one was different, but ADS was the only one where I was happy with the price, the service, and willingness to work with me to get everything exactly as I wanted it. Others would say no one does that, its not possible. ADS would say, interesting, let me get back to you! And they always got back to me, and they almost always had a solution. If it really was impossible, they helped me understand why. Of all the things I did for my house, making my home smart had the most details to work out. ADS helped me work out every last detail exactly as I would want it, with lots of good advice and suggestions. And they are always very responsive to my questions, so I am reassured that if I need anything, theyll be there for me. And I love my smart home! Now, ADS job is done, and I can confidently write this review, that they are awesome. Also, youll soon learn that it is a father-son team, and I love that. Amarjit and Karn are super nice, and they will earn your trust very quickly. It was a big (and expensive) project and I wasnt just going to hand out my trust either, they really earned it with their honest and transparent dealings with me. When youre dealing with a construction/reno project, trust is key to a stress free experience, and youre going to get that wit ADS. (And trust me Ive had my share of horrible experiences!) So now, Im going to hire them to do my automatic blinds. Theyll always have my repeat business.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:12:01.214183",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 14,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/111964859973781310514/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbTZPS3RRRRAB",
            "reviewer_name": "Navi Boyal",
            "rating": 5,
            "review_text": "I built my first home and had no idea of the capabilities of automation and smart features in a home. I got multiple quotes on the basic features I did not know about.  I received quotes from multiple companies  and I had no understanding of what work was going to be done or the benefits of it. Karn at ADS was patient with me and explained the features and benefits of everything. They created a system that was customized for my family and our budget. Upon completion of the work they have returned for service calls and upgraded my system from remote locations when needed. They are always available to answer questions and help out whenever they can. The best part of it all is Amarjit and Karn Love what they do and are always excited about new systems, and features. They are a pleasure to deal with and I look forward to working on my next project with them.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:12:01.219212",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 20,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/116973991330258677774/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJa2VyV093EAE",
            "reviewer_name": "Esar Cheema",
            "rating": 5,
            "review_text": "Been using ADS for years. Highly recommend them for any commercial or residential. Reliable father and son team that put our needs first.",
            "published_at": "4 years ago",
            "published_at_date": "2019-11-21 21:12:01.223201",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102499251920120285422/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdnFDYW9BRRAB",
            "reviewer_name": "G P",
            "rating": 1,
            "review_text": "",
            "published_at": "2 months ago",
            "published_at_date": "2023-09-21 21:12:01.226577",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 40,
            "total_number_of_photos_by_reviewer": 81,
            "reviewer_url": "https://www.google.com/maps/contrib/105891977165391279816/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}