{
    "place_id": "ChIJmVo1HEt0hlQRJ4QISlw3B9c",
    "reviews": [
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdFkydTFnRRAB",
            "reviewer_name": "Hamed Soltani",
            "rating": 5,
            "review_text": "Ive been wanting to visit this place for a while now, and today I was in the neighborhood and saw that it was opening at 7, so I got there just before they opened, and it was still dark. I saw them going into the cafe and many of the employees of the supply store they are located at. Had no idea it was at a lumber and hardware supply warehouse, surrounded by many other commercial warehouses, such a great surprise, which just makes it that much better. Absolutely loved the atmosphere and the owners. Very friendly older couple and their son run this awesome famiky owned cafe. Awesome home cooked breakfast, amazing friendly and relaxed service, and unbelievable atmosphere. When I got there, I was the only one, but I still loved it so much. The old school diner style furniture and music were awesome. I got the pancake with blueberries, sunny side up eggs, and sausage, which were all very good. Loved their old small glass coffee maker and the mugs. The son who was serving was very nice and friendly....he me told me that this place has been around since the 1940s and his parents got this place 15 years ago have been in the business for so long after they retired, wanted to have a slow and small place and now this place is exploded and is crazy busy ...which I find very funny and awesome. Will definitely come back to try their burgers and Chinese food.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:17.495554",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 112,
            "total_number_of_photos_by_reviewer": 159,
            "reviewer_url": "https://www.google.com/maps/contrib/108536927990609730670/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsX1BMQXlnRRAB",
            "reviewer_name": "Jenny C",
            "rating": 5,
            "review_text": "Finally got to try this little gem on a holiday Monday. We waited 1.5 hrs but it was worth the wait. This place is the perfect example of an unpretentious, no fuss family run restaurant that focuses on delicious comfort food. The staff were warm, welcoming and attentive.",
            "published_at": "2 weeks ago",
            "published_at_date": "2023-11-17 02:07:17.499535",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 15,
            "total_number_of_photos_by_reviewer": 11,
            "reviewer_url": "https://www.google.com/maps/contrib/112552373905808335522/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacy1IUVB3EAE",
            "reviewer_name": "Marcela Rodriguez",
            "rating": 5,
            "review_text": "This place is a jewel in Vancouver. From the very unexpected entrance, to the warmth of the staff to the amazing food. Everything you need to have a beautiful experience. No fancy coffee drinks that are replaced for an absolutely amazing food experience. Everything is cooked to perfection, from fresh ingredients never frozen. The flavors are an experience. That are accompanied by the smiles of every staff member. The place is cozy and comfortable. The house wonton soup is really great, a mix of flavors and expertly served. The hash browns the best! Don t forget your cash or debit, your credit cards are not welcome here  :) Parking: In front of the building, do not park on the spaces designated for other business",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:17.503178",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": 21,
            "reviewer_url": "https://www.google.com/maps/contrib/102346291951528178698/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN1pfSjN3RRAB",
            "reviewer_name": "angel lo",
            "rating": 5,
            "review_text": "This is an amazing place for breakfast, and lunch. The place located in the middle of the factories places, and we need to go upstairs and feel like home. The restaurant is hidden in the area, and this is spectaular place, and with delicious foods. The omelette is very delicious and with the hash brown which flattered down like a sheet. The eggs just cooked perfectly, and the hash brown is thin and tasty It is recommended to go for eating!!!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:17.506518",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 320,
            "total_number_of_photos_by_reviewer": 1311,
            "reviewer_url": "https://www.google.com/maps/contrib/103094719488854439128/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeE1PTTdRRRAB",
            "reviewer_name": "Alice Chan",
            "rating": 5,
            "review_text": "I keep coming back to this cozy place for breakfast/lunch. I LOVE their shredded hash browns   . The family who runs this restaurant is super friendly! I brought my parents to eat the other day, and the owner came over to chat with us. Thank you for sharing your story with us, it made our visit super memorable.",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:17.509295",
            "response_from_owner_text": "Hi Alice, Thank you for taking the time to write this amazing review. So glad you enjoyed the shredded hash and had a great time with us!! We look forward to having you back again soon! Richard and Raymond",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-07-01 02:07:17.509295",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 11,
            "total_number_of_photos_by_reviewer": 28,
            "reviewer_url": "https://www.google.com/maps/contrib/118102314928698884689/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNVpQbVFnEAE",
            "reviewer_name": "Adam Myhre",
            "rating": 5,
            "review_text": "After hearing so much about Northern Cafe, my anticipation was high as I finally made a reservation to dine at this much-acclaimed establishment. The decision to reserve a table proved to be wise; we were seated almost immediately upon arrival, avoiding the long wait times that had deterred us during a previous attempt to dine here. Dont be fooled by its surprising location or the state of the building (which might seem to some as if it were about to collapse at any moment).  Inside is something you wont find anywhere else in Vancouver! The atmosphere at Northern Cafe is inviting, reflecting its family-run ethos. The menu offers a variety of comfort food options, and we opted for burgers and a side of poutine. The food was exceptional each bite of the burger was a blend of flavors and textures, and the poutine was a delightful mix of crispy fries, cheese, and well-balanced gravy. What stood out, even more, was the service. The staff were attentive and courteous, enhancing the overall dining experience. Its evident why this establishment has garnered such high praise and even topped lists of the best places to eat in Canada. A particularly charming touch was the inclusion of watermelon slices with our meal. It added a refreshing contrast to the hearty fare and demonstrated the restaurants attention to detail. Another delightful aspect was the handwritten reviews by children displayed on the wall, which actually helped us make our menu choices. Northern Cafe lives up to its reputation. The combination of delicious food, excellent service, and a welcoming atmosphere makes it a must-visit. Making a reservation is highly recommended!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:17.512355",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 48,
            "total_number_of_photos_by_reviewer": 75,
            "reviewer_url": "https://www.google.com/maps/contrib/113833586512673443571/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bm9IR0tnEAE",
            "reviewer_name": "Kingramen",
            "rating": 5,
            "review_text": "If you are desperate for comfort, then this friendly family run cafe will brighten your day! The hash brown is a must have, thin and crispy. The pork chop sandwich was tasty, as the meat was well marinated and juicy. Brighten my day especially in this awful rainy weather!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:17.514840",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 36,
            "total_number_of_photos_by_reviewer": 102,
            "reviewer_url": "https://www.google.com/maps/contrib/103799463911720817509/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadDhEbm1BRRAB",
            "reviewer_name": "cara low",
            "rating": 5,
            "review_text": "Our first time visiting! Located in a unique location paired with great food made for a lovely visit. Service was warm/friendly and quick. The place seems to have a lot of regulars, which says a lot when there are so many eatery options in Vancouver. We will be back!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:17.516992",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/108119754061015979238/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcXUyVkZREAE",
            "reviewer_name": "T Ng",
            "rating": 5,
            "review_text": "Definitely one of a kind and one of a few left in the city! The food: solid staples and honestly, you cannot go wrong with anything here. The owners and staff were lovely despite being very busy! Even though the wait can be long (approx 45mins), I think the experience in the end was worth it! Truly a gem and I hope it is here for many years to come!",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:17.519728",
            "response_from_owner_text": "Hello T Ng, Thank you so much for visiting and so glad you enjoyed the food and experience. We truly appreciate you finding the time to write this review. This means so much to us. We look forward to having you back again soon! Richard and Raymond",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-07-01 02:07:17.519728",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 23,
            "total_number_of_photos_by_reviewer": 76,
            "reviewer_url": "https://www.google.com/maps/contrib/100394941194603732068/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dFBteklBEAE",
            "reviewer_name": "Alex Y.",
            "rating": 5,
            "review_text": "A relaxed greasy spoon setting with friendly service. Food is delicious and unpretentious. I always look forward to coming here, especially for the extra crispy hash browns!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:17.522204",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/110047362811638133817/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNm9LeUxREAE",
            "reviewer_name": "Jacob Canale",
            "rating": 5,
            "review_text": "Reviews speak for themselves! If you haven t come here yet, you gotta. Waiter was also a very cool dude. Definitely a regular spot for me now!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:18.131374",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 99,
            "total_number_of_photos_by_reviewer": 32,
            "reviewer_url": "https://www.google.com/maps/contrib/108842378764795035495/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa3JuWXZ3RRAB",
            "reviewer_name": "Willy Lien",
            "rating": 5,
            "review_text": "Staff was polite and very helpful. It was my first time eating at Northern Cafe and I tried the Deluxe Burger with a small poutine while my friend tried the Steak n  Egg. We also shared a bowl on wonton soup and my friend had a cup of coffee. (Our bill was ~$57 after tip). The portion was good and the quality of the meal was satisfactory. We were both very happy with our food. I have no feedback from my visit and would recommend this place to anyone. Of note, you can expect to wait to be seated as the establishment is small and can be busy, but they offer text notification which was nice.",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:07:18.135725",
            "response_from_owner_text": "Hi Willy Thank you for taking the time to post the this great review and the amazing photos! We truly appreciate it! So glad to hear you enjoyed the food and experience! We look forward to having you back again soon! Richard and Raymond",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-05-01 02:07:18.135725",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 22,
            "total_number_of_photos_by_reviewer": 35,
            "reviewer_url": "https://www.google.com/maps/contrib/106741661770818529988/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcU5YanFBRRAB",
            "reviewer_name": "B Y",
            "rating": 5,
            "review_text": "I love this place. It s a hole in the wall for sure, but it actually is amazing. The menu may seem like typical diner fare and Chinese chop suey style items, however, from the ingredients to the way the food is made is certainly anything but typical. Even their burgers are made with AAA sirloin beef. Overall, everything I ve tried here (both breakfast and lunch items) in my multiple times visiting have been very yummy. Don t be fooled by its industrial surroundings and the wobbly stairs leading to the diner, this place is truly a hidden gem and is worth the hype. But make sure you have some time to wait, there is usually a wait time even outside the usual meal time rush.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:18.139137",
            "response_from_owner_text": "Hi BY, Thank you for a kind review. We truly appreciate it! Feeling the love and support!  Glad you enjoyed the great food and experience.  We look forward to having you back soon!  :) Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:18.139137",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 19,
            "reviewer_url": "https://www.google.com/maps/contrib/107461730609573563541/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4XzVYX0NREAE",
            "reviewer_name": "Grim Eater",
            "rating": 5,
            "review_text": "The first thing I will say is that this is by far the best diner Ive been to. The day I write this review is my first time going, and Ill tell you its a diamond in the rough! The cafe is within a lumber yard, and you are required to climb a narrow flight of stairs before entering the diner itself. Upon entering, the environment is very tight-knit and warm, a trademark of a family owned business. The owners and the waiter were all very friendly and gave us fist bumps after realizing it was our first time there. He was also very friendly and checked up on us from time to time to make sure our experience was a satisfying one. The item Ive ordered was the Northern Deluxe burger, which comes with fries, potato salad, and a slice of watermelon to counter the savory meal. I decided to add 3 dollars for the poutine instead, and im glad I made that decision. When the food came, I was instantly salivating from the gorgeous looks of the burger. When I took my first bite, flavors burst into my mouth, and a party took place. By far, its an amazing burger and something to crave for! (I never craved for a burger/sandwich before) While I was enjoying my burger, one of my friends had a spicy chicken sandwich, which also looked appetizing and is something I must try next on my following visit. The Eggs Benedict and the Cheddar burger my other friends ordered also looked equally appetizing as well! All of the choices look amazing and will be things Ill try out in the future. Overall, even though this place is located within a lumber yard, the food and staff blew my mind away. This will officially be my first 5 star review and to put it in simple terms... Northern Cafe, you have mastered your craft. I will be back!",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:18.142661",
            "response_from_owner_text": "Hi Grim Eater, Thank you for the 5-star review and taking the the to write this. We truly appreciate it! Feeling the love and support!  Glad you enjoyed the great food and experience.  We look forward to having you back soon!  :) Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:18.142661",
            "review_likes_count": 6,
            "total_number_of_reviews_by_reviewer": 30,
            "total_number_of_photos_by_reviewer": 190,
            "reviewer_url": "https://www.google.com/maps/contrib/101241487355327082543/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMTgtREVBEAE",
            "reviewer_name": "Austin Kenny",
            "rating": 5,
            "review_text": "Love the charming and quirky location. Of course one of the best cafes I ve ever been to is above a working lumber yard. This place gets busy fast and once you ve dined here you ll understand why. We arrived 7 minutes after opening and within 5 minutes the line was out the door and in the lumber yard. The service is wonderful and the breakfast food is classic greasy spoon diner fare. Important detail when it comes to payment, they only accept local debit cards and Canadian currency. This left us paying via PayPal! It was unexpected yet quite convenient. Love this place!",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:07:18.146286",
            "response_from_owner_text": "HI Austin, Thank you for taking the time to write this glowing review! So glad you enjoyed the experience and food! Regarding payment, we try to make it convenient for international guests that visit and thats why we have set up paypal as a payment method. Glad that everything worked out!  We hope you can visit us again soon. Take care! Richard and Raymond",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 02:07:18.146286",
            "review_likes_count": 7,
            "total_number_of_reviews_by_reviewer": 115,
            "total_number_of_photos_by_reviewer": 467,
            "reviewer_url": "https://www.google.com/maps/contrib/103245751928154040098/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaDV5cEl3EAE",
            "reviewer_name": "ewan quirk",
            "rating": 5,
            "review_text": "Real-life diner. Western & Chinese. Not sure when it started. First went in the late 80s early 90s. Dishes and menu are the same, they no longer have sourdough bread though. Still GREAT!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:18.149032",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 96,
            "total_number_of_photos_by_reviewer": 103,
            "reviewer_url": "https://www.google.com/maps/contrib/117353834994892781431/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadzhlal93RRAB",
            "reviewer_name": "Kevin Fan",
            "rating": 5,
            "review_text": "pretty tasty place, wonton soup is nice probably just the wonton instead of the noodle though , hash brown, egg benedict, pancakes are also good. long lineup during lunchtime.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:18.152113",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 41,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/112111188846892360915/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dEx6bjNBRRAB",
            "reviewer_name": "Savannah",
            "rating": 5,
            "review_text": "Warm welcoming staff and flavourful food! This cafe is located in a unique place, just above the building supply company. They serve a wide range of breakfast foods and other dishes like Wonton soup! We ordered the pancake combo with sausage. You can customize the toppings for your pancakes (either blueberry or chocolate chips). The pancakes had a fluffy texture and tasted great. I would definitely recommend this place for breakfast or lunch.",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:18.154945",
            "response_from_owner_text": "Hi Savannah, Thank you for the 5-star review. We truly appreciate it! Feeling the love and support!  Glad you enjoyed the great food and experience.  We look forward to having you back soon!  :) Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:18.154945",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 159,
            "total_number_of_photos_by_reviewer": 425,
            "reviewer_url": "https://www.google.com/maps/contrib/110260646550996706219/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OThpbXdnRRAB",
            "reviewer_name": "Anita B",
            "rating": 5,
            "review_text": "We love going for brunch and Northern Cafe has been on our radar for a while to check out. I loved the strange location of it all   a family run restaurant amongst a lumber yard. This place drew in quite the mixed crowd of local enthusiasts/regulars and lunch crew of construction workers and the like. There s something very nostalgic about Northern Cafe and it s this charm that makes for a fun dining experience. I loved that I was able to order Chinese food while my husband ordered western breakfast. This combination serves well in my books and I am glad to have given Northern Cafe a visit. I ll have to go back for the wonton soup as it seemed to be quite the popular dish ordered. I had opted for the potstickers instead (not pictured cause it arrived as the last dish and I forgot to take a pic) but wish I went with the wonton because I didn t think the potstickers were anything special.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:18.157548",
            "response_from_owner_text": "HI Anita Thank you so much for taking the time to write this amazing review. We truly appreciate it. Glad you enjoyed the food and experience - and most of all you felt like family here. We look forward to having you back again and  hope you can try our wontons next time!  See you soon! Richard and Raymond",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-06-01 02:07:18.157548",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 43,
            "total_number_of_photos_by_reviewer": 175,
            "reviewer_url": "https://www.google.com/maps/contrib/110188105904415390267/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eW9mYkRnEAE",
            "reviewer_name": "Danish",
            "rating": 5,
            "review_text": "One of the best hidden breakfast spots in the city. Even though it is difficult to find at first, making your way through the lumber yard, and up through the small staircase adds to the charming experience. The place gets busy and for good reason; affordably priced delicious food, welcoming service, and cozy atmosphere. Ordered the garden omelette and philly cheese steak melt.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:18.159988",
            "response_from_owner_text": "Hi Danish, Thank you for taking the time to write this amazing review! We our truly humbled! We Look forward to your next visit! Richard and Raymond",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-06-01 02:07:18.159988",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 10,
            "total_number_of_photos_by_reviewer": 25,
            "reviewer_url": "https://www.google.com/maps/contrib/115052543355933339599/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OS1LbTZ3RRAB",
            "reviewer_name": "Valerie Yuen",
            "rating": 5,
            "review_text": "This place is a hidden gem. Great for breakfast/brunch. Be prepared for long lines!!! Call ahead to place your name in queue before you arrive. The inside of the restaurant is small and cosy. The food is great and you get huge portions for a reasonable price. There s also a lot of options for brunch and they cater to vegetarians. The potstickers (dumplings) were delicious! Will definitely come back again.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:18.771040",
            "response_from_owner_text": "HI Valerie Thank you so much for taking the time to write this review. We truly appreciate it. Glad you enjoyed the food and experience - and most of all you felt like family here. Great that you pointed out that we have Vegetarian options. We try to accomodate for all. We look forward to having you back again and do hope you can try our homemade wontons - its a favourite of many. See you soon! Richard and Raymond",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-06-01 02:07:18.771040",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 140,
            "total_number_of_photos_by_reviewer": 128,
            "reviewer_url": "https://www.google.com/maps/contrib/107067346775199875665/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGczVleUdREAE",
            "reviewer_name": "Andy Co",
            "rating": 5,
            "review_text": "Almost missed the cafe due to it s location as it is located inside a hardware shop area. Long lines might deter you but be patient because the wait is worth it! Simple food made right is spot on!!! Great for brunch!",
            "published_at": "3 weeks ago",
            "published_at_date": "2023-11-10 02:07:18.773234",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 156,
            "total_number_of_photos_by_reviewer": 305,
            "reviewer_url": "https://www.google.com/maps/contrib/108896805649346991527/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKa3J1N29RRRAB",
            "reviewer_name": "Barbara Gomez",
            "rating": 5,
            "review_text": "We had an amazing cozy experience, everything was delicious, friendly ambiance and great music. Its a hidden jewel, highly recommended",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:18.775599",
            "response_from_owner_text": "Hello Barbara, Thank you so much for visiting and so glad you enjoyed the food and experience. We truly appreciate you finding the time to write this review. This means so much to us and we feel the love. :) We look forward to having you back again soon! Richard and Raymond",
            "response_from_owner_ago": "5 months ago",
            "response_from_owner_date": "2023-07-01 02:07:18.775599",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 45,
            "total_number_of_photos_by_reviewer": 290,
            "reviewer_url": "https://www.google.com/maps/contrib/113797153960384880011/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdWJEVEpREAE",
            "reviewer_name": "applejuicecanada",
            "rating": 5,
            "review_text": "Heard so much about this unique Cafe / Diner from various medias and friends ... its like stepping back in time when you enter into this tiny space which is on top of a lumber yard, location & decor itself is an experience! All the folks here are very friendly, family style through and through!! Dad, and Sons ... Service is fast & coffee is always filled! Food is very homey and not pretentious, true flavour without too much embellishments. Outstanding Egg Benny rich and creamy hollandaise cover a perfectly poached egg!  With a cup of hot coffee, what more can you ask for!! Street parking is available, which can be an issue if you come during peak business hours! The restaurant will be closed for winter break from Nov 22, 2023 to Jan 4, 2023. ( Call to confirm if you wish to visit! ) Purely coincident to have a meal there before their break!! For sure we will re-visit again when we are in town!!",
            "published_at": "a week ago",
            "published_at_date": "2023-11-24 02:07:18.778187",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 215,
            "total_number_of_photos_by_reviewer": 10855,
            "reviewer_url": "https://www.google.com/maps/contrib/101817213644451414138/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MGJxY0tREAE",
            "reviewer_name": "Bernard Higham",
            "rating": 5,
            "review_text": "A wonderful diner in a least expected spot...above a lumber yard! Very friendly and engaging staff. Wonderful food actually made in-house.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:18.780420",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 67,
            "total_number_of_photos_by_reviewer": 114,
            "reviewer_url": "https://www.google.com/maps/contrib/114646287389776171506/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M0xhRHFRRRAB",
            "reviewer_name": "Lavinia",
            "rating": 5,
            "review_text": "The server and the food are excellent there. We ordered Wonton Soup, North Deluxe Burger, and Combination Plate, they tasted so good. We d love to go there one more time.",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:18.782622",
            "response_from_owner_text": "Hi Lavinia, Thank you for the 5-star review. We truly appreciate it! Feeling the love and support!  Glad you enjoyed the great food and experience.  We look forward to having you back soon!  :) Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:18.782622",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/100832471966284740182/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM3I3aVh3EAE",
            "reviewer_name": "Madison G",
            "rating": 5,
            "review_text": "I ve heard so many good things about this place I had to try it myself ! I m sure because this place is trending on Tik tok it has become very very busy. We showed up around 11am on a Saturday and there was about an hour and a half minute wait list. We didn t mind waiting we went for a walk. The breakfast to us was worth the wait. It was so delicious, and really made you feel like you were having a nice home cooked meal. The service was wonderful , and everyone was so friendly. I was drinking my coffee and water and whenever it got low immediately without asking they would fill it back up. The hand cut fries were amazing. And the pancake was so yummy and doughy. I would highly recommend coming to check this place out. It s a little hidden to get to and you need to watch out for the very very steep stairs but once you make it to the top , it s very easy to find. Thank so much for the wonderful experience, we will be back again",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:18.784607",
            "response_from_owner_text": "Hi Madison, Thank you for visiting us and giving us an amazing review! We truly appreciate it! SO happy you enjoyed the food and experience and we look forward to your next visit! See you soon! Richard and Raymond",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-05-01 02:07:18.784607",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 107,
            "total_number_of_photos_by_reviewer": 441,
            "reviewer_url": "https://www.google.com/maps/contrib/110099669216095393930/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbHBYQ2pnRRAB",
            "reviewer_name": "Justin Lam",
            "rating": 5,
            "review_text": "Hearty, warm all day breakfast items to get you started on your day! Comes with free coffee refills.",
            "published_at": "a week ago",
            "published_at_date": "2023-11-24 02:07:18.786428",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 147,
            "total_number_of_photos_by_reviewer": 285,
            "reviewer_url": "https://www.google.com/maps/contrib/112445298287685394406/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOVoyV2lBRRAB",
            "reviewer_name": "Kareem Foster",
            "rating": 5,
            "review_text": "Friendly staff,  cozy location, and delicious food.  Must go to if youre looking for some awesome food!",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:18.788589",
            "response_from_owner_text": "Hi Kareem, Thank you for a kind review. We truly appreciate it! Feeling the love and support!  Glad you enjoyed the food and experience.  We look forward to having you back soon!  :) Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:18.788589",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 29,
            "total_number_of_photos_by_reviewer": 40,
            "reviewer_url": "https://www.google.com/maps/contrib/104343618424625059859/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta0lMS1hnEAE",
            "reviewer_name": "Janis Chiu",
            "rating": 5,
            "review_text": "It was a hidden gem, but not so hidden anymore   Their  ham and egg benny and hashbrowns is still my favourite. The deluxe burger and wonton were ok.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:18.790873",
            "response_from_owner_text": "Hi Janis, We appreciate you taking the time to write this amazing review.  Truly appreciate it - So glad to hear you enjoyed the experience and the food. For our Burgers, we use AAA Sirloin and ground our own beef including hand-pressing our Burger patties. Its all made fresh! Hopefully you can try it next time on your next visit. Thank you again and take care! Richard and Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:18.790873",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 365,
            "total_number_of_photos_by_reviewer": 235,
            "reviewer_url": "https://www.google.com/maps/contrib/105095175920225381061/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCb2VEbk9nEAE",
            "reviewer_name": "Ben Odyn",
            "rating": 5,
            "review_text": "Authentic Vancouver character in this family run restaurant. Great service, great atmosphere, great breakfast. True gem in the rough, a wonderful place to take family and friends for breakfast or brunch. It s a family run business where it s clear everyone involved is invested in making it a success. Homemade shredded hash browns, homemade hot sauce, engaged server and cook. I ve been exploring restaurants across the Lower mainland and this literally defines what a gem in the rough is.",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:19.347620",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 96,
            "total_number_of_photos_by_reviewer": 232,
            "reviewer_url": "https://www.google.com/maps/contrib/117785853501394221195/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1aTctakNnEAE",
            "reviewer_name": "JOEY Chu",
            "rating": 5,
            "review_text": "Like having meal  in time tunnel . 60 s classic pop created a vibe, homey cups, plates, forks and tea spoon like having meal at home",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:19.350948",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 35,
            "reviewer_url": "https://www.google.com/maps/contrib/116198522146393904263/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdlAzV21RRRAB",
            "reviewer_name": "Tim Ubial",
            "rating": 5,
            "review_text": "Great experience in a lovely place A good family place Excellent, personal service Soul food Took my 5-year-old son here for lunch one time and we had a great time. It was a weekday so we didnt have to wait (expect a queue during peak times). Once we got settled in, I enjoyed my coffee while chatting with my son. Service was quick and kind. We had food of the Chinese part of the menu which was delicious. After our meal, Richard came over to make sure my son and I were taken care of which was super thoughtful. This is a place you need go to at least once (or twice, or three times, ...).",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:19.354297",
            "response_from_owner_text": "Hi Tim, Thank you for a 5-star review. We truly appreciate it! Feeling the love and support!  Glad you enjoyed the food and experience.  We look forward to having you back soon!  :) Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:19.354297",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 80,
            "total_number_of_photos_by_reviewer": 67,
            "reviewer_url": "https://www.google.com/maps/contrib/111225612471312521539/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcWZxellREAE",
            "reviewer_name": "Danny Nguyen",
            "rating": 5,
            "review_text": "In case you needed to hear an echo of everyone else here, the hospitality of the staff here is on another level. Our first time there and you truly feel like youre just catching up with an old friend. In such a quirky place with ample amount of signage assuring you that youre in the right place and pointing you where to go. Head up a few stairs and turn the corner to be greeted by a neat little diner. The food was fantastic, extremely well portioned and priced! Definitely check it out, if not to at least say you had breakfast at a lumber yard!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:19.358250",
            "response_from_owner_text": "Hi Danny, Thanks for taking the time to write your review! We are definitely in a unique location and our culture is to treat our guest like family! We focus on fresh homemade food where you will feel right at home! Much appreciated for sharing your experience and we look forward to your next visit! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:19.358250",
            "review_likes_count": 20,
            "total_number_of_reviews_by_reviewer": 139,
            "total_number_of_photos_by_reviewer": 1107,
            "reviewer_url": "https://www.google.com/maps/contrib/111439567325909352430/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSX3FYQUx3EAE",
            "reviewer_name": "sylvie dennison",
            "rating": 5,
            "review_text": "Northern Cafe and Grill food was amazing, reasonably priced,  the staff when above and beyond the extra mile. My friend has Celiac and the serve accommodated her. Even asked about cross contamination. He said  I care about you  We were floored. To the male server God bless you  . Thank you Dai Lo. Vegetarian options: Was able to accommodated for my friend that has Celiac Diease. Dietary restrictions: Lots of veg options Kid-friendliness: Family friendly",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:19.361569",
            "response_from_owner_text": "Hi Sylvie Thank you for visiting and dining with us!! Thanks for taking time to leave this amazing review. We truly appreciate it! So glad you enjoyed the food and experience. - yes we do care about all our guests(our extended family) We look forward to having you back again soon! Richard and Raymond",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-05-01 02:07:19.361569",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 39,
            "total_number_of_photos_by_reviewer": 37,
            "reviewer_url": "https://www.google.com/maps/contrib/100272710735498263616/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdWU2YXdnRRAB",
            "reviewer_name": "Rose Fei Guo",
            "rating": 5,
            "review_text": "Lovely diner, very good quality food. Everything was tasty including coffee! Owner is friendly and service was great too. There are a lot of locals who come (they greeted the owner so thats my guess), return business is always a great sign   not just a fad, but solid food and lovely restaurant. For US travellers, no credit card or debit card accepted, you can pay with US dollar or Canadian dollar.  I would recommend getting some Canadian dollars with you when traveling in Vancouver to get the exchange discount ;)",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:19.364097",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 98,
            "total_number_of_photos_by_reviewer": 104,
            "reviewer_url": "https://www.google.com/maps/contrib/108368812001950343292/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbjhpVi1nRRAB",
            "reviewer_name": "Kristy Chen",
            "rating": 5,
            "review_text": "The food here is not bad, but not super amazing either. Although I personally enjoyed it as classic breakfast food and even though it s simple, everything pairs together perfectly. When you come here, it s definitely for the atmosphere and the amazing service. Would definitely recommend for the experience.",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:19.367024",
            "response_from_owner_text": "Hi Kristy, Thank you for taking the time to write this review. So glad you enjoyed the experience with us!!  We treat all our guests like family and so happy to hear you felt the love :). Hope to see you back again soon. Please take care! Richard and Raymondp",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2023-01-01 02:07:19.367024",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 494,
            "total_number_of_photos_by_reviewer": 2453,
            "reviewer_url": "https://www.google.com/maps/contrib/100864525554132402451/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNGJIODJRRRAB",
            "reviewer_name": "Desy Cheng",
            "rating": 5,
            "review_text": "Hole in the wall alert! Northern Cafe!!!! Inside a Lumberyard!! 5/5 When I saw on google that it had 4.9/5 stars with over 1000 reviews, I HAD to check this place out! It s a family-run lumberyard homestyle cafe and it did not dissapoint.  The service was excellent!  Mom and Pop cooking away in the kitchen and their 2 sons serving tables.  They took the time to chat with me, see where I was from, explain the menu, and tell me a brief history of the diner.  Most things are hand-made (as opposed to from frozen) and it was superb! 1. Pancakes They were light, fluffy, and slightly crispy.  Probably the best pancakes I ve had ever! 5/5 2. The Northern Deluxe Burger It was pretty good!  Not the best burger I ve ever had, but it definitely hit the spot!  My only suggestion would be add a bit more sauce or do something to it to give it that punch.  I added ketchup to mine. 4/5 3. Hand cut fries Technically this was not a dish, it was just a side to the burger.  But these fries were hand cut (as opposed to from frozen), and they were REALLY crispy!  Give it a few minutes to crisp up as opposed to right away when its fresh from the deep fryer. 5/5 4. Potato Salad Again, this was not a dish but a side to the burger.  I don t like potato salad really but this one was REALLY good!! 5/5 5. Potstickers Another hand-made item from mom!  Not the best I ve had but still pretty good and it definitely hit the spot! 4.5 I would DEFINITELY come back here again and again as I want to try their other menu items! Love where it s located and love how it s family owned and operated.  If you are ever in the area, GO HERE!  It s GOOOD!",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:19.369718",
            "response_from_owner_text": "Hi Desy, Amazing review and write up! We truly appreciate it! So glad you enjoyed your time with us. Love the content as well and video! We cant wait to have back again soon. Take care! :) Richard and Raymond",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2023-01-01 02:07:19.369718",
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 120,
            "total_number_of_photos_by_reviewer": 627,
            "reviewer_url": "https://www.google.com/maps/contrib/104357164439032139316/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCb2JhNGNREAE",
            "reviewer_name": "Duncan W",
            "rating": 5,
            "review_text": "Best greasy spoon around. So rustic. Ironically, not a level surface in the building, despite being built by a lumber shop back in its day. But that adds to the charm. Amazing food. Nothing fancy, just really good. Service is excellent. Prices are just ok, but it really is a destination eatery worth a visit.",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:19.372987",
            "response_from_owner_text": "Hi Duncan, Thank you for taking the time to write this amazing review! We truly appreciate it and glad to see you enjoyed the food and experience with us. We look forward to having you back again. Happy New Year to you and your loved ones! See you soon! Richard and Raymond",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-02-01 02:07:19.372987",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 28,
            "total_number_of_photos_by_reviewer": 20,
            "reviewer_url": "https://www.google.com/maps/contrib/110310713101932722533/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNG9Ta1lnEAE",
            "reviewer_name": "Peter Chung",
            "rating": 5,
            "review_text": "The food here was amazing but what was even better was the hospitality and service from Jimmy. Although this was my familys first time there (and not last time) Jimmy made us feel like family. Did I mention the food was amazing too?    If youre ever in the Vancouver area and need a great start to your day, this is the place!!!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:19.376482",
            "response_from_owner_text": "Hi Peter, You are amazing! Thanks for taking the time to write your review! Our culture is to treat our guest like family! We are glad you enjoyed your experience and we look forward to your next visit ! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:19.376482",
            "review_likes_count": 9,
            "total_number_of_reviews_by_reviewer": 134,
            "total_number_of_photos_by_reviewer": 553,
            "reviewer_url": "https://www.google.com/maps/contrib/112359643449090856439/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaGUzOFFREAE",
            "reviewer_name": "Vinz T",
            "rating": 5,
            "review_text": "This restaurant is a hidden gem in this industrial region. All the food is delicious, especially the hand-shredded hash. All the servers here are friendly and helpful, and most of them know Cantonese too. Just be aware that it does not accept credit cards here, but it is okay to pay by PayPal or even e-Transfer.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:19.970831",
            "response_from_owner_text": "HI Vinz, Thank you for taking the time to write this amazing review!! Our hand-shredded hash our loved by many and we are so happy you loved it too! We look forward to serving you again soon! :) Richard and Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:19.970831",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 109,
            "total_number_of_photos_by_reviewer": 1064,
            "reviewer_url": "https://www.google.com/maps/contrib/112711383764593887430/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSX1pXTVBREAE",
            "reviewer_name": "Ceecee Vang",
            "rating": 5,
            "review_text": "Great food and service. Definitely deserving of their great reviews. It s a Cute little mom and pop shop. There will be a wait so please prepare for that.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:19.974649",
            "response_from_owner_text": "Hi Ceecee, Thank you for visiting us and giving us an amazing review! We truly appreciate it! SO happy you enjoyed the food and experience and we look forward to your next visit! See you soon! Richard and Raymond",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-05-01 02:07:19.974649",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 166,
            "total_number_of_photos_by_reviewer": 631,
            "reviewer_url": "https://www.google.com/maps/contrib/106488132283275357626/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2Nmd2hnRRAB",
            "reviewer_name": "Pedro",
            "rating": 5,
            "review_text": "This is a fantastic place for breakfast or lunch. When you get here, if theres a wait, theyll take your name and mobile number to message you when your table is ready. The restaurant building is really old, it oozes character and Im sure there are many interesting stories from the many years its been in operation. Unfortunately the location wont be suitable for some people with disabilities that would struggle with stairs. Service was fantastic, Richard and the rest of the staff are super friendly - this is a very welcoming restaurant. I think the staff are a major reason this restaurant is great. Last but certainly not least, is the food. The choices are great, prices are reasonable, and everything is a classic in its own right. Although the restaurant was busy with some people waiting, it didnt take long to receive our food. We stuck with breakfast and I must say, it was satisfying. For my mom, she asked for eggs over medium and her reaction was, this is the first time a restaurant has made my eggs perfectly. Were looking forward to another visit sometime soon, well try some lunch options next time.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:19.978653",
            "response_from_owner_text": "Hi Pedro, Thank you so much for this glowing review. It was wonderful to have you and your family in yesterday. Glad you enjoyed the food and we made you feel like family! We hope to have you in soon again. Have a wonderful weekend and take care! Richard",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:19.978653",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 87,
            "total_number_of_photos_by_reviewer": 1707,
            "reviewer_url": "https://www.google.com/maps/contrib/104880762216135456280/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSamU2MVJnEAE",
            "reviewer_name": "Fedeline",
            "rating": 5,
            "review_text": "I ordered the fried chicken egg benny, swiss bacon mushroom burger and combo pancake. And I recommend the Fried Chicken Egg Benny!! The shredded hash is to die for. The eggs plus yolk on the plate tastes so goooooodd.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:19.982264",
            "response_from_owner_text": "Hi Fedeline, Thank you for visiting us and giving us an amazing review! We truly appreciate it and means this alot to us. SO happy you enjoyed the food and experience and we look forward to your next visit! See you soon! Richard and Raymond",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-05-01 02:07:19.982264",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 30,
            "total_number_of_photos_by_reviewer": 180,
            "reviewer_url": "https://www.google.com/maps/contrib/112905678320789284766/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteWViT2NnEAE",
            "reviewer_name": "Marybeth Yu",
            "rating": 5,
            "review_text": "Love the place! Nothing fancy, but with great food and warm and gentle family who runs the cafe. Its really a hidden gem, in case you have a long lay-over in vancouver, you could drop by and wont regret it.",
            "published_at": "11 months ago",
            "published_at_date": "2023-01-01 02:07:19.986214",
            "response_from_owner_text": "HI Marybeth, Thank you for taking the time to write this review. We truly appreciate it. So happy you enjoyed the food and experience. Now you are part of the family! :) We look forward to having you back again soon. Take care and stay warm! Richard and Raymond",
            "response_from_owner_ago": "11 months ago",
            "response_from_owner_date": "2023-01-01 02:07:19.986214",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 105,
            "total_number_of_photos_by_reviewer": 3374,
            "reviewer_url": "https://www.google.com/maps/contrib/101025516339216632422/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPN1kzRU1BEAE",
            "reviewer_name": "Matt Orr",
            "rating": 5,
            "review_text": "We got there right when it opened before it got busy. The owner came to chat with us and tell us his story. What an amazing experience, and delicious home cooked food. We will be back again for sure. It takes a little courage to get through the lumber yard without thinking you re in the wrong place. Keep going, it s well worth it.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:19.989918",
            "response_from_owner_text": "Hi Matt Thanks and much appreciated for sharing your experience! We are gald you had the courage to walk through the lumber yard! We hope to see you again! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:19.989918",
            "review_likes_count": 8,
            "total_number_of_reviews_by_reviewer": 8,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/100864260963938044962/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ek9tYVR3EAE",
            "reviewer_name": "Tim Chen",
            "rating": 5,
            "review_text": "2023: their food consistently heals the soul. Much love thanks Raymond. 2021: Hard nowadays to fine hearty and honest good food such as northern. Years I ve passed it by and didn t realize. Oh boy now I m worried about my waist line. Bravo Mah family.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:19.992828",
            "response_from_owner_text": "Hi Tim, Thanks and much appreciated for your review! We was definitely our pleasure! We are glad you found us and we look forward to seeing you again soon! Raymond",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:07:19.992828",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 59,
            "total_number_of_photos_by_reviewer": 235,
            "reviewer_url": "https://www.google.com/maps/contrib/109188803414923303101/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhaHJPTldREAE",
            "reviewer_name": "Angela C.",
            "rating": 5,
            "review_text": "Owners were incredibly friendly and passionate about everything they make in the house. My family had such a great chat with them. The service was exceptional and the breakfasts we had hit the spot. Pancake batter were whisked to ordered and the hashbrowns were nice and crispy. Also, their homemade hot sauce is to die for. This diner has been around since the 40s and is a must try hidden gem!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:07:19.995509",
            "response_from_owner_text": "Hi Angela, Thanks for the stars and for the feedback! Food is our passion and family is our inspiration...our culture is to treat our guest like family! Glad you enjoyed our pancakes and our homemade hot sauce! We look forward to your next visit! Raymond",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:07:19.995509",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 12,
            "total_number_of_photos_by_reviewer": 10,
            "reviewer_url": "https://www.google.com/maps/contrib/115171562362061472301/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdmJLOVNREAE",
            "reviewer_name": "Siu Hong Lum",
            "rating": 5,
            "review_text": "Its an interesting place to eat from. I was greeted with the scent of BBQ Pork being cooked. The atmosphere was cozy. The patriarch of the family greeted me in Cantonese when he brought our plates over. I found this amusing because his intuition took a chance on me with understanding.  He was also observant that I was a first time guest. The food devoured kept me full. However I promised to visit again so that I can try his Chinese cuisine and see if it can remind me of home.",
            "published_at": "7 months ago",
            "published_at_date": "2023-05-01 02:07:19.997766",
            "response_from_owner_text": "Hi Siu Hong Lum, Thank you for visiting us and giving us an amazing review! We truly appreciate it! SO happy you enjoyed the food and experience and we look forward to your next visit! See you soon! Richard and Raymond",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-05-01 02:07:19.997766",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 246,
            "total_number_of_photos_by_reviewer": 795,
            "reviewer_url": "https://www.google.com/maps/contrib/106660367210411191555/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNm9LaDVnRRAB",
            "reviewer_name": "Daniel Suzuki",
            "rating": 5,
            "review_text": "Super friendly and home like atmosphere. Not to mention the food was out of this world! I will definitely be back. Highly recommend! Food",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:20.000678",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 59,
            "total_number_of_photos_by_reviewer": 28,
            "reviewer_url": "https://www.google.com/maps/contrib/104865883996716552118/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdmFXME9REAE",
            "reviewer_name": "Joseph Flores",
            "rating": 5,
            "review_text": "I absolutely loved and enjoyed the food! They have great customer service paired with a homey atmosphere. The prices on the food are affordable and fair as well. All the reviews are genuine and real! If you havent tried this place yet I highly recommend it!",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:07:20.575883",
            "response_from_owner_text": "Hi Joseph, Thank you so much for taking the time to write this review! So thrilled to hear you enjoyed the food and experience - including feeling at home. We look forward to having you back again. See you soon! Richard and Raymond",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-03-01 02:07:20.575883",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 5,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/115938832735129680437/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoazZyOG1BRRAB",
            "reviewer_name": "Rediet Mulugeta",
            "rating": 5,
            "review_text": "We were lucky to be visiting on the first day of reopening - overheard someone local say that they close the cafe during the winter. The atmosphere is a cross between small town diner, a gas station stop (in a good way), your favorite Chinese restaurant. When you walk in, you definitely get the  when you re here, your family  vibe. We ordered the pancake combo plate with a side of hash and hand cut fries, and 6pc potstickers and coffee. Only regret was not getting 12pc potstickers cause it was delicious - definitely satisfied with everything. The staff is super friendly, hospitable. The praise, (literally posted from floor to ceiling around the cafe), for the food and service is well deserved. There will be a wait (ours was about 35-40min) but it s totally worth it. For international folks   they accept cash USD (no international debit/credit). We can t wait to visit again!",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:07:20.578591",
            "response_from_owner_text": "Hi Rediet, Thank you for taking the time to leave this amazing review. So happy you enjoyed the food and experience including feeling like you are the part of the family - you are!! :) We hope you can try our potstickers next time. We look forward to having you back again soon. Richard and Raymond",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 02:07:20.578591",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 5,
            "reviewer_url": "https://www.google.com/maps/contrib/115874393489989367520/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSci1YOGR3EAE",
            "reviewer_name": "James Lau",
            "rating": 5,
            "review_text": "Great food and friendly service. We live this place! No wonder it s rated as the top restaurant in Canada by Yelp!",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:20.580867",
            "response_from_owner_text": "Hi James, Thanks for taking the time to write this review and glad your friends and brother enjoyed the time with us.  - feeling the love!  Hope you guys had a fun at the Marathon! See you soon! Richard and Raymond",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-06-01 02:07:20.580867",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 40,
            "total_number_of_photos_by_reviewer": 24,
            "reviewer_url": "https://www.google.com/maps/contrib/116278692658123543097/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeXRhb3ZnRRAB",
            "reviewer_name": "cece",
            "rating": 5,
            "review_text": "Love the experience, friendly staff (family owned and run).  The food was amazing and highly recommend.  Be prepared to wait in line for a table",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:07:20.583490",
            "response_from_owner_text": "Hi Cece Thank you for taking the time to post the this great review and the amazing photos! We truly appreciate it! So glad to hear you enjoyed the food and experience! We look forward to having you back again soon! Richard and Raymond",
            "response_from_owner_ago": "7 months ago",
            "response_from_owner_date": "2023-05-01 02:07:20.583490",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 126,
            "total_number_of_photos_by_reviewer": 463,
            "reviewer_url": "https://www.google.com/maps/contrib/116406665718540129808/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eUpTZnVBRRAB",
            "reviewer_name": "J C",
            "rating": 5,
            "review_text": "Very clean and well kept hole in the wall restaurant, it feels like an old family style diner. The customer service is outstanding. As a local, my partner and I have a great time here every time so if youre tourist def check it out!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:20.586210",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 43,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/102051310651644667974/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNlpfLXlBRRAB",
            "reviewer_name": "Mitchell  MaravillosO  Undurraga",
            "rating": 5,
            "review_text": "Though it may not look like much and its location is unique, this family run diner is a staple breakfast/lunch spot for those looking for a nostalgic and memorable experience. The food is delicious and the service is great. Love this place!",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:20.589057",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 67,
            "total_number_of_photos_by_reviewer": 18,
            "reviewer_url": "https://www.google.com/maps/contrib/105048858001770884500/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbzdXSmJnEAE",
            "reviewer_name": "Andrew Pannu",
            "rating": 5,
            "review_text": "This is the second time I have visited this fantastic cafe, even the space is limited but I like it because it s a cozy place to dine in. The owner is very nice to the customers, they care for the food & keep the restaurant very clean. When I enter the dining area, he ask for the vaccine card & check the ID, which means this cafe keeps the proper procedure. This time I ordered the steak & egg breakfast, the steak is rare which I ordered is perfectly cooked, also with the poach eggs and side hollandaise sauce, very tasty. The white toasts and the hash browns are crispy and they also come with a macaroni salad which is yummy too. Compare to the last time I have a deluxe burger which is fabulous, but my wife said the wonton is so so, (the owner told us that he used the best quality pork that s why made the wonton not tender), I understand not every good things come together will be the best. Overall the quality & the quantity are well balanced, I enjoy the music that they played which is around 50  & 60 , I like their food and also the atmosphere of this small cafe, I will come back for sure.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:20.591511",
            "response_from_owner_text": "Hi Andrew, Thanks for taking the time to write your review! We are glad you enjoyed our steak and eggs and our burger! And thanks for the feedback on our wontons! We look forward to your next visit! Much appreciated! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:20.591511",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 74,
            "total_number_of_photos_by_reviewer": 677,
            "reviewer_url": "https://www.google.com/maps/contrib/117134825141897014452/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2M182S25RRRAB",
            "reviewer_name": "Kelvin Fong",
            "rating": 5,
            "review_text": "When you come in, you re treated like family . This outstanding family operated establishment is located in a old cafeteria built in 1949. 90% of their menu items are made in house. Hand made fries and shredded hash browns. Chinese dumplings. Pancake batter made to order. The friendliness is genuine and the food is made with pride and love. Comfort food for western and Asian gastronome.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:07:20.593686",
            "response_from_owner_text": "Hi Kelvin, Thanks and much appreciated for your review! We are glad you enjoyed your experience! And yes we make 90% of the menu in house and we treat our guest like family! We have lots of menu items for you to try! We look forward to your next visit! Raymond",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:07:20.593686",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 980,
            "total_number_of_photos_by_reviewer": 3539,
            "reviewer_url": "https://www.google.com/maps/contrib/108107431521181394886/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNllLV1JBEAE",
            "reviewer_name": "David Griffiths",
            "rating": 5,
            "review_text": "Awesome comfort food breakfasts!  Theyre awesome, definitely the best omelette Ive had in months, loaded with veggies and cooked perfectly. Still the best hash browns in the city and a little side of potato salad caps off the entire meal.  Highly recommended!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:20.596394",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 16,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/114190512133219064917/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMnByaVFnEAE",
            "reviewer_name": "Vi  LiVi  Li",
            "rating": 5,
            "review_text": "Cool dinner above lumber yard! The AAA burger, spicy chicken burger and the Philly steak sandwich were what my daughters and I ordered. I got to have a tiny bit of their lunch and have to say I really love my spicy chicken burger as the sauce was mayo with chilly & little pickle bits - very nice. AAA was a nice burger and juicy. Philly I tried just tiny bit of beef was okay for me, but my youngest daughter liked it. The family behind the counter were busy but jovial! Nice cooking, chefs!",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:20.599095",
            "response_from_owner_text": "Hi Vi, Thank you so much for this amazing review. We truly appreciate it. So happy your family enjoyed the food and experience!! Our burgers are all homemade with the best quality AAA beef - so juicy and succulent. We cannot wait to have you back. Have a great long weekend!!! Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:20.599095",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 132,
            "total_number_of_photos_by_reviewer": 284,
            "reviewer_url": "https://www.google.com/maps/contrib/106728907221174115515/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPZzlqQWJREAE",
            "reviewer_name": "kawaii hatchiko",
            "rating": 5,
            "review_text": "Yummy breakfast and a variety of other options. Seems to be a family business. Warm and inviting. Not hipster. You will not be coming here for the decor but for the food and customer service. I love supporting small family businesses!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:21.242416",
            "response_from_owner_text": "Hi kawaii, Thanks and much appreciated for sharing your experience and for your support! We are family own and operated and our culture is to treat our guest like family! We hope to see you again! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:21.242416",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 397,
            "total_number_of_photos_by_reviewer": 3395,
            "reviewer_url": "https://www.google.com/maps/contrib/117679545302778828296/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXX1pLZEh3EAE",
            "reviewer_name": "I F (Ms. Berry)",
            "rating": 5,
            "review_text": "Don t let the outside scare you away.  This is definitely a hole in the wall kind of diner.  The inside is really clean.  The food is pretty decent.  They make their own womtons!  This diner offers western brunch and Chinese food.  Family operated business and super friendly owner. Will definitely return to try the Philly steak and the clubhouse sandwiches.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:21.247030",
            "response_from_owner_text": "Hi I F, Thanks for not judging its book by its cover! And yes we are definitely a hole in a wall! We make 90% of our menu all in house! Thanks and much appreciated for sharing your experience and we look forward to your next visit! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:21.247030",
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 22,
            "total_number_of_photos_by_reviewer": 46,
            "reviewer_url": "https://www.google.com/maps/contrib/111945280714593698875/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOE1iRzBBRRAB",
            "reviewer_name": "Raymond C",
            "rating": 5,
            "review_text": "Very friendly service, huge portion of food at good price.",
            "published_at": "3 months ago",
            "published_at_date": "2023-09-01 02:07:21.250650",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 453,
            "total_number_of_photos_by_reviewer": 10134,
            "reviewer_url": "https://www.google.com/maps/contrib/108415736006126843895/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaajd2UTlRRRAB",
            "reviewer_name": "Victor Dodge",
            "rating": 5,
            "review_text": "Definitely my kind of place to eat, is a little bit different than your typical eatery but is a laid back diner accompanied with diner type vibes kinda like from the 90s movies. Mostly brunch and comfort Chinese food dont expect top of the line. As for the service, You will not find any greater service in Vancouver.",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:21.254305",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 55,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/108675336456277056501/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ODhyV3pnRRAB",
            "reviewer_name": "Tony Yu Real Estate",
            "rating": 5,
            "review_text": "I discovered Northern cafe right before the pandemic in 2019. Ive been a regular ever since! They serve classic breakfast options and also have great asian dishes like their homemade wontons and pot stickers. I recommend their homemade hot sauce when you come. If youre looking for a simple, but flavourful meal where youre treated like family, this is the place to be! Thank you for your warm hospitality everytime when we come. :)",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:21.256964",
            "response_from_owner_text": "HI Tony Thank you so much for taking the time to write this wonderful review. We truly appreciate it and feel the love/support. Glad you enjoyed the food and experience - and most of all you felt like family here. Also happy to hear you enjoyed our homemade hotsauce. Not sure if you know but we also sell that by the jar so you can enjoy it anytime - its a great compliment to any dishes! We look forward to having you back again. See you soon! Richard and Raymond",
            "response_from_owner_ago": "6 months ago",
            "response_from_owner_date": "2023-06-01 02:07:21.256964",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 17,
            "total_number_of_photos_by_reviewer": 23,
            "reviewer_url": "https://www.google.com/maps/contrib/102753324459878048536/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMC1tODRBRRAB",
            "reviewer_name": "Travis N",
            "rating": 5,
            "review_text": "Wife and I recently visited this place. The reviews are definitely true. The food was really good. We really loved the hash browns there. Service wise, it was top notch. Its on the top of my list if anyone asks for recommendations for a brunch/breakfast place.",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:21.260196",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/111784165976878142235/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNld2FMdDd3RRAB",
            "reviewer_name": "Aaron S",
            "rating": 5,
            "review_text": "This place is probably one of the best hidden breakfast spots in all of Vancouver! Everything was excellent, the poached eggs were perfectly done and the sausage and bacon were fantastic as well. To top it off the owner and master chef includes a small dish of his own homemade egg salad which was phenomenal. Its so cool that this cafe is quite literally hidden in a lumber yard, if you have the opportunity to go you gotta check this place out! It will be my new go to spot when visiting Vancouver. Parking: Approximately 4 spots in front of the cafe and extra street parking just outside the lumber yard.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:21.263390",
            "response_from_owner_text": "Hi Aaron, Truly appreciate you taking time to give us a great review and 5-star rating! We humbled by this! Delighted to hear you enjoyed the experience and the food! Yes - Everything on our menu is made from scratch including the egg salad! It s a favourite for many guests! Thank you again and we are looking forward to serving you again! Richard and Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:21.263390",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 209,
            "total_number_of_photos_by_reviewer": 123,
            "reviewer_url": "https://www.google.com/maps/contrib/117708436694586074157/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZy1qVzJnRRAB",
            "reviewer_name": "Brus Osmd",
            "rating": 5,
            "review_text": "This is the best out of the way diner in Vancouver!! Ignore the lumberyard as you walk up the narrow stairs, down the commercial hallway, its all worth it. Opening up to a cozy little diner you are immediately taken in with the warmth and home feel of this gem, the service from the start is attentive and warm, the food is easily a match to the service, tasty, not greasy and above all, everything tastes and looks handmade with care. Highly recommend this best kept secret!!!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:21.266397",
            "response_from_owner_text": "Hi Brus, Thank you for taking the time to write this amazing review! We are truly humbled and appreciate it! We welcome all guests like family and we are so happy you feel the warmth and enjoyed the food and experience with us. We cannot wait to have you back again soon! Until then, please take care! Richard and Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:21.266397",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 3,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/102024514459075063224/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bzVMZEx3EAE",
            "reviewer_name": "Denny Hui",
            "rating": 5,
            "review_text": "First time customers  and we now know why this is a hidden  gem. First, place is located within a wooden storage yard. And decor isnt  anything special but really reflects east side! My sons are huge pancake fans, so always hard finding good tasty, fluffy pancakes at an affordable  price. This place has it. I ordered the Blueberry and Chocolate  Chip pancakes. Both were fluffy and moist. Veggie eggs benny and cheese omelett was also good. I ordered the French  Toast and it was OK. Wished the slice of bread used for the French toast was thicker. Pork sausage was nice and plump and bacon cooked just right. Well  definitely be keeping this place on our list of go to places! Well  try dining in next time. Cost for the 5 dishes was $63. Very affordable compared to other breakfast places where Id be looking at closer to $80.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:07:21.269442",
            "response_from_owner_text": "Hi Denny, Thanks for taking the time to write your review! We are glad your son enjoyed our whipped to batter fluffy pancakes! We will definitely look into and try a different bread for our french toast! Thanks for the feedback! We are glad you enjoyed your experience and we look forward to your next visit! Much appreciated! Raymond",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:07:21.269442",
            "review_likes_count": 5,
            "total_number_of_reviews_by_reviewer": 149,
            "total_number_of_photos_by_reviewer": 1359,
            "reviewer_url": "https://www.google.com/maps/contrib/117223317977698900129/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMDZtbF9BRRAB",
            "reviewer_name": "Clinton Large",
            "rating": 5,
            "review_text": "We love this place! The food was amazing. Richard, our server, was so kind and explained how it s a family owned business. I could eat 100 of his mom s pot stickers. It was worth the wait and the hype! For ambiance, it s a classic diner style that s really comforting for breakfast. We will be coming back plenty!",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:07:21.272204",
            "response_from_owner_text": "Hi Clinton, Thank you for leaving a glowing review here and on yelp! We truly appreciate it. So happy you guys enjoyed everything here. I will share your comments about the potstickers with my mom.  - this will put a smile on her face. :) Appreciate the support and love! Looking forward to seeing you back soon. Take care and enjoy your weekend! Richard and Raymond",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-03-01 02:07:21.272204",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 36,
            "total_number_of_photos_by_reviewer": 36,
            "reviewer_url": "https://www.google.com/maps/contrib/108095416557255257981/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMW9tRWV3EAE",
            "reviewer_name": "Paul Prussner",
            "rating": 5,
            "review_text": "This our second visit since the beginning of the pandemic. First one was for breakfast (awesome), this visit to try the Asian lunch quisine.  You can tell they handmade certain aspects like the noodles and wonton. Definitely will come again to try the burgers !",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:07:21.835740",
            "response_from_owner_text": "Hi Paul, Thank you for visiting us again! So glad you tried our asian dishes and loved it! Our wontons are made with love and glad you tasted it! :) Our burger patties are also all made in-house and we cant wait to have you back. Appreciate you taking the time to write this amazing review! Richard and Raymond",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-02-01 02:07:21.835740",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 66,
            "total_number_of_photos_by_reviewer": 2806,
            "reviewer_url": "https://www.google.com/maps/contrib/107477464724531531458/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNockx6aEZ3EAE",
            "reviewer_name": "Hayley V",
            "rating": 5,
            "review_text": "Heard lots of good things about this place and finally gave it a try. Very pleased with the everything! Probably the best pork potstickers I ve had in a long time. Also loved the ham eggs benny, and the hash browns that came with them were incredible. Hoping to come back soon!",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:07:21.839438",
            "response_from_owner_text": "HI Hayley, Thank you for taking the time to visit us a share this glowing review! We truly appreciate it! So happy you enjoyed the food and experience. Our pork potstickers are all made in-house and great to hear you loved it - including our breakfast menu! We look forward to serving you again! See you soon! Richard and Raymond",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-03-01 02:07:21.839438",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 160,
            "total_number_of_photos_by_reviewer": 209,
            "reviewer_url": "https://www.google.com/maps/contrib/102978410836361985779/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcXVqa3NRRRAB",
            "reviewer_name": "Vicky C",
            "rating": 5,
            "review_text": "If I could live next to Northern Cafe just to eat their breakfast every day, I would. Honestly my go to for a wholesome meal. Their pot stickers are so good, and the eggs are always cooked to perfection. The breakfast sausages are my favourite, and I always get an extra side order of it (sometimes a double). Portion sizes are great, so you will always feel full after a meal. The owners are the best. They remember you even if you went only once before! It can get pretty busy, so try going before the rush, otherwise you could be waiting a while. I love eating here so much, my phones lock screen was a photo of their breakfast for 2 years. Its not just about the food, but the overall experience!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:21.842353",
            "response_from_owner_text": "Hi Vicky, Thanks and much appreciated for sharing your experience! Glad you enjoyed our homemade potstickers! We treat our guest like family! We hope to see you again!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:21.842353",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 52,
            "total_number_of_photos_by_reviewer": 89,
            "reviewer_url": "https://www.google.com/maps/contrib/118324202069039850643/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMC1lYWRnEAE",
            "reviewer_name": "Jomar Layco",
            "rating": 5,
            "review_text": "Definitely the best home style breakfast I ve ever had at this cafe. The server was very friendly and welcoming, you felt like you were part of the family when you went in. I would definitely recommend this spot to anyone.",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:07:21.844576",
            "response_from_owner_text": "Hi Jomar, Thank you for leaving an amazing review here. We truly appreciate it. Glad you enjoyed the food and experience - you are part of the family! :) We look forward to having you back soon! Richard and Raymond",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 02:07:21.844576",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 2,
            "total_number_of_photos_by_reviewer": 2,
            "reviewer_url": "https://www.google.com/maps/contrib/116090607759634204735/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQya0l5bldREAE",
            "reviewer_name": "Jessica Stotts",
            "rating": 5,
            "review_text": "OK, so I was at Kaltire as I just dropped off my car for the tires to be changed. So I googled where to go for breakfast. I saw Dennys was close but I was hoping for something better. And then I found this restaurant. It had the best reviews and pictures, so I thought wed give it a go. When we arrived we were very confused as it seemed it was inside a lumber yard. But I saw the entrance and we went up. It was so cute and cozy with the big red poofy booth seats. A true diner. Even diner 50s music was playing. We sat down and was greeted by the Raymond who took our order. From the minute we walked in we felt very welcome. Raymond chatted with us and everyone that came in. Jimmy served our food. And also made us feel welcome. He also chatted with us on our way out to make sure we enjoyed our meal and visit. I seriously cant believe I lucked out to find such a diamond in the rough food joint. Next time we go we need to check our their Asian menu as its all homemade goodness. Family recipes are the best! Thank you Raymond and Jimmy for such a great experience and delicious breakfast. We will definitely be back soon!",
            "published_at": "8 months ago",
            "published_at_date": "2023-04-01 02:07:21.847084",
            "response_from_owner_text": "Hi Jessica, Thanks for taking the time to write your review! Gald you found us! We are definitely in a unique location for a restaurant! Yes we are family owned and operated and we are lucky you found us! We make 90% of the menu all in house! We look forward to you coming back to try our asian food! Much appreciated for sharing your experience! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:21.847084",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 100,
            "total_number_of_photos_by_reviewer": 28,
            "reviewer_url": "https://www.google.com/maps/contrib/103980035805104742004/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb1lIUzN3RRAB",
            "reviewer_name": "Jeremy Wong",
            "rating": 5,
            "review_text": "Great service. Unpretentious, honest and delicious food. Simply a classic. We are so glad we found this throwback diner in the outskirts of South Vancouver. Classic diner menu combined with some Asian flavours. We varied our order, starting with house made wontons and spring roll for our appetizer and shard the big 3 breakfast. All items were nicely done and delicious. The service was friendly and attentive. We look to return and try other items on their menu - hopefully well luck out again and come on a less busy day. Give this wonderful diner a try and you are guaranteed not to be disappointed.",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:07:21.850824",
            "response_from_owner_text": "Hi Jeremy, Thanks for taking the time to write your review! We are glad that you found us! Our service culture is to treat our guest like family! Happy you enjoyed our hand made wontons and spring rolls! We look forward to seeing you again! Raymond",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:07:21.850824",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 109,
            "total_number_of_photos_by_reviewer": 217,
            "reviewer_url": "https://www.google.com/maps/contrib/107082625710096977233/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabjRMcUZ3EAE",
            "reviewer_name": "Nicole Lo",
            "rating": 5,
            "review_text": "The food and service were amazing! the servers and the chef also were really nice and kept checking on us. All the food were amazingly delicious. we ordered smoky sausage, ham egg benny and steak burger. hash brown was super crispy, steak burger was juicy and not too salty. The egg benny was the best I had in Vancouver. Everything is perfect. Will definitely come back again",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:21.853370",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 9,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/104467688557833500611/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXd2ZxTG9RRRAB",
            "reviewer_name": "Marian Tolentino",
            "rating": 5,
            "review_text": "Fluffiest pancakes ever! You cant leave this place without trying the pancakes. I love how simple the food is but the quality is top notch! Well definitely come back to work our way around the whole menu. We had a very pleasant experience. Thanks to Chef Raymond and his family for making us feel at home!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:21.855803",
            "response_from_owner_text": "Hi Marian, Thanks and much appreciated for sharing your experience! Glad you enjoyed our pancakes and our services! Our culture is to treat our guest like family! We hope to see you again! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:21.855803",
            "review_likes_count": 6,
            "total_number_of_reviews_by_reviewer": 1,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/105742921494761688853/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1N2JDZjRBRRAB",
            "reviewer_name": "S. Fermo",
            "rating": 5,
            "review_text": "Best service ever. It may not be topnotch 5star restaurant but this place is the best place to bring your family and friends for breakfast. The ambiance of this place brings you back in the late 80s to 90s vibe. Definitely coming back here again.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:21.857996",
            "response_from_owner_text": "Hi S. Fermo, Thank you for the kind words - we love hearing it! We can t wait to have you back for more good eats and experiences! :) See you soon again!",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:21.857996",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 21,
            "total_number_of_photos_by_reviewer": 26,
            "reviewer_url": "https://www.google.com/maps/contrib/105056348008121274148/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOHN5UU13EAE",
            "reviewer_name": "MG_FXV",
            "rating": 5,
            "review_text": "Hidden gem. Great service... great staff... delicious food. What more could you ask for? No wonder this place is a 4.9 rating. Truly one of a kind. Nothing fancy about this place. We will be back definitely.",
            "published_at": "6 months ago",
            "published_at_date": "2023-06-01 02:07:21.860616",
            "response_from_owner_text": "Hi Mitch, Thanks and much appreciated for your review and for your support! We are glad you enjoyed your experience! We make 90% of the menu all in house and we look forward to your next visit! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:21.860616",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 167,
            "total_number_of_photos_by_reviewer": 287,
            "reviewer_url": "https://www.google.com/maps/contrib/117058940375063997596/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdGVPb2xBRRAB",
            "reviewer_name": "Matt Bartels",
            "rating": 5,
            "review_text": "The food is excellent the bacon and sausages are just right. You know the kinds you think about after eating them. The poached eggs come out perfect and the service is fast even when its full. A wait is about 5 to 15 minutes. If you have to wait. And the staff is great to. They remember your name when you get asked for your phone number for a text message when your table is ready.    It is also not far from the vancouver airport. And I highly recommend it. And its in a lumber yard to which has good prices to. Keep up the great work Northern Cafe and I will definitely be visiting again.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:22.450755",
            "response_from_owner_text": "Hi Matt, Thank you for a kind review. We truly appreciate it! Feeling the love and support!  Glad you enjoyed the great food and experience.  We look forward to having you back soon!  :) Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:22.450755",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 48,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/114353116079616612792/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM0x1ZG53RRAB",
            "reviewer_name": "Geoffrey Chan",
            "rating": 5,
            "review_text": "Great for the price. First time visiting this place. I would say that the food rivals places that might charge double for the same thing. Coffee could use a little work. Service is prompt, polite, attentive and friendly. It does get very busy there. I saw some bigger tables that had 1 hour waits but that isnt a fault of the restaurant. I would say the atmosphere really feels like a diner but dont expect it to be incredibly comfortable.  If you are okay with a hole in the wall place, this is it. I would certainly go back. It is a shame that they close at 3 but I suppose most of their clientele is breakfast and lunch.",
            "published_at": "4 months ago",
            "published_at_date": "2023-08-01 02:07:22.454862",
            "response_from_owner_text": "Hi Geoffrey, Thank you for taking the time to give us a glowing review. We truly appreciate it. So wonderful to hear you enjoyed the food and experience! We look forward to your next visit. Have a good weekend! Richard and Raymond",
            "response_from_owner_ago": "4 months ago",
            "response_from_owner_date": "2023-08-01 02:07:22.454862",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 34,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/112408571026690003087/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad09qaUF3EAE",
            "reviewer_name": "sunghj11",
            "rating": 5,
            "review_text": "Just had their Chowmein and garlic pork combo. They made a mistake on my order and gave me sweet and sour. The waiter politely let me know of the mistake and gave me a small side of garlic pork to try out as well. I feel like thats going the extra mile and I can see why this place is so well loved. You could tell the meat was freshly made and they fried it fresh as well. The batter was still crispy under the sweet and sour sauce which is not that common as usually restaurants keep it premade or sauce it in advance. Chowmein was nicely seasoned as well. It definitely is a hidden gem and they have a old diner feel to it. I will of course be coming here again with friends!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:22.458678",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 4,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/103395875994499207783/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNTZ2SnJRRRAB",
            "reviewer_name": "Madison Dapp",
            "rating": 5,
            "review_text": "Perfect place for comfort food, home cooking and amazing service. Raymond creates a great environment to relax and enjoy and feel at home. Perfect example of  don t judge a book by its cover.  Have come here every Tuesday since the first time we tried it and have always been happy. Just a heads up: cash and debit only :)",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:22.461852",
            "response_from_owner_text": "Hi Madison, Thanks for sharing your review! Yes definitely dont judge its book by its cover! Lol...we are so glad that you found us and that you enjoyed your experience! Our culture is to treat our guest like family where you will feel right at home! We look forward to your next visit! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:22.461852",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 3,
            "reviewer_url": "https://www.google.com/maps/contrib/103850937698299714919/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlei03M3VnRRAB",
            "reviewer_name": "Erik Leong (gd6noob)",
            "rating": 5,
            "review_text": "Superior Service. Makes you feel like you eat at home, after waking up and making your way to the table and ready to eat, nothing fancy. The food tastes good but its the level of service that puts it over the top. Totally recommend Northern Cafe, especially if you have never been.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:22.465009",
            "response_from_owner_text": "Hi Erik - thank you for taking the time and posting this kind review! - we are humbled and truly appreciate it! Home is where the heart is so Its great that you feel like you are at home with us - our house is your house! We are so happy you enjoyed everything! We can t wait to have you back again :) Richard and Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:22.465009",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 91,
            "total_number_of_photos_by_reviewer": 316,
            "reviewer_url": "https://www.google.com/maps/contrib/118047039132910313915/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXazdmbHZRRRAB",
            "reviewer_name": "Harmoni",
            "rating": 5,
            "review_text": "Off the beaten path, word of mouth, stuck in the 50s kind of place. Found Northern Cafe while doing a Google Search of Top Rated Breakfast, so of course we had to go to see what the hype was about! It shares a space with a lumber yard so its easy to miss, unless you know to look for the handwritten signs. When we arrived (on a Saturday at 9:30am) it was full so we put our name and number on the list (2 other parties were ahead of us). Waited about 20 minutes then receivef a phone call stating our table was available. Ordered the Ham and Egg Benny, Meat Lovers Omelette and Pancake Combo. Well be back to try the Chinese Food!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:22.468756",
            "response_from_owner_text": "Hi Harmoni, Thanks and much appreciated for sharing your feedback! We are definitely a restaurant hiddened in a funky place and glad you enjoyed your experience! We hope to see you again soon to try our housemade chinese food! Much appreciated! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:22.468756",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 89,
            "total_number_of_photos_by_reviewer": 225,
            "reviewer_url": "https://www.google.com/maps/contrib/105198428546891344440/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaWRLMmN3EAE",
            "reviewer_name": "OLOLT",
            "rating": 5,
            "review_text": "I came here for brunch with my friend and I told her that this hidden Vancouver restaurant is one of the most highly rated restaurants in Canada. The food and service were excellent and the atmosphere was amazing",
            "published_at": "9 months ago",
            "published_at_date": "2023-03-01 02:07:22.471491",
            "response_from_owner_text": "HI OLOLT, Thank you for leaving an amazing review here. We truly appreciate it. Glad you enjoyed the food and experience! We look forward to serving you again soon! Richard and Raymond",
            "response_from_owner_ago": "8 months ago",
            "response_from_owner_date": "2023-04-01 02:07:22.471491",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 59,
            "total_number_of_photos_by_reviewer": 3541,
            "reviewer_url": "https://www.google.com/maps/contrib/100550718340745426054/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCa19TaHNBRRAB",
            "reviewer_name": "A W",
            "rating": 5,
            "review_text": "This cafe takes you back in time while dining in. Great selection on the menu. This cafe is becoming a popular spot. Must experience for yourself.",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:07:22.474406",
            "response_from_owner_text": "Hi AW, Thank you for taking the time to write this review and sharing this great photos. Glad you enjoyed the experience! :) We cant wait to have you back again soon. Please take care! Richard and Raymond",
            "response_from_owner_ago": "9 months ago",
            "response_from_owner_date": "2023-03-01 02:07:22.474406",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 7,
            "total_number_of_photos_by_reviewer": 7,
            "reviewer_url": "https://www.google.com/maps/contrib/112246307636888247227/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtb2VIMTlRRRAB",
            "reviewer_name": "C. Pine",
            "rating": 5,
            "review_text": "Discovered this little hidden hole-in-the-wall cafe (flashback to the 70s) while in search of breakfast and what a delightful surprise!  As we walked up a set of steep stairs to the 2nd floor with signs all around pointing to the Northern Cafe, situated in the most obscure location amongst lumber suppliers, we were greeted instantly by a very friendly man (presumably the owner) who took time to share the things that make this place special.  And indeed it was. The place is unpretentious and wonky but cozy, the menu offers basic breakfast (eggs, bacon pancakes) and lunch (burgers, poutine) along with some Asian staples (wonton noodle soup, chow mein, curries). Not fancy but just a good solid meal.  What makes it special is that they make their own ground beef patties, pork wontons, shredded potatoes for the hash browns and even the chili sauce is their own.  As if that werent enough, the price is ridiculously reasonable.  Love love the place. Excellent service.  Will definitely be back.  $",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:22.477623",
            "response_from_owner_text": "Hi Cedar, Thanks for taking the time to write your review! We are glad you discovered us and that you enjoyed your experience with us! We make 90% of our menu in house and we look forward to you coming back to try other menu items! Much appreciated! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:22.477623",
            "review_likes_count": 5,
            "total_number_of_reviews_by_reviewer": 443,
            "total_number_of_photos_by_reviewer": 510,
            "reviewer_url": "https://www.google.com/maps/contrib/113830844586485081006/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMXJHZFV3EAE",
            "reviewer_name": "Ron Kurian Roy",
            "rating": 5,
            "review_text": "Whenever I visit the place, I am always greeted with the best service from the people working there. However, I have noticed a small drop in the quality of food. But overall I would recommend the place to everyone.",
            "published_at": "10 months ago",
            "published_at_date": "2023-02-01 02:07:22.479998",
            "response_from_owner_text": "Hello Ron - Thank you so much for giving us a 5-star review and sharing these amazing photos! We really appreciate feedback and love to hear your experience so we can improve internally. Please do send us an email where we can discuss further at northerncafeandgrill@outlook.com, if possible. Again, appreciate the support and love as always. Richard and Raymond",
            "response_from_owner_ago": "10 months ago",
            "response_from_owner_date": "2023-02-01 02:07:22.479998",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 187,
            "total_number_of_photos_by_reviewer": 214,
            "reviewer_url": "https://www.google.com/maps/contrib/111322771774166150287/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbk82RmZnEAE",
            "reviewer_name": "Tia T",
            "rating": 5,
            "review_text": "Im never gonna get tired of the food in this place!   From the hand pressed beef patty burger, Northern Deluxe to the pot stickers,  its all delicious. My cravings have been calling for the sweet & sour pork lately and this cafe never fails to satisfy. Highly recommended if youre looking for friendly services, upbeat & cozy atmosphere with good vibes and delicious food!",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:23.129858",
            "response_from_owner_text": "Hi Tia, Thank you for the glowing review. We truly appreciate it! Feeling the love and support!  Glad you enjoyed the great food and experience.  We look forward to having you back soon!  :) Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:23.129858",
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 6,
            "total_number_of_photos_by_reviewer": 1,
            "reviewer_url": "https://www.google.com/maps/contrib/110727679173604962638/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c0xHeDFBRRAB",
            "reviewer_name": "Aom Hildebrand",
            "rating": 5,
            "review_text": "David Y said you can not judge a book by its cover, so true indeed!!! We went to Simply West Coast to order our seafoods but got hungry so they recommended us to try this restaurant. When we saw from outside, we were kinda ummm not sure if we will walk up there. But right after we were entering the restaurant, the greeting and smiling from people inside and everybody made us wanted to sit right away. What a warm welcome! I saw the foods made me drooling.. hehehe.. And yes, everything were delicious.. We all cant stopped eating, so delicious, big portion, reasonable price. Do not mentioned about service, beyond expected. Cant wait to go back again! Really miss your wonton soup, yummm!!",
            "published_at": "2 years ago",
            "published_at_date": "2021-12-01 02:07:23.133888",
            "response_from_owner_text": "Hi Aom, Thanks for taking the time to write your review! And yes thank you for not judging its book by its cover! We beleive in giving good value for our services and we treat our guest like family! We look forward to your next visit  and we save you some of our handmade wonton soup! Raymond",
            "response_from_owner_ago": "2 years ago",
            "response_from_owner_date": "2021-12-01 02:07:23.133888",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 509,
            "total_number_of_photos_by_reviewer": 16474,
            "reviewer_url": "https://www.google.com/maps/contrib/114803780310663344351/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeWYyS2xBRRAB",
            "reviewer_name": "Jared Wong",
            "rating": 5,
            "review_text": "Great place for a quick breakfast or take out.  Friendly staff from  Richard and his brother forgot his name - kind chef with dope portrait tattios , their dad and the entire team. Quick and fast and reasonable. Gives you diners vibes! South van gem",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:23.137515",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 18,
            "total_number_of_photos_by_reviewer": 4,
            "reviewer_url": "https://www.google.com/maps/contrib/106564903277869789194/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdGVhcUtREAE",
            "reviewer_name": "Sean G",
            "rating": 5,
            "review_text": "After reading the reviews I went in with some high expectations, and still, my expectations were blown out of the water. The portion sizes are massive, I could have gotten away with skipping dinner the night before  :) Not only do they have quantity but they have quality as well, the food was delicious and fresh (I recommend the butter milk pancakes). The staff are welcoming and accommodating, and they go out of their way to make you feel comfortable. Great option for a delicious, affordable breakfast!!",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:23.140756",
            "response_from_owner_text": "Hi Sean, Thanks for reading the reviews and giving us a chance! We believe in giving good value for our services and we are glad you enjoyed our fluffy pancakes! We hope to see you again! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:23.140756",
            "review_likes_count": 2,
            "total_number_of_reviews_by_reviewer": 13,
            "total_number_of_photos_by_reviewer": 14,
            "reviewer_url": "https://www.google.com/maps/contrib/109724096463560158440/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaEpLM2tRRRAB",
            "reviewer_name": "John Szeto",
            "rating": 5,
            "review_text": "Fantastic hidden Gem of a cafe. Fluffy pancakes with butter and syrup. Eggs just the way you want. Loaded meat omelette, and I mean it! its LOADED with meat. Great staff!  friendly, polite and welcoming. So glad I stopped by the area. Parking inside and outside. Will come back later for sure to try the burgers and Chinese food.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:23.143707",
            "response_from_owner_text": "Hi John, You are fantastic! Thanks and much appreciated for your support! We look forward to you coming back to try our burgers and asian food! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:23.143707",
            "review_likes_count": 3,
            "total_number_of_reviews_by_reviewer": 49,
            "total_number_of_photos_by_reviewer": 184,
            "reviewer_url": "https://www.google.com/maps/contrib/115368030664128759356/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabUlhX1VBEAE",
            "reviewer_name": "Matthew Chan",
            "rating": 5,
            "review_text": "Excellent brekky, extra hash browns is a must. If doing Chinese, you NEED to try the hot sauce. HK style, but more flavourful. The food is home style, literally how my mother used to make. Also, dry garlic pork is fantastic!",
            "published_at": "2 months ago",
            "published_at_date": "2023-10-01 02:07:23.146543",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 236,
            "total_number_of_photos_by_reviewer": 337,
            "reviewer_url": "https://www.google.com/maps/contrib/106816392798346926937/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbWFYdnFRRRAB",
            "reviewer_name": "S M",
            "rating": 5,
            "review_text": "This is a hidden gem for the best Chinese food in town. Classic wonton noodles / char siu. Sweet and sour pork with fried rice. Chow mein noodles are classic not to mention egg rolls are very crispy. Family-owned business.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:23.149303",
            "response_from_owner_text": "Hi Steve, You are a Gem! We are definitely well hiddened! Glad you enjoyed our housmade chinese dishes! We make 90% of the menu all in house! Thanks and much appreciated for sharing your experience and we look forward to your next visit! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:23.149303",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 198,
            "total_number_of_photos_by_reviewer": 1052,
            "reviewer_url": "https://www.google.com/maps/contrib/104442419305122288584/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Mzd5NENnEAE",
            "reviewer_name": "P  Parzoufoodie ",
            "rating": 5,
            "review_text": "Legendary spot with aces of service. The food was excellent. From the location you know they went all in with the food and the service.",
            "published_at": "5 months ago",
            "published_at_date": "2023-07-01 02:07:23.151729",
            "response_from_owner_text": "Hi P, Thank you for the 5-star review. We truly appreciate it! Feeling the love and support!  Glad you enjoyed the great food and experience.  We look forward to having you back soon!  :) Richard and Raymond",
            "response_from_owner_ago": "3 months ago",
            "response_from_owner_date": "2023-09-01 02:07:23.151729",
            "review_likes_count": 1,
            "total_number_of_reviews_by_reviewer": 128,
            "total_number_of_photos_by_reviewer": 254,
            "reviewer_url": "https://www.google.com/maps/contrib/102943716723170747503/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c1ptVUVBEAE",
            "reviewer_name": "Glen Campbell",
            "rating": 5,
            "review_text": "A place you would not expect. Once you walk in.Great service fantastic food . Very quick as well. Good background music.  Family owned and operated.  Great experience will definitely visit again",
            "published_at": "a month ago",
            "published_at_date": "2023-11-01 02:07:23.154844",
            "response_from_owner_text": "",
            "response_from_owner_ago": "",
            "response_from_owner_date": null,
            "review_likes_count": 0,
            "total_number_of_reviews_by_reviewer": 25,
            "total_number_of_photos_by_reviewer": null,
            "reviewer_url": "https://www.google.com/maps/contrib/109740671575418384109/reviews?entry=ttu",
            "is_local_guide": false,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtaE11bkJBEAE",
            "reviewer_name": "Karen C.",
            "rating": 5,
            "review_text": "Cool mom and pop cafe tucked away in a building supply yard. Great variety of dishes from all day breakfast (mind you they close at 3pm), classic burgers, and even Asian food. Lovely service where they can chat you up and answer your questions.",
            "published_at": "a year ago",
            "published_at_date": "2022-12-01 02:07:23.157919",
            "response_from_owner_text": "Hi Karen, Thanks and much appreciated for your review! We are glad you enjoyed your experience and we hope to see you again! Raymond",
            "response_from_owner_ago": "a year ago",
            "response_from_owner_date": "2022-12-01 02:07:23.157919",
            "review_likes_count": 4,
            "total_number_of_reviews_by_reviewer": 93,
            "total_number_of_photos_by_reviewer": 1054,
            "reviewer_url": "https://www.google.com/maps/contrib/104294089018560890907/reviews?entry=ttu",
            "is_local_guide": true,
            "review_translated_text": null,
            "response_from_owner_translated_text": null
        }
    ]
}